<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="随笔," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x5728;&amp;#x6211;&amp;#x751F;&amp;#x547D;&amp;#x5F53;&amp;#x4E2D;&amp;#xFF0C;&amp;#x4E09;&amp;#x5341;&amp;#x5C81;&amp;#x4EE5;&amp;#x540E;&amp;#x80FD;&amp;#x7559;&amp;#x4E0B;&amp;#x6DF1;&amp;#x523B;&amp;#x5370;&amp;#x8BB0;&amp;#x7684;&amp;#x4E8B;&amp;#x4EF6;&amp;#x4E0D;&amp;#x591A;&amp;#xFF0C;">
<meta property="og:type" content="article">
<meta property="og:title" content="攀登岗什卡（一）">
<meta property="og:url" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/index.html">
<meta property="og:site_name" content="Palance's Blog">
<meta property="og:description" content="&amp;#x5728;&amp;#x6211;&amp;#x751F;&amp;#x547D;&amp;#x5F53;&amp;#x4E2D;&amp;#xFF0C;&amp;#x4E09;&amp;#x5341;&amp;#x5C81;&amp;#x4EE5;&amp;#x540E;&amp;#x80FD;&amp;#x7559;&amp;#x4E0B;&amp;#x6DF1;&amp;#x523B;&amp;#x5370;&amp;#x8BB0;&amp;#x7684;&amp;#x4E8B;&amp;#x4EF6;&amp;#x4E0D;&amp;#x591A;&amp;#xFF0C;">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/岗什卡登顶证书.png">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/落地西宁.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/胡吃海塞.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/奔赴大本营.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/奔赴大本营2.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/踌躇满志.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/到达大本营.png">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/木屋睡袋.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/拉练.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/拉练休息.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/拉练休息2.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/拉练Ruby.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/拉练休息3.jpg">
<meta property="og:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/岗什卡山顶.jpg">
<meta property="og:updated_time" content="2017-06-27T17:00:39.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="攀登岗什卡（一）">
<meta name="twitter:description" content="&amp;#x5728;&amp;#x6211;&amp;#x751F;&amp;#x547D;&amp;#x5F53;&amp;#x4E2D;&amp;#xFF0C;&amp;#x4E09;&amp;#x5341;&amp;#x5C81;&amp;#x4EE5;&amp;#x540E;&amp;#x80FD;&amp;#x7559;&amp;#x4E0B;&amp;#x6DF1;&amp;#x523B;&amp;#x5370;&amp;#x8BB0;&amp;#x7684;&amp;#x4E8B;&amp;#x4EF6;&amp;#x4E0D;&amp;#x591A;&amp;#xFF0C;">
<meta name="twitter:image" content="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/岗什卡登顶证书.png">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/"/>

  <title> 攀登岗什卡（一） | Palance's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e9c9a05f15583e8039e36cfe85103e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Palance's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                攀登岗什卡（一）
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2017-06-27T23:00:00+08:00" content="2017-06-27">
              2017-06-27
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/随笔笔记/" itemprop="url" rel="index">
                    <span itemprop="name">随笔笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2017/06/27/2017/0627岗什卡01/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/06/27/2017/0627岗什卡01/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5728;&#x6211;&#x751F;&#x547D;&#x5F53;&#x4E2D;&#xFF0C;&#x4E09;&#x5341;&#x5C81;&#x4EE5;&#x540E;&#x80FD;&#x7559;&#x4E0B;&#x6DF1;&#x523B;&#x5370;&#x8BB0;&#x7684;&#x4E8B;&#x4EF6;&#x4E0D;&#x591A;&#xFF0C;&#x6BCF;&#x5929;&#x8C8C;&#x4F3C;&#x5FD9;&#x5FD9;&#x788C;&#x788C;&#x7684;&#xFF0C;&#x597D;&#x51E0;&#x5E74;&#x65F6;&#x95F4;&#x77AC;&#x95F4;&#x6ED1;&#x8FC7;&#xFF0C;&#x597D;&#x50CF;&#x5C31;&#x53EA;&#x8FC7;&#x53BB;&#x51E0;&#x5929;&#x3002;&#x800C;&#x8FD9;&#x6B21;&#x767B;&#x9876;&#x5C97;&#x4EC0;&#x5361;&#xFF0C;&#x7EDD;&#x5BF9;&#x662F;&#x63D2;&#x5728;&#x6211;&#x4EBA;&#x751F;&#x65C5;&#x9014;&#x4E2D;&#x7684;&#x4E00;&#x652F;&#x9192;&#x76EE;&#x7684;&#x65D7;&#x6807;&#x3002;<a id="more"></a></p>
<p>&#x5148;&#x6765;&#x79C0;&#x4E00;&#x4E0B;&#x767B;&#x9876;&#x8BC1;&#x4E66;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x5C97;&#x4EC0;&#x5361;&#x767B;&#x9876;&#x8BC1;&#x4E66;.png" alt="&#x767B;&#x9876;&#x8BC1;&#x4E66;"></p>
<p>&#x5C97;&#x4EC0;&#x5361;&#x7684;&#x767B;&#x5C71;&#x8BA1;&#x5212;&#x662F;&#x7531;&#x5927;&#x54E5;&#x53D1;&#x8D77;&#xFF0C;&#x915D;&#x917F;&#x4E24;&#x4E2A;&#x591A;&#x6708;&#xFF0C;&#x7EC8;&#x4E8E;&#x5728;6&#x6708;23&#x65E5;&#x6210;&#x884C;&#x3002;&#x6211;&#x672C;&#x6765;&#x6CA1;&#x6253;&#x7B97;&#x53C2;&#x52A0;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECA;&#x5E74;&#x4E94;&#x516D;&#x6708;&#x4EFD;&#x7684;&#x5DEE;&#x65C5;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x672C;&#x60F3;&#x5728;&#x516D;&#x6708;&#x5E95;&#x597D;&#x597D;&#x4F11;&#x606F;&#x3002;&#x540E;&#x6765;&#x7ECF;&#x4E0D;&#x4F4F;&#x4E8C;&#x54E5;&#x6311;&#x9017;&#xFF0C;&#x62B1;&#x7740;&#x6253;&#x9171;&#x6CB9;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x5C31;&#x5165;&#x4F19;&#x4E86;&#xFF0C;&#x76F4;&#x5230;&#x843D;&#x5730;&#x897F;&#x5B81;&#x8FD8;&#x662F;&#x89C2;&#x5149;&#x5BA2;&#x4E00;&#x679A;&#x3002;&#x4E00;&#x5F20;&#x5145;&#x6EE1;&#x4EEA;&#x5F0F;&#x611F;&#x7684;&#x5408;&#x5F71;&#x4E4B;&#x540E;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x843D;&#x5730;&#x897F;&#x5B81;.jpg" alt="&#x843D;&#x5730;&#x897F;&#x5B81;">&#x5C31;&#x8FDB;&#x5165;&#x4E86;&#x80E1;&#x5403;&#x6D77;&#x585E;&#x7684;&#x8282;&#x594F;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x80E1;&#x5403;&#x6D77;&#x585E;.jpg" alt="&#x80E1;&#x5403;&#x6D77;&#x585E;">&#x7F8A;&#x8089;&#x4E32;&#x3001;&#x5927;&#x8170;&#x5B50;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x6559;&#x7EC3;&#x53EE;&#x5631;&#x767B;&#x5C71;&#x524D;&#x4E0D;&#x51C6;&#x559D;&#x9152;&#xFF0C;&#x684C;&#x4E0A;&#x7801;&#x51FA;&#x4E00;&#x6392;&#x9152;&#x74F6;&#x624D;&#x662F;&#x6807;&#x914D;&#xFF01;</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#xFF08;24&#x65E5;&#xFF09;&#x4E00;&#x65E9;&#x5C31;&#x88AB;&#x8FC5;&#x901F;&#x62C9;&#x5165;&#x89D2;&#x8272;&#xFF0C;&#x4E0A;&#x5348;10&#x70B9;&#x949F;&#x51FA;&#x53D1;&#xFF0C;&#x4E09;&#x4E2A;&#x5C0F;&#x65F6;&#x5F92;&#x6B65;3.5&#x516C;&#x91CC;&#xFF0C;&#x5230;&#x8FBE;&#x6D77;&#x62D4;4300&#x591A;&#x7C73;&#x7684;&#x5927;&#x672C;&#x8425;&#x3002;&#x4E00;&#x8DEF;&#x4E0A;&#x7684;&#x98CE;&#x666F;&#x5C31;&#x50CF;&#x897F;&#x5317;&#x6C49;&#x5B50;&#x4E00;&#x6837;&#x7C97;&#x72C2;&#x4E0D;&#x7F81;&#xFF0C;&#x5076;&#x5C14;&#x8FD8;&#x80FD;&#x770B;&#x5230;&#x4E0D;&#x8FDC;&#x5904;&#x7684;&#x96EA;&#x5C71;&#x9876;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x5954;&#x8D74;&#x5927;&#x672C;&#x8425;.jpg" alt="&#x5954;&#x8D74;&#x5927;&#x672C;&#x8425;">&#x968F;&#x7740;&#x9732;&#x51FA;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x767D;&#x8272;&#x5C71;&#x5C16;&#xFF0C;&#x5185;&#x5FC3;&#x91CC;&#x7684;&#x6FC0;&#x52A8;&#x4E5F;&#x5F00;&#x59CB;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x5B89;&#x5206;&#x4E86;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x5954;&#x8D74;&#x5927;&#x672C;&#x8425;2.jpg" alt="&#x5954;&#x8D74;&#x5927;&#x672C;&#x8425;2">&#x65E0;&#x6CD5;&#x63A9;&#x9970;&#x4E00;&#x526F;&#x8E0C;&#x8E87;&#x6EE1;&#x5FD7;&#x7684;&#x8868;&#x60C5;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x8E0C;&#x8E87;&#x6EE1;&#x5FD7;.jpg" alt="&#x8E0C;&#x8E87;&#x6EE1;&#x5FD7;">&#x4E2D;&#x5348;1&#x70B9;&#x591A;&#x5230;&#x8FBE;&#x5927;&#x672C;&#x8425;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x5230;&#x8FBE;&#x5927;&#x672C;&#x8425;.png" alt="&#x5230;&#x8FBE;&#x5927;&#x672C;&#x8425;"></p>
<p>&#x6309;&#x7167;&#x8BA1;&#x5212;&#xFF0C;&#x5F53;&#x5929;&#x4E0B;&#x5348;&#x4F11;&#x606F;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x51FA;&#x6765;&#x62C9;&#x7EC3;&#x3001;&#x9002;&#x5E94;&#xFF0C;&#x7B2C;&#x4E09;&#x5929;&#x767B;&#x9876;&#x3002;&#x6B64;&#x65F6;&#x4E00;&#x76F4;&#x4EE4;&#x6211;&#x5185;&#x5FC3;&#x4E0D;&#x5B89;&#x7684;&#x662F;&#xFF1A;&#x722C;&#x96EA;&#x5C71;&#x4F1A;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x9AD8;&#x539F;&#x53CD;&#x5E94;&#xFF1F;&#x5982;&#x679C;&#x722C;&#x5230;&#x534A;&#x5C71;&#x8170;&#x9AD8;&#x53CD;&#x4E86;&#x8C01;&#x628A;&#x6211;&#x625B;&#x4E0B;&#x53BB;&#xFF1F;&#x5982;&#x679C;&#x5C71;&#x4E0A;&#x51FA;&#x73B0;&#x66B4;&#x98CE;&#x96EA;&#xFF0C;&#x5929;&#x660F;&#x5730;&#x6697;&#x3001;&#x98DE;&#x6C99;&#x8D70;&#x77F3;&#xFF0C;&#x4F1A;&#x4E0D;&#x4F1A;&#x5C0F;&#x547D;&#x5C31;&#x4EA4;&#x4EE3;&#x5728;&#x5C71;&#x4E0A;&#xFF1F;&#x7136;&#x800C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x6211;&#x60F3;&#x591A;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x62CD;&#x5B8C;&#x4E0A;&#x9762;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x8FDB;&#x5165;&#x5927;&#x672C;&#x8425;&#xFF0C;&#x6211;&#x5C31;&#x5DEE;&#x4E0D;&#x591A;&#x5931;&#x5FC6;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x6240;&#x8C13;&#x5927;&#x672C;&#x8425;&#x5C31;&#x662F;&#x4E00;&#x680B;&#x6728;&#x5C4B;&#xFF0C;&#x665A;&#x4E0A;&#x5728;&#x8FD9;&#x91CC;&#x4F11;&#x606F;&#xFF0C;&#x88C5;&#x5907;&#x90FD;&#x8FD0;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x4F5C;&#x4E3A;&#x51B2;&#x9876;&#x7684;&#x57FA;&#x5730;&#x3002;&#x521A;&#x8FDB;&#x5C4B;&#x843D;&#x4E0B;&#x811A;&#xFF0C;&#x6211;&#x5C31;&#x5F00;&#x59CB;&#x5267;&#x70C8;&#x5934;&#x75DB;&#xFF0C;&#x53CD;&#x80C3;&#x3002;&#x521A;&#x521A;&#x5F92;&#x6B65;&#x90A3;3.5&#x516C;&#x91CC;&#x66F4;&#x50CF;&#x662F;&#x4E0B;&#x809A;&#x4E86;&#x534A;&#x65A4;&#x52A3;&#x8D28;&#x767D;&#x9152;&#xFF0C;&#x6B64;&#x65F6;&#x5DF2;&#x878D;&#x5165;&#x6D51;&#x8EAB;&#x7684;&#x8840;&#x6DB2;&#xFF0C;&#x5F00;&#x59CB;&#x5728;&#x4F53;&#x5185;&#x6492;&#x6B22;&#xFF0C;&#x8BA9;&#x4F60;&#x60F3;&#x5410;&#x53C8;&#x5410;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x6559;&#x7EC3;&#x4E0D;&#x8BA9;&#x7761;&#x89C9;&#xFF0C;&#x56E0;&#x4E3A;&#x7761;&#x592A;&#x65E9;&#x591C;&#x91CC;&#x4F1A;&#x96BE;&#x53D7;&#x5730;&#x9192;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x66F4;&#x96BE;&#x5165;&#x7761;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x4F1A;&#x66F4;&#x96BE;&#x53D7;&#x3002;</p>
<p>&#x636E;&#x8BF4;&#x4E00;&#x4E0B;&#x5348;&#x6211;&#x90FD;&#x95ED;&#x7740;&#x773C;&#x775B;&#xFF0C;&#x5939;&#x7740;&#x5C3E;&#x5DF4;&#xFF0C;&#x8737;&#x5728;&#x9A6C;&#x624E;&#x4E0A;&#x3002;&#x8BF4;&#x5931;&#x5FC6;&#x4E5F;&#x4E0D;&#x51C6;&#x786E;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x80FD;&#x542C;&#x5230;&#x8EAB;&#x8FB9;&#x7684;&#x4EBA;&#x5728;&#x8D70;&#x52A8;&#x3001;&#x8BF4;&#x8BDD;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4ECE;&#x5929;&#x4E0A;&#x4F20;&#x4E0B;&#x6765;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x55E1;&#x55E1;&#x4F5C;&#x54CD;&#xFF1B;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x5FCD;&#x53D7;&#x6765;&#x81EA;&#x81EA;&#x5DF1;&#x9A71;&#x58F3;&#x91CC;&#x7684;&#x79CD;&#x79CD;&#x96BE;&#x53D7;&#xFF0C;&#x771F;&#x60F3;&#x4ECE;&#x8FD9;&#x9A71;&#x58F3;&#x91CC;&#x62BD;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x53C8;&#x505A;&#x4E0D;&#x5230;&#x3002;&#x90A3;&#x771F;&#x7684;&#x6BD4;&#x6B7B;&#x8FD8;&#x96BE;&#x53D7;&#xFF01;&#x4E0D;&#x77E5;&#x9053;&#x90A3;&#x4E00;&#x4E0B;&#x5348;&#x7684;&#x6002;&#x6837;&#x6709;&#x6CA1;&#x6709;&#x88AB;&#x4EBA;&#x62CD;&#x5230;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x56DE;&#x5934;&#x4F1A;&#x8865;&#x4E00;&#x5F20;:)</p>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x6328;&#x5230;&#x4E86;&#x665A;&#x4E0A;&#x5341;&#x70B9;&#x949F;&#x3002;&#x7EC8;&#x4E8E;&#xFF0C;&#x7EC8;&#x4E8E;&#x6559;&#x7EC3;&#x653E;&#x6211;&#x4EEC;&#x7761;&#x89C9;&#x4E86;&#x3002;&#x7761;&#x524D;&#x60F3;&#x6700;&#x591A;&#x7684;&#x5C31;&#x662F;&#x2014;&#x2014;&#x8001;&#x5B50;&#x4E0D;&#x722C;&#x4E86;&#xFF01;&#x5750;&#x90A3;&#x5598;&#x53E3;&#x6C14;&#x513F;&#x90FD;&#x662F;&#x8D1F;&#x62C5;&#xFF0C;&#x722C;&#x5C71;&#xFF1F;&#x53BB;&#x4ED6;&#x59E5;&#x59E5;&#x7684;&#x2026;&#x2026; &#x7761;&#x524D;&#x6211;&#x8FD8;&#x8270;&#x96BE;&#x5730;&#x7741;&#x5F00;&#x773C;&#x775B;&#x73AF;&#x987E;&#x4E0B;&#x56DB;&#x5468;&#xFF0C;&#x53D1;&#x73B0;Ruby&#x9AD8;&#x53CD;&#x4E5F;&#x633A;&#x4E25;&#x91CD;&#x7684;&#xFF0C;&#x4E0D;&#x7981;&#x5FC3;&#x4E2D;&#x6697;&#x559C;&#xFF0C;&#x660E;&#x513F;&#x6253;&#x9000;&#x5802;&#x9F13;&#x6709;&#x4F34;&#x4E86;&#xFF0C;&#x597D;&#x6B79;&#x8001;&#x5B50;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x6002;&#x5305;&#x3002;&#x4E0D;&#x8FC7;&#x4EBA;&#x5BB6;Ruby&#x662F;&#x5973;&#x751F;&#x2026;&#x2026;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x5C31;&#x7B97;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#xFF0C;&#x8001;&#x5B50;&#x4E5F;&#x4E0D;&#x722C;&#x4E86;&#xFF0C;&#x592A;tm&#x96BE;&#x53D7;&#x4E86;&#xFF0C;&#x5B9E;&#x5728;&#x625B;&#x4E0D;&#x4F4F;&#xFF01;&#x5C97;&#x4EC0;&#x5361;&#xFF0C;&#x62DC;&#x4E00;&#x4E2A;&#x62DC;&#x5566;~</p>
<p>&#x6211;&#x4ECE;&#x665A;&#x4E0A;&#x5341;&#x70B9;&#x7761;&#x5230;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x4E5D;&#x70B9;&#xFF0C;&#x4E2D;&#x95F4;&#x8981;&#x4E0D;&#x662F;&#x88AB;&#x5C3F;&#x618B;&#x9192;&#xFF0C;&#x90A3;&#x4E00;&#x89C9;&#x5C31;&#x5B8C;&#x7F8E;&#x4E86;&#x3002;&#x8BF4;&#x8D77;&#x665A;&#x4E0A;&#x6492;&#x5C3F;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x723D;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x4ECE;&#x70ED;&#x4E4E;&#x4E4E;&#x7684;&#x7761;&#x888B;&#x91CC;&#x94BB;&#x51FA;&#x6765;&#xFF0C;&#x7A7F;&#x597D;&#x7ED2;&#x8863;&#x3001;&#x7FBD;&#x7ED2;&#x670D;&#xFF0C;&#x5230;&#x95E8;&#x53E3;&#x8131;&#x4E0B;&#x4FDD;&#x6696;&#x978B;&#x6362;&#x4E0A;&#x5916;&#x51FA;&#x7684;&#x767B;&#x5C71;&#x978B;&#xFF0C;&#x51FA;&#x53BB;&#x627E;&#x4E2A;&#x7A7A;&#x5730;&#x513F;&#x89E3;&#x51B3;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x56DE;&#x6765;&#x6362;&#x978B;&#x3001;&#x8131;&#x8863;&#x670D;&#x3001;&#x94BB;&#x5165;&#x7761;&#x888B;&#x3002;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x7761;&#x888B;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x6728;&#x5C4B;&#x7761;&#x888B;.jpg" alt="&#x6728;&#x5C4B;&#x7761;&#x888B;">&#x7761;&#x888B;&#x662F;&#x7528;&#x62C9;&#x94FE;&#x62C9;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x8BA9;&#x70ED;&#x6C14;&#x6563;&#x6389;&#xFF0C;&#x8D77;&#x591C;&#x8981;&#x5C3D;&#x91CF;&#x62C9;&#x5F00;&#x4E00;&#x4E2A;&#x5C0F;&#x53E3;&#xFF0C;&#x4ECE;&#x91CC;&#x9762;&#x94BB;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5657;&#x55E4;&#x62C9;&#x5F00;&#x534A;&#x622A;&#x4ECE;&#x91CC;&#x9762;&#x8DF3;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8981;&#x4E0D;&#x8981;&#x8D77;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x5148;&#x6597;&#x4E89;&#x4E86;&#x4E8C;&#x5341;&#x5206;&#x949F;&#x2014;&#x2014;&#x4ED6;&#x59E5;&#x59E5;&#x7684;&#x665A;&#x4E0A;&#x6CA1;&#x5403;&#x6CA1;&#x559D;&#x600E;&#x4E48;&#x4F1A;&#x6709;&#x5C3F;&#x5462;&#xFF1F;&#x4E0D;&#x4F1A;&#x662F;&#x505A;&#x68A6;&#x5427;&#xFF1F;&#x597D;&#x50CF;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x8C28;&#x614E;&#x4E00;&#x70B9;&#xFF0C;&#x522B;&#x4E00;&#x4E2A;&#x4E0D;&#x5C0F;&#x5FC3;&#x5C3F;&#x7761;&#x888B;&#x91CC;&#x53EF;&#x5C31;&#x7CD7;&#x5927;&#x4E86;&#x2026;&#x2026;&#x518D;&#x618B;&#x4E00;&#x4F1A;&#xFF1F;&#x53EF;&#x8FD9;&#x624D;&#x51CC;&#x6668;&#x4E00;&#x70B9;&#x591A;&#xFF0C;&#x618B;&#x5230;&#x5929;&#x4EAE;&#x975E;&#x70B8;&#x4E86;&#x2026;&#x2026;&#x6700;&#x540E;&#x53EA;&#x597D;&#x50CF;&#x8C46;&#x866B;&#x8715;&#x76AE;&#x4E00;&#x6837;&#x4ECE;&#x7761;&#x888B;&#x91CC;&#x7FFB;&#x6EDA;&#x7740;&#x94BB;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x94BB;&#x51FA;&#x4E00;&#x8EAB;&#x767D;&#x6BDB;&#x6C57;&#xFF0C;&#x7761;&#x610F;&#x5168;&#x65E0;&#x3002;&#x56DE;&#x6765;&#x94BB;&#x8FDB;&#x53BB;&#x597D;&#x50CF;&#x6BD4;&#x94BB;&#x51FA;&#x6765;&#x66F4;&#x96BE;&#xFF0C;&#x53EA;&#x597D;&#x628A;&#x62C9;&#x94FE;&#x7684;&#x53E3;&#x62C9;&#x5927;&#x4E00;&#x4E9B;&#x3002;&#x65E9;&#x77E5;&#x5982;&#x6B64;&#xFF0C;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x76F4;&#x63A5;&#x62C9;&#x5F00;&#x4E86;&#x561B;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x5929;&#xFF08;25&#x65E5;&#xFF09;&#x9192;&#x6765;&#xFF0C;&#x6211;&#x60CA;&#x559C;&#x5730;&#x53D1;&#x73B0;&#x4E0D;&#x53CD;&#x80C3;&#x4E86;&#xFF0C;&#x5934;&#x75BC;&#x597D;&#x50CF;&#x4E5F;&#x7F13;&#x89E3;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x8279;&#xFF0C;&#x6628;&#x5929;&#x5230;&#x5E95;&#x662F;&#x8D70;&#x4E86;3.5&#x516C;&#x91CC;&#x8FD8;&#x662F;&#x559D;&#x4E86;&#x534A;&#x65A4;&#x767D;&#x9152;&#xFF1F;&#x600E;&#x4E48;&#x8DDF;&#x559D;&#x4E86;&#x9152;&#x7684;&#x611F;&#x89C9;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x771F;&#x5730;&#x662F;&#x559D;&#x9AD8;&#x4E86;&#xFF0C;&#x90A3;&#x75C7;&#x72B6;&#x5E94;&#x8BE5;&#x8D8A;&#x6765;&#x8D8A;&#x8F7B;&#xFF0C;&#x5F04;&#x4E0D;&#x597D;&#x660E;&#x5929;&#x53EF;&#x4EE5;&#x51B2;&#x9876;&#x54E6;~ &#x8FD9;&#x4E00;&#x5929;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x51FA;&#x6765;&#x505A;&#x9002;&#x5E94;&#x6027;&#x62C9;&#x7EC3;&#xFF0C;&#x65E9;&#x996D;&#x5DF2;&#x7ECF;&#x6709;&#x80C3;&#x53E3;&#x4E86;&#xFF0C;&#x5403;&#x70B9;&#x4E1C;&#x897F;&#x597D;&#x50CF;&#x53EF;&#x4EE5;&#x8DDF;&#x6559;&#x7EC3;&#x51FA;&#x6765;&#x6D3B;&#x52A8;&#x4E86;&#x3002;Ruby&#x8FD8;&#x662F;&#x8DDF;&#x6628;&#x5929;&#x4E00;&#x6837;&#x75DB;&#x82E6;&#xFF0C;&#x53EF;&#x662F;&#x5979;&#x8FD8;&#x662F;&#x575A;&#x6301;&#x51FA;&#x6765;&#x62C9;&#x7EC3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x8BF4;&#x4E0D;&#x884C;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x5728;&#x6709;&#x70B9;&#x592A;&#x4E22;&#x4EBA;&#x3002;&#x54CE;&#xFF0C;&#x771F;&#x662F;&#x4E0A;&#x4E86;&#x8D3C;&#x8239;&#xFF0C;&#x51FA;&#x53D1;&#x5427;&#xFF01;</p>
<p>&#x8FD9;&#x5929;&#x4E0A;&#x5348;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x7A7F;&#x4E0A;&#x9AD8;&#x5C71;&#x9774;&#x3001;&#x96EA;&#x5957;&#xFF0C;&#x8D70;&#x4E0A;&#x51E0;&#x516C;&#x91CC;&#x9002;&#x5E94;&#x4E00;&#x4E0B;&#x978B;&#x5B50;&#x3001;&#x9053;&#x8DEF;&#x3001;&#x7A7A;&#x6C14;&#xFF0C;&#x518D;&#x627E;&#x4E2A;&#x5C0F;&#x96EA;&#x5761;&#xFF0C;&#x5B66;&#x4E60;&#x600E;&#x4E48;&#x4E0A;&#x4E0B;&#x3002;&#x5927;&#x5BB6;&#x9AD8;&#x53CD;&#x540E;&#x7684;&#x72B6;&#x6001;&#x90FD;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x662F;&#x6BD4;&#x8F83;&#x65E9;&#x51FA;&#x73B0;&#x53CD;&#x5E94;&#x7684;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x5C31;&#x660E;&#x663E;&#x7F13;&#x89E3;&#x4E86;&#xFF1B;&#x6709;&#x4EBA;&#x591C;&#x91CC;&#x7761;&#x89C9;&#x5F00;&#x59CB;&#x9AD8;&#x53CD;&#xFF0C;&#x65E9;&#x4E0A;&#x9192;&#x6765;&#x4E5F;&#x7F13;&#x89E3;&#x4E86;&#xFF0C;&#x4E8C;&#x54E5;&#x5C5E;&#x4E8E;&#x8FD9;&#x79CD;&#xFF1B;&#x4E5F;&#x6709;&#x7B2C;&#x4E8C;&#x5929;&#x5F00;&#x59CB;&#x5934;&#x75BC;&#xFF0C;&#x53EA;&#x662F;&#x6CA1;&#x90A3;&#x4E48;&#x4E25;&#x91CD;&#xFF0C;&#x6653;&#x5CF0;&#x5C5E;&#x4E8E;&#x8FD9;&#x79CD;&#xFF1B;&#x8FD8;&#x6709;&#x6B66;&#x7237;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x53D7;&#x7684;&#xFF1B;&#x6700;&#x75DB;&#x82E6;&#x7684;&#x8FD8;&#x662F;Ruby&#xFF0C;&#x8DDF;&#x6211;&#x5DEE;&#x4E0D;&#x591A;&#x540C;&#x65F6;&#x9AD8;&#x53CD;&#xFF0C;&#x76F4;&#x5230;&#x4ECE;&#x5927;&#x672C;&#x8425;&#x64A4;&#x4E0B;&#x5C71;&#x624D;&#x597D;&#x8F6C;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x54EA;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x4E00;&#x5929;&#x5927;&#x5BB6;&#x5168;&#x90FD;&#x96C6;&#x4F53;&#x51FA;&#x6765;&#x62C9;&#x7EC3;&#xFF0C;&#x6CA1;&#x5C11;&#x8D70;&#x4E00;&#x6B65;&#x8DEF;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x56E2;&#x961F;&#x5F88;&#x725B;&#x903C;&#xFF01;</p>
<p>&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5B66;&#x4E60;&#x8D70;&#x96EA;&#x5761;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x62C9;&#x7EC3;.jpg" alt="&#x62C9;&#x7EC3;">&#x7D2F;&#x4E86;&#x4F11;&#x606F;&#xFF0C;&#x6C14;&#x8272;&#x771F;&#x5730;&#x597D;&#x4E86;&#x5F88;&#x591A;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x62C9;&#x7EC3;&#x4F11;&#x606F;.jpg" alt="&#x62C9;&#x7EC3;&#x4F11;&#x606F;">&#x540E;&#x9762;&#x96EA;&#x5761;&#x4E0A;&#x662F;&#x6211;&#x4EEC;&#x8D70;&#x51FA;&#x7684;&#x811A;&#x5370;&#xFF0C;&#x7A0D;&#x5FAE;&#x8FD0;&#x52A8;&#x51E0;&#x4E0B;&#xFF0C;&#x9AD8;&#x53CD;&#x75C7;&#x72B6;&#x968F;&#x65F6;&#x53CD;&#x6251;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x96EA;&#x5761;&#x4E0A;&#x5370;&#x51FA;&#x8FD9;&#x4E9B;&#x75D5;&#x8FF9;&#x5DEE;&#x4E0D;&#x591A;&#x7B49;&#x6548;&#x4E8E;&#x4E8C;&#x4E24;&#x767D;&#x9152;&#x5427;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x62C9;&#x7EC3;&#x4F11;&#x606F;2.jpg" alt="&#x62C9;&#x7EC3;&#x4F11;&#x606F;2">&#x8FD9;&#x59D1;&#x5A18;&#x5C31;&#x662F;&#x5014;&#x5F3A;&#x7684;Ruby&#xFF0C;&#x6211;&#x8981;&#x662F;&#x9AD8;&#x53CD;&#x6210;&#x5979;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x5929;&#x65E9;&#x4E0A;&#x7EDD;&#x5BF9;&#x4E0D;&#x51FA;&#x6765;&#x4E86;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x62C9;&#x7EC3;Ruby.jpg" alt="&#x62C9;&#x7EC3;Ruby">&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x9017;&#x6BD4;&#xFF0C;&#x4E8C;&#x54E5;&#x548C;&#x6653;&#x5CF0;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x62C9;&#x7EC3;&#x4F11;&#x606F;3.jpg" alt="&#x62C9;&#x7EC3;&#x4F11;&#x606F;3">&#x8FD9;&#x4E00;&#x5929;&#x5DF2;&#x7ECF;&#x80FD;&#x6E05;&#x6670;&#x5730;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x5373;&#x5C06;&#x6311;&#x6218;&#x7684;&#x5C71;&#x5CF0;&#xFF0C;&#x6700;&#x9AD8;&#x90A3;&#x4E2A;&#x5C16;&#x5C16;&#x5C31;&#x662F;&#xFF1A;<img src="/2017/06/27/2017/0627&#x5C97;&#x4EC0;&#x5361;01/&#x5C97;&#x4EC0;&#x5361;&#x5C71;&#x9876;.jpg" alt="&#x5C97;&#x4EC0;&#x5361;&#x5C71;&#x9876;"></p>
<p>&#x4E0A;&#x5348;&#x5B8C;&#x6210;&#x62C9;&#x7EC3;&#xFF0C;&#x4E2D;&#x5348;&#x56DE;&#x5927;&#x672C;&#x8425;&#x9971;&#x9910;&#x4E00;&#x987F;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4E0B;&#x5348;&#x4E09;&#x70B9;&#x7761;&#x5230;&#x4E94;&#x70B9;&#xFF0C;&#x665A;&#x4E0A;&#x4E00;&#x987F;&#x7F8E;&#x9910;&#x4E4B;&#x540E;&#xFF0C;&#x6559;&#x7EC3;&#x7ED9;&#x6211;&#x4EEC;&#x770B;&#x7EAA;&#x5F55;&#x7247;&#x2014;&#x2014;&#x8BB0;&#x5F55;&#x7684;&#x662F;&#x4ED6;&#x5E26;&#x8FC7;&#x7684;&#x201C;7+2&#x767B;&#x5C71;&#x56E2;&#x201D;&#x3002;&#x6240;&#x8C13;&#x201C;7+2&#x201D;&#x662F;&#x6307;&#x4E03;&#x4E2A;&#x5927;&#x6D32;&#x7684;&#x6700;&#x9AD8;&#x5CF0;+&#x4E24;&#x4E2A;&#x6781;&#x70B9;&#xFF1A;&#x975E;&#x6D32;&#x7684;&#x4E5E;&#x529B;&#x9A6C;&#x624E;&#x7F57;&#xFF08;5895m&#xFF09;&#x3001;&#x4E9A;&#x6D32;&#x73E0;&#x7A46;&#x6717;&#x739B;&#x5CF0;&#xFF08;8844m&#xFF09;&#x3001;&#x5357;&#x7F8E;&#x6D32;&#x963F;&#x7A7A;&#x52A0;&#x74DC;&#xFF08;6962m&#xFF09;&#x3001;&#x5927;&#x6D0B;&#x6D32;&#x67E5;&#x4E9A;&#xFF08;5030m)&#x3001;&#x6B27;&#x6D32;&#x5384;&#x5C14;&#x5E03;&#x9C81;&#x58EB;&#xFF08;5642m&#xFF09;&#x3001;&#x5317;&#x7F8E;&#x6D32;&#x9EA6;&#x91D1;&#x5229;&#xFF08;6194m&#xFF09;&#x3001;&#x5357;&#x6781;&#x6D32;&#x6587;&#x68EE;&#xFF08;4897m&#xFF09;&#x548C;&#x5357;&#x5317;&#x6781;&#x70B9;&#x3002;</p>
<p>&#x770B;&#x5B8C;&#x4E4B;&#x540E;&#x5927;&#x5BB6;&#x8840;&#x8109;&#x8D32;&#x5F20;&#xFF0C;&#x56E0;&#x4E3A;&#x767D;&#x5929;&#x7684;&#x62C9;&#x7EC3;&#x8BA9;&#x5927;&#x5BB6;&#x521D;&#x6B65;&#x4F53;&#x4F1A;&#x5230;&#x4E86;&#x5E26;&#x7740;&#x9AD8;&#x53CD;&#x5728;&#x9AD8;&#x5C71;&#x884C;&#x8D70;&#x3001;&#x6500;&#x767B;&#x65F6;&#x7684;&#x8270;&#x96BE;&#x3002;&#x6559;&#x7EC3;&#x5E26;&#x7684;&#x56E2;&#x961F;&#x6BCF;&#x6B21;&#x51FA;&#x5F81;&#x7684;&#x5E73;&#x5747;&#x5E74;&#x9F84;&#x90FD;&#x8981;&#x6BD4;&#x6211;&#x4EEC;&#x5927;&#xFF0C;&#x4ED6;&#x4EEC;&#x9762;&#x5BF9;&#x6311;&#x6218;&#xFF0C;&#x52C7;&#x6562;&#x9762;&#x5BF9;&#xFF0C;&#x90A3;&#x80A1;&#x8C6A;&#x6C14;&#x611F;&#x67D3;&#x4E86;&#x6211;&#x4EEC;&#x3002;&#x90A3;&#x4E9B;&#x573A;&#x9762;&#x3001;&#x90A3;&#x4E9B;&#x8BDD;&#x8BED;&#x3001;&#x90A3;&#x4E9B;&#x5728;&#x96EA;&#x5C71;&#x4E0B;&#x7684;&#x884C;&#x8D70;&#xFF0C;&#x5E73;&#x65F6;&#x5728;&#x81EA;&#x5BB6;&#x5BA2;&#x5385;&#x91CC;&#x770B;&#x548C;&#x8FD9;&#x4E00;&#x665A;&#x5728;&#x96EA;&#x5C71;&#x811A;&#x4E0B;&#x7684;&#x5927;&#x672C;&#x8425;&#x91CC;&#x770B;&#xFF0C;&#x90A3;&#x611F;&#x53D7;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF01;</p>
<p>&#x7B2C;&#x56DB;&#x5929;&#xFF08;26&#x65E5;&#xFF09;&#x51CC;&#x6668;&#x4E09;&#x70B9;&#xFF0C;&#x6559;&#x7EC3;&#x96C6;&#x5408;&#x4EE4;&#x54CD;&#xFF0C;&#x5927;&#x5BB6;&#x6536;&#x62FE;&#x884C;&#x88C5;&#xFF0C;&#x5411;&#x5C97;&#x4EC0;&#x5361;&#x5C71;&#x9876;&#x884C;&#x8FDB;&#xFF01;</p>
<p>&#x672A;&#x5B8C;&#x5F85;&#x7EED;&#x2026;&#x2026;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/随笔/" rel="tag">#随笔</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/04/16/2017/0416libGooglePinyin01/" rel="next" title="libGooglePinyin（一）构建词库">
                <i class="fa fa-chevron-left"></i> libGooglePinyin（一）构建词库
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/06/27/2017/0627岗什卡01/"
           data-title="攀登岗什卡（一）" data-url="http://palanceli.github.io/2017/06/27/2017/0627岗什卡01/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://avatars0.githubusercontent.com/u/13184524"
               alt="Palance Li" />
          <p class="site-author-name" itemprop="name">Palance Li</p>
          <p class="site-description motion-element" itemprop="description">学习，重生</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">85</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">41</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/palanceli" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/zchongr" target="_blank" title="我的CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的CSDN
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/palance/" target="_blank" title="我的博客园">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的博客园
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/" target="_blank" title="我的简书">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的简书
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Palance Li</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"palanceli"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  

  

  

  

</body>
</html>
