<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="招聘," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x5728;&amp;#x4E0A;&amp;#x4E2A;&amp;#x6708;&amp;#x7684;&amp;#x300A;&amp;#x53C8;&amp;#x662F;&amp;#x4E00;&amp;#x5E74;&amp;#x6821;&amp;#x62DB;&amp;#x5B63;&amp;#x300B;&amp;#x4E2D;&amp;#x6211;&amp;#x68B3;&amp;#x7406;&amp;#x4E86;&amp;#x81EA;&amp;#x5DF1;&amp;#x5728;&amp;#x6821;&amp;#x62DB;&amp;#x65F6;">
<meta property="og:type" content="article">
<meta property="og:title" content="关于面试">
<meta property="og:url" content="http://palanceli.github.io/2016/09/22/2016/0922关于面试/index.html">
<meta property="og:site_name" content="Palance's Blog">
<meta property="og:description" content="&amp;#x5728;&amp;#x4E0A;&amp;#x4E2A;&amp;#x6708;&amp;#x7684;&amp;#x300A;&amp;#x53C8;&amp;#x662F;&amp;#x4E00;&amp;#x5E74;&amp;#x6821;&amp;#x62DB;&amp;#x5B63;&amp;#x300B;&amp;#x4E2D;&amp;#x6211;&amp;#x68B3;&amp;#x7406;&amp;#x4E86;&amp;#x81EA;&amp;#x5DF1;&amp;#x5728;&amp;#x6821;&amp;#x62DB;&amp;#x65F6;">
<meta property="og:updated_time" content="2016-09-24T10:53:43.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="关于面试">
<meta name="twitter:description" content="&amp;#x5728;&amp;#x4E0A;&amp;#x4E2A;&amp;#x6708;&amp;#x7684;&amp;#x300A;&amp;#x53C8;&amp;#x662F;&amp;#x4E00;&amp;#x5E74;&amp;#x6821;&amp;#x62DB;&amp;#x5B63;&amp;#x300B;&amp;#x4E2D;&amp;#x6211;&amp;#x68B3;&amp;#x7406;&amp;#x4E86;&amp;#x81EA;&amp;#x5DF1;&amp;#x5728;&amp;#x6821;&amp;#x62DB;&amp;#x65F6;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://palanceli.github.io/2016/09/22/2016/0922关于面试/"/>

  <title> 关于面试 | Palance's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e9c9a05f15583e8039e36cfe85103e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Palance's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', '1Grug_XAD_ps3zyBywoo','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                关于面试
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-22T22:44:27+08:00" content="2016-09-22">
              2016-09-22
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/随笔笔记/" itemprop="url" rel="index">
                    <span itemprop="name">随笔笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/22/2016/0922关于面试/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/09/22/2016/0922关于面试/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5728;&#x4E0A;&#x4E2A;&#x6708;&#x7684;<a href="http://palanceli.com/2016/08/28/2016/0828%E5%8F%88%E6%98%AF%E4%B8%80%E5%B9%B4%E6%A0%A1%E6%8B%9B%E5%AD%A3/" target="_blank" rel="external">&#x300A;&#x53C8;&#x662F;&#x4E00;&#x5E74;&#x6821;&#x62DB;&#x5B63;&#x300B;</a>&#x4E2D;&#x6211;&#x68B3;&#x7406;&#x4E86;&#x81EA;&#x5DF1;&#x5728;&#x6821;&#x62DB;&#x65F6;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x8E29;&#x8FC7;&#x4E00;&#x4E9B;&#x5751;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x540E;&#x6C89;&#x6DC0;&#x4E0B;&#x6765;&#x7684;&#x505A;&#x6CD5;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x62DB;&#x8058;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x95E8;&#x624B;&#x827A;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x592A;&#x7384;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x6CA1;&#x4F53;&#x4F1A;&#x5230;&#x6709;&#x3002;&#x5FC3;&#x6CD5;&#x4E00;&#xFF1A;&#x8981;&#x60F3;&#x719F;&#xFF0C;&#x552F;&#x6709;&#x591A;&#x7EC3;&#xFF0C;&#x4E09;&#x5929;&#x4E0D;&#x7EC3;&#x624B;&#x751F;&#x3002;&#x90A3;&#x79CD;&#x62DB;&#x8058;&#x5B63;&#x6765;&#x4E86;&#xFF0C;&#x731B;&#x89C1;&#x51E0;&#x5341;&#x4E2A;&#x4EBA;&#xFF0C;&#x4EBA;&#x62DB;&#x6EE1;&#x4E86;&#xFF0C;&#x5C31;&#x95ED;&#x95E8;&#x8C22;&#x5BA2;&#x7684;&#x4E3B;&#x7BA1;&#x662F;&#x4E0D;&#x4F1A;&#x7EC3;&#x51FA;&#x591A;&#x9AD8;&#x660E;&#x7684;&#x62DB;&#x8058;&#x6280;&#x5DE7;&#x7684;&#x3002;&#x8FD9;&#x57FA;&#x672C;&#x4E0A;&#x8DDF;&#x524D;&#x5929;&#x8BB2;&#x7684;&#x5B66;&#x4E60;emacs&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x975E;&#x5E38;&#x9661;&#x5CED;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x5730;&#x6709;&#x6548;&#x79EF;&#x7D2F;&#xFF0C;&#x603B;&#x6709;&#x4E00;&#x5929;&#x80FD;&#x628A;&#x8FD9;&#x95E8;&#x624B;&#x827A;&#x901A;&#x900F;&#x4E0B;&#x6765;&#x3002;&#x6700;&#x6015;&#x7684;&#x5C31;&#x662F;&#x4E0D;&#x5F97;&#x4E0D;&#x505A;&#x7684;&#x65F6;&#x5019;&#x4E34;&#x65F6;&#x62B1;&#x4F5B;&#x811A;&#xFF0C;&#x5E94;&#x4ED8;&#x5B8C;&#x4E86;&#xFF0C;&#x518D;&#x6254;&#x4E00;&#x8FB9;&#xFF0C;&#x4E0B;&#x6B21;&#x53C8;&#x8981;&#x91CD;&#x5934;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x6D6A;&#x8D39;&#x751F;&#x547D;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x4E0D;&#x5982;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x4E0D;&#x8981;&#x505A;&#x3002; <a id="more"></a> &#x6211;&#x524D;&#x5929;&#x8DDF;&#x4E00;&#x7FA4;&#x670B;&#x53CB;&#x73A9;&#x6740;&#x4EBA;&#x6E38;&#x620F;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4F4D;&#x662F;&#x67D0;&#x516C;&#x53F8;&#x7684;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x603B;&#x76D1;&#x3002;&#x5979;&#x8BFB;&#x5FC3;&#x3001;&#x8BFB;&#x9762;&#x7684;&#x80FD;&#x529B;&#x8BA9;&#x6211;&#x60CA;&#x4E3A;&#x5929;&#x4EBA;&#xFF0C;&#x5341;&#x4E2A;&#x4EBA;&#x56F4;&#x6210;&#x4E00;&#x5708;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4EBA;&#x6781;&#x5176;&#x7EC6;&#x5FAE;&#x7684;&#x8868;&#x60C5;&#x90FD;&#x80FD;&#x88AB;&#x5979;&#x654F;&#x9510;&#x5730;&#x5BDF;&#x89C9;&#x3001;&#x5E76;&#x89E3;&#x8BFB;&#x51FA;&#x6765;&#x3002;&#x540E;&#x6765;&#x6211;&#x95EE;&#x5979;&#x5230;&#x5E95;&#x600E;&#x6837;&#x7EC3;&#x5C31;&#x8FD9;&#x79CD;&#x672C;&#x4E8B;&#xFF0C;&#x5979;&#x7684;&#x56DE;&#x7B54;&#x4E5F;&#x5F88;&#x6734;&#x5B9E;&#xFF0C;&#x89C1;&#x5F97;&#x4EBA;&#x591A;&#x4E86;&#xFF0C;&#x552F;&#x624B;&#x719F;&#x5C14;&#x3002;&#x505A;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x5DE5;&#x4F5C;&#xFF0C;&#x5927;&#x91CF;&#x5730;&#x9605;&#x4EBA;&#xFF0C;&#x5BF9;&#x4EBA;&#x505A;&#x5224;&#x65AD;&#xFF0C;&#x7136;&#x540E;&#x8DDF;&#x8E2A;&#x3001;&#x68C0;&#x9A8C;&#x81EA;&#x5DF1;&#x7684;&#x5224;&#x65AD;&#x3002;&#x79EF;&#x7D2F;&#x4E0B;&#x6765;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x6548;&#x7684;&#x79EF;&#x7D2F;&#x662F;&#x8981;&#x8D70;&#x5FC3;&#x7684;&#xFF0C;&#x8981;&#x505A;&#x4E2A;&#x6709;&#x5FC3;&#x4EBA;&#x3002;</p>
<p>&#x6211;&#x66FE;&#x7ECF;&#x5728;&#x56E2;&#x961F;&#x95F9;&#x4EBA;&#x8352;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7CBE;&#x529B;&#x90FD;&#x5728;&#x62DB;&#x4EBA;&#xFF0C;&#x534A;&#x5E74;&#x91CC;&#x89C1;&#x4E86;&#x4E24;&#x767E;&#x591A;&#x53F7;&#x4EBA;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x6211;&#x90FD;&#x6709;&#x8BB0;&#x5F55;&#x548C;&#x603B;&#x7ED3;&#x3002;&#x6211;&#x4E0D;&#x65AD;&#x5730;&#x53D8;&#x6362;&#x9762;&#x8BD5;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4ECE;&#x6700;&#x5F00;&#x59CB;&#x9762;&#x8BD5;&#x524D;&#x8981;&#x5BF9;&#x7740;&#x6BCF;&#x4EFD;&#x7B80;&#x5386;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5230;&#x540E;&#x6765;&#x62FF;&#x4E0A;&#x7B80;&#x5386;&#x5C31;&#x80FD;&#x89C1;&#x3002;&#x540E;&#x6765;&#x6211;&#x5C31;&#x628A;&#x4E00;&#x9762;&#x6254;&#x7ED9;&#x4E86;&#x4E0B;&#x9762;&#x7684;&#x4E3B;&#x7BA1;&#xFF0C;&#x6216;&#x81EA;&#x5DF1;&#x65C1;&#x542C;&#xFF0C;&#x8F85;&#x5BFC;&#x4ED6;&#x4EEC;&#x9762;&#x8BD5;&#xFF0C;&#x6216;&#x53EA;&#x505A;&#x4E8C;&#x9762;&#xFF1B;&#x518D;&#x540E;&#x6765;&#x56E0;&#x4E3A;&#x63A5;&#x7BA1;&#x4E86;&#x4EA7;&#x54C1;&#x56E2;&#x961F;&#xFF0C;&#x6211;&#x8981;&#x81EA;&#x5DF1;&#x9762;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5934;&#x4E00;&#x5E74;&#x79EF;&#x7D2F;&#x4E86;&#x5F88;&#x591A;&#x9762;&#x8BD5;&#x7ECF;&#x9A8C;&#xFF0C;&#x65AD;&#x4E0D;&#x6562;&#x81EA;&#x4FE1;&#x5730;&#x5750;&#x5728;&#x7ECF;&#x9A8C;&#x6BD4;&#x6211;&#x957F;&#x5F97;&#x591A;&#x7684;&#x4EA7;&#x54C1;&#x8001;&#x9E1F;&#x9762;&#x524D;&#x505A;&#x9762;&#x8BD5;&#x3002;</p>
<p>&#x638C;&#x63E1;&#x62DB;&#x8058;&#x624B;&#x827A;&#x7684;&#x7B2C;&#x4E8C;&#x5FC3;&#x6CD5;&#x662F;&#x8981;&#x7528;&#x5F00;&#x653E;&#x7684;&#x5FC3;&#x6001;&#x5904;&#x5904;&#x5B66;&#x4E60;&#xFF0C;&#x95F7;&#x5934;&#x81EA;&#x5DF1;&#x7EC3;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x5750;&#x4E95;&#x89C2;&#x5929;&#x7684;&#x5883;&#x5730;&#x3002;&#x770B;&#x770B;&#x4E16;&#x754C;&#x4E00;&#x6D41;&#x7684;&#x4F01;&#x4E1A;&#x90FD;&#x600E;&#x4E48;&#x9762;&#x8BD5;&#xFF0C;Google&#x3001;&#x5FAE;&#x8F6F;&#x7684;&#x9762;&#x8BD5;&#x9898;&#x662F;&#x600E;&#x4E48;&#x51FA;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x600E;&#x4E48;&#x907F;&#x514D;&#x88AB;&#x5237;&#x9898;&#xFF0C;&#x6211;&#x4E60;&#x60EF;&#x4ECE;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x62BD;&#x53D6;&#x4E00;&#x5757;&#x4F5C;&#x4E3A;&#x7B97;&#x6CD5;&#x7684;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x4ECE;Google&#x5B66;&#x5230;&#x7684;&#x3002;&#x7ED9;&#x534A;&#x4E2A;&#x5C0F;&#x65F6;&#x505A;&#x4E00;&#x9053;&#x7B97;&#x6CD5;&#x9898;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x6709;&#x5907;&#x800C;&#x6765;&#x7684;&#x4EBA;&#x5237;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x9047;&#x5230;&#x6CA1;&#x6709;&#x601D;&#x8DEF;&#x7684;&#x53EF;&#x80FD;&#x4E00;&#x70B9;&#x90FD;&#x505A;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x7ED9;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x8BA9;&#x4ED6;&#x8BFB;&#xFF0C;&#x534A;&#x5C0F;&#x65F6;&#x5185;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x4F1A;&#x6709;&#x8FDB;&#x5C55;&#xFF0C;&#x53EA;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x8FDB;&#x5C55;&#x7A0B;&#x5EA6;&#x4EE5;&#x53CA;&#x7406;&#x89E3;&#x7684;&#x6DF1;&#x5EA6;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E0D;&#x6B63;&#x662F;&#x9898;&#x76EE;&#x5E0C;&#x671B;&#x5177;&#x5907;&#x7684;&#x533A;&#x5206;&#x5EA6;&#x4E48;&#x3002;&#x6700;&#x521D;&#x62DB;&#x8058;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x65F6;&#xFF0C;&#x5B8C;&#x5168;&#x6CA1;&#x601D;&#x8DEF;&#xFF0C;&#x90A3;&#x5C31;&#x641C;&#x4E00;&#x4E0B;&#x4FDD;&#x6D01;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x7ECF;&#xFF0C;&#x7F51;&#x4E0A;&#x6709;&#x5927;&#x91CF;&#x5BF9;&#x4FDD;&#x6D01;&#x516C;&#x53F8;&#x9762;&#x8BD5;&#x9898;&#x7684;&#x89E3;&#x8BFB;&#x3002;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x89E3;&#x8BFB;&#x5B66;&#x4F1A;&#x95EE;&#x9898;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x8BBE;&#x7F6E;&#xFF0C;&#x8003;&#x8651;&#x6211;&#x66F4;&#x770B;&#x91CD;&#x4EC0;&#x4E48;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x8BBE;&#x7F6E;&#x95EE;&#x9898;&#x3002;&#x8FED;&#x4EE3;&#x4E2A;&#x51E0;&#x8F6E;&#xFF0C;&#x6700;&#x521D;&#x7684;&#x95EE;&#x9898;&#x6846;&#x67B6;&#x5B8C;&#x5168;&#x88AB;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8DEF;&#x66FF;&#x6362;&#x6389;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x62C4;&#x7740;&#x62D0;&#x6756;&#x9010;&#x6B65;&#x5B66;&#x4F1A;&#x81EA;&#x5DF1;&#x8D70;&#x8DEF;&#x3002;</p>
<p>&#x6700;&#x540E;&#x518D;&#x8BF4;&#x51E0;&#x6761;&#x66F4;&#x5177;&#x4F53;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x8FD1;&#x6821;&#x62DB;&#x5B63;&#xFF0C;&#x4E3B;&#x7BA1;&#x4EEC;&#x7ED9;&#x6211;&#x7684;&#x4E8C;&#x9762;&#x5019;&#x9009;&#x4EBA;&#x6709;&#x65F6;&#x4F1A;&#x8DDF;&#x6211;&#x7684;&#x5224;&#x65AD;&#x5DEE;&#x522B;&#x5F88;&#x5927;&#x3002;&#x6211;&#x7684;&#x6280;&#x672F;&#x9762;&#x8BD5;&#x6709;&#x4E00;&#x6761;&#x94C1;&#x5F8B;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x505A;&#x9898;&#x3002;&#x51FA;&#x4E8E;&#x804C;&#x4E1A;&#x4E60;&#x60EF;&#xFF0C;&#x6211;&#x4F1A;&#x5728;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x7559;&#x610F;&#x54EA;&#x4E9B;&#x5DE5;&#x4F5C;&#x9002;&#x5408;&#x62BD;&#x8C61;&#x6210;&#x4E00;&#x9053;&#x9762;&#x8BD5;&#x9898;&#xFF0C;&#x6BCF;&#x9053;&#x9898;&#x6211;&#x90FD;&#x4F1A;&#x7422;&#x78E8;&#x3001;&#x6253;&#x78E8;&#x633A;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x5B9A;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x505A;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x662F;&#x81EA;&#x5DF1;&#x79EF;&#x7D2F;&#x4E0B;&#x6765;&#x7684;&#x6709;&#x6548;&#x7684;&#x9762;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x4E00;&#x5B9A;&#x6BD4;&#x4FE9;&#x4EBA;&#x53EA;&#x804A;&#x4E00;&#x4E9B;&#x7247;&#x6C64;&#x8BDD;&#x9760;&#x8C31;&#x5F97;&#x591A;&#x3002;&#x6211;&#x7ED9;&#x81EA;&#x5DF1;&#x5B9A;&#x8FD9;&#x6761;&#x94C1;&#x5F8B;&#xFF0C;&#x5176;&#x5B9E;&#x6E90;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;&#x88AB;&#x6211;&#x5F00;&#x6389;&#x7684;&#x5458;&#x5DE5;&#x3002;&#x4ED6;&#x662F;&#x6211;&#x62DB;&#x5165;&#x7684;&#x7B2C;&#x4E00;&#x4EBA;&#xFF0C;&#x9762;&#x8C08;&#x7684;&#x611F;&#x89C9;&#x5F88;&#x597D;&#xFF0C;&#x53EF;&#x662F;&#x6CA1;&#x6765;&#x591A;&#x4E45;&#x6211;&#x5C31;&#x53D1;&#x73B0;&#x54E5;&#x4EEC;&#x6D3B;&#x4E0D;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x521D;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x52A8;&#x52A8;&#x624B;&#x5199;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x7ACB;&#x523B;&#x5C31;&#x80FD;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x62DB;&#x8FDB;&#x6765;&#x4E0D;&#x6EE1;&#x610F;&#xFF0C;&#x65E2;&#x6D6A;&#x8D39;&#x6211;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x6D6A;&#x8D39;&#x4ED6;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x975E;&#x5E38;&#x8BA4;&#x540C;&#x6770;&#x514B;&#x97E6;&#x5C14;&#x5947;&#x7684;&#x89C2;&#x5FF5;&#xFF0C;&#x5BB9;&#x5FCD;&#x4E0D;&#x9002;&#x5408;&#x7684;&#x4EBA;&#x5728;&#x56E2;&#x961F;&#xFF0C;&#x771F;&#x5FC3;&#x5BB3;&#x4E86;&#x4ED6;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x70B9;&#x6211;&#x975E;&#x5E38;&#x770B;&#x91CD;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#xFF0C;&#x601D;&#x7EF4;&#x4E0D;&#x6E05;&#x6670;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x8DDF;Ta&#x8BB2;&#x4E0D;&#x901A;&#x9053;&#x7406;&#xFF0C;&#x8BB2;&#x4E0D;&#x901A;&#x903B;&#x8F91;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x6280;&#x672F;&#x6C9F;&#x901A;&#x4E2D;&#x7684;&#x7EDD;&#x75C7;&#x3002;&#x5E94;&#x5C4A;&#x751F;&#x8003;&#x5BDF;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x8BA9;&#x4ED6;&#x628A;&#x505A;&#x8FC7;&#x7684;&#x6700;&#x719F;&#x6089;&#x7684;&#x5DE5;&#x7A0B;&#x8BB2;&#x4E00;&#x904D;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x7EB8;&#x4E0A;&#x628A;&#x6A21;&#x5757;&#x3001;&#x5C42;&#x6B21;&#x3001;&#x6570;&#x636E;&#x6D41;&#x3001;&#x63A7;&#x5236;&#x6D41;&#x753B;&#x51FA;&#x6765;&#x3002;&#x5982;&#x679C;&#x505A;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x8BF4;&#x660E;&#x4E0D;&#x5177;&#x5907;&#x57FA;&#x672C;&#x7684;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#xFF0C;&#x76F4;&#x63A5;over&#x3002;&#x6709;&#x4E9B;&#x5DE5;&#x4F5C;&#x6709;&#x5E74;&#x5934;&#x7684;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x53EA;&#x4F1A;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x4F1A;&#x753B;&#x56FE;&#x3002;&#x4F60;&#x95EE;&#x4ED6;&#x6709;&#x51E0;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x5404;&#x81EA;&#x5173;&#x7CFB;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4ED6;&#x4E0A;&#x6765;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7C7B;&#x5982;&#x4F55;&#x5982;&#x4F55;&#xFF0C;&#x90A3;&#x4E2A;&#x7C7B;&#x5982;&#x4F55;&#x5982;&#x4F55;&#xFF0C;&#x8FD9;&#x79CD;&#x4EBA;&#x6CA1;&#x6709;&#x6280;&#x672F;&#x5927;&#x5C40;&#x89C2;&#xFF0C;&#x4E00;&#x5B9A;&#x4E5F;&#x5199;&#x4E0D;&#x597D;&#x4EE3;&#x7801;&#xFF1B;&#x6709;&#x7684;&#x4EBA;&#x8BF4;&#x5F97;&#x4E91;&#x91CC;&#x96FE;&#x91CC;&#xFF0C;&#x7528;&#x7B14;&#x5E3D;&#x5728;&#x7EB8;&#x4E0A;&#x7B14;&#x753B;&#x5F97;&#x6709;&#x6A21;&#x6709;&#x6837;&#xFF0C;&#x6211;&#x8FEB;&#x5207;&#x7684;&#x5E0C;&#x671B;&#x4ED6;&#x80FD;&#x753B;&#x51E0;&#x7B14;&#xFF0C;&#x8BA9;&#x63CF;&#x8FF0;&#x6E05;&#x6670;&#x8D77;&#x6765;&#xFF0C;&#x53EF;&#x5C31;&#x662F;&#x4E0D;&#x843D;&#x7B14;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x90FD;&#x662F;&#x5728;&#x5FC3;&#x91CC;&#x6CA1;&#x6709;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x7ED3;&#x6784;&#x56FE;&#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x8BF4;&#x5230;&#x5E95;&#x8FD8;&#x662F;&#x903B;&#x8F91;&#x4E0D;&#x6E05;&#x6670;&#x3002;</p>
<p>&#x55EF;&#xFF0C;&#x4ECA;&#x5929;&#x5C31;&#x60F3;&#x5230;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4EE5;&#x540E;&#x5982;&#x679C;&#x6709;&#x65B0;&#x7684;&#x518D;&#x6765;&#x8865;&#x5145;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/招聘/" rel="tag">#招聘</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/19/2016/0919Emacs/" rel="next" title="使用Emacs">
                <i class="fa fa-chevron-left"></i> 使用Emacs
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/09/22/2016/0922Log/" rel="prev" title="关于Logger">
                关于Logger <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/09/22/2016/0922关于面试/"
           data-title="关于面试" data-url="http://palanceli.github.io/2016/09/22/2016/0922关于面试/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://avatars0.githubusercontent.com/u/13184524"
               alt="Palance Li" />
          <p class="site-author-name" itemprop="name">Palance Li</p>
          <p class="site-description motion-element" itemprop="description">学习，重生</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">185</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">58</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/palanceli" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/zchongr" target="_blank" title="我的CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的CSDN
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/palance/" target="_blank" title="我的博客园">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的博客园
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/" target="_blank" title="我的简书">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的简书
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Palance Li</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"palanceli"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
