<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="招聘," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="2017&amp;#x5E74;&amp;#x5E94;&amp;#x5C4A;&amp;#x6BD5;&amp;#x4E1A;&amp;#x751F;&amp;#x6821;&amp;#x62DB;&amp;#x53C8;&amp;#x8981;&amp;#x62C9;&amp;#x5F00;&amp;#x5E8F;&amp;#x5E55;&amp;#x3002;2010&amp;#x5E74;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x53C2;&amp;#x52A0;&amp;#x6821;&amp;#x62DB;&amp;#xFF0C;">
<meta property="og:type" content="article">
<meta property="og:title" content="又是一年校招季">
<meta property="og:url" content="http://palanceli.github.io/2016/08/28/2016/0828又是一年校招季/index.html">
<meta property="og:site_name" content="Palance's Blog">
<meta property="og:description" content="2017&amp;#x5E74;&amp;#x5E94;&amp;#x5C4A;&amp;#x6BD5;&amp;#x4E1A;&amp;#x751F;&amp;#x6821;&amp;#x62DB;&amp;#x53C8;&amp;#x8981;&amp;#x62C9;&amp;#x5F00;&amp;#x5E8F;&amp;#x5E55;&amp;#x3002;2010&amp;#x5E74;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x53C2;&amp;#x52A0;&amp;#x6821;&amp;#x62DB;&amp;#xFF0C;">
<meta property="og:updated_time" content="2016-09-22T14:37:40.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="又是一年校招季">
<meta name="twitter:description" content="2017&amp;#x5E74;&amp;#x5E94;&amp;#x5C4A;&amp;#x6BD5;&amp;#x4E1A;&amp;#x751F;&amp;#x6821;&amp;#x62DB;&amp;#x53C8;&amp;#x8981;&amp;#x62C9;&amp;#x5F00;&amp;#x5E8F;&amp;#x5E55;&amp;#x3002;2010&amp;#x5E74;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x53C2;&amp;#x52A0;&amp;#x6821;&amp;#x62DB;&amp;#xFF0C;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://palanceli.github.io/2016/08/28/2016/0828又是一年校招季/"/>

  <title> 又是一年校招季 | Palance's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e9c9a05f15583e8039e36cfe85103e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Palance's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                又是一年校招季
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-08-28T22:59:44+08:00" content="2016-08-28">
              2016-08-28
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/随笔笔记/" itemprop="url" rel="index">
                    <span itemprop="name">随笔笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/08/28/2016/0828又是一年校招季/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/08/28/2016/0828又是一年校招季/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>2017&#x5E74;&#x5E94;&#x5C4A;&#x6BD5;&#x4E1A;&#x751F;&#x6821;&#x62DB;&#x53C8;&#x8981;&#x62C9;&#x5F00;&#x5E8F;&#x5E55;&#x3002;2010&#x5E74;&#x7B2C;&#x4E00;&#x6B21;&#x53C2;&#x52A0;&#x6821;&#x62DB;&#xFF0C;&#x81F3;&#x4ECA;&#x6709;&#x516D;&#x5E74;&#x591A;&#x7684;&#x62DB;&#x8058;&#x7ECF;&#x5386;&#xFF0C;&#x6BCF;&#x5E74;&#x90FD;&#x80FD;&#x89C1;&#x4E0A;&#x5927;&#x51E0;&#x5341;&#x53F7;&#x4EBA;&#xFF0C;&#x66FE;&#x7ECF;&#x7FFB;&#x8FC7;&#x8239;&#xFF0C;&#x4E5F;&#x79EF;&#x7D2F;&#x4E86;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x3002;&#x6309;&#x7167;&#x6211;&#x73B0;&#x5728;&#x7684;&#x5B66;&#x4E60;&#x89C2;&#x5FF5;&#xFF0C;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x7ECF;&#x9A8C;&#x90FD;&#x5E94;&#x8BE5;&#x6C89;&#x6DC0;&#xFF0C;&#x8FDB;&#x5316;&#x548C;&#x6253;&#x78E8;&#x3002;&#x6211;&#x8BD5;&#x7740;&#x628A;&#x8FD9;&#x4E9B;&#x5E74;&#x7684;&#x7ECF;&#x9A8C;&#x5F52;&#x7EB3;&#x603B;&#x7ED3;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x9002;&#x7528;&#x7684;&#x7ECF;&#x9A8C;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x62FF;&#x6210;&#x624B;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x65B0;&#x664B;&#x9762;&#x8BD5;&#x5B98;&#x8EAB;&#x4E0A;&#x4E0D;&#x4E00;&#x5B9A;&#x5408;&#x9002;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x7ECF;&#x9A8C;&#x4E4B;&#x4E0A;&#x7684;&#x4E00;&#x6761;&#x901A;&#x7528;&#x7ECF;&#x9A8C;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x5730;&#x5B66;&#x4E60;&#x3001;&#x603B;&#x7ED3;&#xFF0C;&#x63D0;&#x70BC;&#x51FA;&#x9002;&#x7528;&#x4E0E;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x98CE;&#x683C;&#x3002;<br><a id="more"></a></p>
<p>&#x8FD8;&#x8BB0;&#x5F97;&#x7B2C;&#x4E00;&#x6B21;&#x53C2;&#x52A0;&#x6821;&#x62DB;&#x5F53;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x6211;&#x6BD4;&#x5019;&#x9009;&#x4EBA;&#x8FD8;&#x7D27;&#x5F20;&#x3002;&#x6211;&#x7684;&#x8BB0;&#x6027;&#x6BD4;&#x8F83;&#x5DEE;&#xFF0C;&#x53E3;&#x624D;&#x4E5F;&#x4E0D;&#x7B97;&#x597D;&#xFF0C;&#x751F;&#x6015;&#x73B0;&#x573A;&#x4F1A;&#x51B7;&#x573A;&#xFF0C;&#x66F4;&#x6015;&#x7684;&#x662F;&#x9732;&#x602F;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x505A;&#x4E86;&#x51E0;&#x4E2A;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<ol>
<li>&#x4E8B;&#x5148;&#x51C6;&#x5907;&#x597D;&#x8981;&#x95EE;&#x7684;&#x9898;&#x76EE;&#x3002;&#x5C3D;&#x7BA1;&#x516C;&#x53F8;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x7B14;&#x8BD5;&#x9898;&#xFF0C;&#x90A3;&#x53EA;&#x662F;&#x6211;&#x7684;&#x4E00;&#x4E2A;&#x53C2;&#x8003;&#x6E90;&#xFF0C;&#x800C;&#x4E14;&#x6743;&#x91CD;&#x4E0D;&#x9AD8;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x8FC7;&#x5B83;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x6765;&#x51FA;&#x9898;&#x4EBA;&#x6C34;&#x5E73;&#x53C2;&#x5DEE;&#x4E0D;&#x9F50;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x786E;&#x5B9A;&#x90A3;&#x4E9B;&#x9898;&#x76EE;&#x662F;&#x4E0D;&#x662F;&#x4ECE;&#x54EA;&#x91CC;&#x76F4;&#x63A5;&#x7C98;&#x8D34;&#x8FC7;&#x6765;&#x7684;&#xFF1B;&#x4E8C;&#x6765;&#x5404;&#x79CD;&#x9488;&#x5BF9;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x5B9D;&#x5178;&#x4E0D;&#x8981;&#x592A;&#x5168;&#xFF0C;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x90FD;&#x662F;&#x6709;&#x5907;&#x800C;&#x6765;&#x7684;&#x3002;&#x6700;&#x521D;&#x6211;&#x7684;&#x9898;&#x76EE;&#x6211;&#x4E5F;&#x662F;&#x4ECE;&#x7F51;&#x4E0A;&#x641C;&#x6765;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x6539;&#x52A8;&#x5C31;&#x76F4;&#x63A5;&#x7528;&#x4E86;&#x3002;&#x5F88;&#x5FEB;&#x6211;&#x5C31;&#x6539;&#x53D8;&#x4E86;&#x9898;&#x76EE;&#x6765;&#x6E90;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x6765;&#x81EA;&#x4E66;&#xFF0C;&#x6211;&#x81EA;&#x8BE9;&#x8BFB;&#x8FC7;&#x4E0D;&#x5C11;&#x7ECF;&#x5178;&#x8457;&#x4F5C;&#xFF0C;&#x4E5F;&#x5728;&#x4ED6;&#x4EEC;&#x8FB9;&#x8FB9;&#x89D2;&#x89D2;&#x8BB0;&#x4E86;&#x4E0D;&#x5C11;&#x7B14;&#x8BB0;&#xFF0C;&#x7B2C;&#x4E8C;&#x7248;&#x7684;&#x9762;&#x8BD5;&#x9898;&#x5927;&#x591A;&#x6765;&#x81EA;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x95EE;&#x9898;&#x3002;&#x9762;&#x8BD5;&#x7684;&#x7ECF;&#x5386;&#x8BA9;&#x6211;&#x591A;&#x4E86;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x89D2;&#x5EA6;&#xFF0C;&#x4E0D;&#x7BA1;&#x5728;&#x8BFB;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x4F1A;&#x60F3;&#x7740;&#x5F53;&#x4E0B;&#x5B66;&#x4E60;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x6216;&#x8005;&#x5F53;&#x4E0B;&#x5199;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x5426;&#x9002;&#x5408;&#x8003;&#x5BDF;&#x5019;&#x9009;&#x4EBA;&#x3002;&#x7B2C;&#x4E09;&#x7248;&#x7684;&#x9762;&#x8BD5;&#x9898;&#x591A;&#x6765;&#x81EA;&#x6211;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x5177;&#x4F53;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x7EA0;&#x7F20;&#x6211;&#x591A;&#x65F6;&#x7684;bug&#xFF0C;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x8D39;&#x70B9;&#x5FC3;&#x601D;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x9762;&#x8BD5;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x9898;&#x76EE;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x76F4;&#x63A5;&#x53CD;&#x5E94;&#x5019;&#x9009;&#x4EBA;&#x7684;&#x52A8;&#x624B;&#x80FD;&#x529B;&#x3002;</li>
<li>&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x603B;&#x4E0D;&#x80FD;&#x62FF;&#x7740;&#x9898;&#x5E93;&#x95EE;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x7ED9;&#x9898;&#x76EE;&#x505A;&#x4E86;&#x7F16;&#x53F7;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#xFF0C;&#x4E0D;&#x8981;&#x592A;&#x660E;&#x663E;&#xFF0C;&#x786E;&#x4FDD;&#x6211;&#x81EA;&#x5DF1;&#x80FD;&#x770B;&#x61C2;&#xFF0C;&#x6807;&#x5728;&#x5019;&#x9009;&#x4EBA;&#x7684;&#x7B80;&#x5386;&#x4E0A;&#xFF0C;&#x6216;&#x8005;&#x7B14;&#x8BD5;&#x5377;&#x4E0A;&#x3002;&#x9762;&#x8BD5;&#x671F;&#x95F4;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x7B26;&#x53F7;&#xFF0C;&#x6211;&#x7ACB;&#x523B;&#x5C31;&#x660E;&#x767D;&#x8981;&#x95EE;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x6837;&#x8BA9;&#x6211;&#x5728;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x8868;&#x73B0;&#x66F4;&#x4ECE;&#x5BB9;&#x3002;&#x5176;&#x5B9E;&#x5728;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x6821;&#x62DB;&#x9762;&#x8BD5;&#x65F6;&#xFF0C;&#x5019;&#x9009;&#x4EBA;&#x901A;&#x5E38;&#x90FD;&#x6BD4;&#x8F83;&#x7D27;&#x5F20;&#xFF0C;&#x4ED6;&#x4EEC;&#x58F0;&#x97F3;&#x53D1;&#x98A4;&#x3001;&#x624B;&#x53D1;&#x6296;&#xFF0C;&#x8FD9;&#x662F;&#x80FD;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x770B;&#x4E0D;&#x5230;&#x7684;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x8111;&#x5B50;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x5FC5;&#x987B;&#x8D1F;&#x8D23;&#x4E3B;&#x5BFC;&#x573A;&#x4E0A;&#x7684;&#x5C40;&#x9762;&#xFF0C;&#x5305;&#x62EC;&#x6C14;&#x6C1B;&#x3001;&#x8282;&#x594F;&#x3002;&#x5982;&#x679C;&#x4FE9;&#x4EBA;&#x90FD;&#x5F88;&#x7D27;&#x5F20;&#xFF0C;&#x7ED3;&#x679C;&#x5FC5;&#x7136;&#x662F;&#x5931;&#x8D25;&#x7684;&#x3002;&#x81EA;&#x5DF1;&#x80FD;&#x4ECE;&#x5BB9;&#x9762;&#x5BF9;&#xFF0C;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x73B0;&#x573A;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#x3002;</li>
<li>&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7B80;&#x5386;&#x90FD;&#x4ED4;&#x7EC6;&#x5730;&#x7814;&#x7A76;&#x4E00;&#x904D;&#xFF0C;&#x9488;&#x5BF9;&#x6027;&#x5730;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x3002;&#x7531;&#x4E8E;&#x662F;&#x6821;&#x62DB;&#xFF0C;&#x5019;&#x9009;&#x4EBA;&#x901A;&#x5E38;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x5BBD;&#x7684;&#x77E5;&#x8BC6;&#x9762;&#xFF0C;&#x5F88;&#x591A;&#x5B66;&#x6821;&#x5B9E;&#x9A8C;&#x5BA4;&#x8001;&#x677F;&#x7BA1;&#x5F97;&#x5F88;&#x4E25;&#xFF0C;&#x5FC5;&#x987B;&#x8DDF;&#x7740;&#x8001;&#x677F;&#x505A;&#x9879;&#x76EE;&#x3002;&#x4ED6;&#x4EEC;&#x80FD;&#x628A;&#x9879;&#x76EE;&#x6D89;&#x53CA;&#x7684;&#x6280;&#x672F;&#x8BB2;&#x6E05;&#x695A;&#x5C31;&#x5DF2;&#x7ECF;&#x4E0D;&#x9519;&#x4E86;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x5C3D;&#x7BA1;&#x662F;&#x67D0;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4F46;&#x6307;&#x671B;&#x4ED6;&#x4EEC;&#x90FD;&#x4E86;&#x89E3;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x662F;&#x5962;&#x671B;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x8D1F;&#x8D23;Windows&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x4F46;&#x6BCF;&#x5E74;&#x5019;&#x9009;&#x4EBA;&#x91CC;&#x4E86;&#x89E3;windows&#x7F16;&#x7A0B;&#x57FA;&#x7840;&#x7684;&#x4EBA;&#x90FD;&#x662F;&#x6700;&#x5C11;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x7528;&#x4E00;&#x5957;&#x56FA;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#x6765;&#x8003;&#x5BDF;&#x6240;&#x6709;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#xFF0C;&#x6709;&#x4E9B;&#x6211;&#x770B;&#x6765;&#x662F;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x95EE;&#x9898;&#x56DE;&#x7B54;&#x4E0D;&#x4E0A;&#x6765;&#x5F88;&#x6B63;&#x5E38;&#x3002;&#x8981;&#x628A;&#x95EE;&#x9898;&#x7684;&#x7126;&#x70B9;&#x653E;&#x5728;&#x4ED6;&#x4EEC;&#x505A;&#x8FC7;&#x7684;&#x4E8B;&#x513F;&#x4E0A;&#xFF0C;&#x8003;&#x5BDF;&#x5728;&#x90A3;&#x6761;&#x8DEF;&#x5F84;&#x4E0A;&#x662F;&#x5426;&#x505A;&#x5F97;&#x591F;&#x6DF1;&#xFF0C;&#x662F;&#x5426;&#x884D;&#x751F;&#x51FA;&#x65B0;&#x7684;&#x89C6;&#x91CE;&#xFF0C;&#x624D;&#x662F;&#x8BC4;&#x5224;&#x8FD9;&#x4F4D;&#x5019;&#x9009;&#x662F;&#x5426;&#x9760;&#x8C31;&#x7684;&#x6807;&#x51C6;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x4E2A;&#x4F53;&#x5DEE;&#x5F02;&#x5F88;&#x5927;&#xFF0C;&#x5FC5;&#x987B;&#x4ED4;&#x7EC6;&#x7814;&#x7A76;&#x6BCF;&#x4F4D;&#x5019;&#x9009;&#x7684;&#x7B80;&#x5386;&#x3002;&#x76F4;&#x5230;&#x591A;&#x5E74;&#x4EE5;&#x540E;&#x6211;&#x9762;&#x8BD5;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x793E;&#x62DB;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E5F;&#x662F;&#x4E00;&#x76F4;&#x79C9;&#x6301;&#x7684;&#x3002;</li>
<li>&#x51C6;&#x5907;&#x597D;&#x7EDF;&#x4E00;&#x7684;&#x8BC4;&#x4EF7;&#x7EF4;&#x5EA6;&#x4EE5;&#x53CA;&#x6BCF;&#x4EBA;&#x4E00;&#x5F20;&#x8BC4;&#x4EF7;&#x8868;&#x683C;&#xFF0C;&#x6BCF;&#x4E2A;&#x9762;&#x8BD5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x7ACB;&#x523B;&#x5199;&#x4E0B;&#x8BC4;&#x4EF7;&#x548C;&#x8BC4;&#x5206;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x7B2C;&#x4E8C;&#x6B21;&#x53BB;&#x5916;&#x5730;&#x6821;&#x62DB;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x5F88;&#x5FC5;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x6821;&#x62DB;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x5206;&#x56DB;&#x4E94;&#x4E2A;&#x5019;&#x9009;&#xFF0C;&#x4E00;&#x5929;&#x89C1;&#x5B8C;&#x3002;&#x5B8C;&#x6210;&#x540E;&#x5BF9;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5370;&#x8C61;&#x90FD;&#x80FD;&#x56DE;&#x5FC6;&#x8D77;&#x6765;&#x3002;&#x7B2C;&#x4E8C;&#x6B21;&#x53BB;&#x5916;&#x5730;&#x6821;&#x62DB;&#xFF0C;&#x65F6;&#x95F4;&#x975E;&#x5E38;&#x7D27;&#x5F20;&#xFF0C;&#x8FDE;&#x7EED;&#x4E24;&#x4E09;&#x5929;&#xFF0C;&#x6BCF;&#x5929;&#x8981;&#x89C1;&#x5341;&#x51E0;&#x4E2A;&#xFF0C;&#x4E00;&#x5929;&#x9762;&#x8BD5;&#x4E0B;&#x6765;&#xFF0C;&#x4E0D;&#x60F3;&#x8BF4;&#x8BDD;&#xFF0C;&#x8111;&#x5B50;&#x4E5F;&#x8F6C;&#x4E0D;&#x52A8;&#x4E86;&#x3002;&#x665A;&#x4E0A;&#x770B;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x7559;&#x4E0B;&#x7684;&#x53EA;&#x8A00;&#x7247;&#x8BED;&#xFF0C;&#x89C9;&#x5F97;&#x6709;&#x51E0;&#x4E2A;&#x90FD;&#x4E0D;&#x9519;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x957F;&#x5904;&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x4ED6;&#x4EEC;&#x4E2D;&#x95F4;&#x518D;&#x7B5B;&#x9009;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5F88;&#x4E3A;&#x96BE;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x56E0;&#x4E3A;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x8BC4;&#x4EF7;&#x4E0D;&#x591F;&#x5168;&#x9762;&#xFF0C;&#x5370;&#x8C61;&#x4E5F;&#x6A21;&#x7CCA;&#x4E86;&#x3002;&#x90A3;&#x6B21;&#x6821;&#x62DB;&#x7684;&#x7EA6;&#x9762;&#x4E5F;&#x662F;&#x9762;&#x8BD5;&#x5B98;&#x81EA;&#x5DF1;&#x7EA6;&#xFF0C;&#x5BF9;&#x7740;&#x5341;&#x51E0;&#x4EBA;&#x7684;&#x540D;&#x5355;&#xFF0C;&#x6709;&#x7684;&#x7535;&#x8BDD;&#x6CA1;&#x4EBA;&#x63A5;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x5408;&#x9002;&#x9700;&#x8981;&#x8C03;&#x6574;&#xFF0C;&#x6709;&#x7684;&#x6572;&#x5B9A;&#x4E86;&#x65F6;&#x95F4;&#xFF0C;&#x540E;&#x6765;&#x53C8;&#x6253;&#x6765;&#x7535;&#x8BDD;&#x95EE;&#x80FD;&#x5426;&#x8C03;&#x6574;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E8B;&#x5148;&#x6CA1;&#x6709;&#x505A;&#x597D;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x8868;&#x683C;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x6655;&#x6389;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x90A3;&#x6B21;&#x4EE5;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4E00;&#x5929;&#x5B89;&#x6392;&#x591A;&#x4E2A;&#x9762;&#x8BD5;&#xFF0C;&#x6211;&#x4F1A;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x8868;&#x683C;&#xFF1A;</li>
</ol>
<table>
<thead>
<tr>
<th>&#x59D3;&#x540D;</th>
<th>&#x8BA1;&#x5212;&#x65F6;&#x95F4;</th>
<th>&#x786E;&#x5B9A;&#x65F6;&#x95F4;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x5F20;&#x4E09;</td>
<td>10:00~10:45</td>
<td></td>
</tr>
<tr>
<td>&#x674E;&#x56DB;</td>
<td>10:55~11:40</td>
<td></td>
</tr>
<tr>
<td>&#x2026;</td>
<td>&#x2026;</td>
<td></td>
</tr>
</tbody>
</table>
<p>&#x5728;&#x4E24;&#x4E2A;&#x9762;&#x8BD5;&#x4E4B;&#x95F4;&#x7559;&#x51FA;10&#x5206;&#x949F;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x5199;&#x4E0B;&#x8BE6;&#x7EC6;&#x7684;&#x8BC4;&#x8BED;&#x548C;&#x6253;&#x5206;&#x3002;&#x6240;&#x8C13;&#x8BE6;&#x7EC6;&#x7684;&#x8BC4;&#x8BED;&#xFF0C;&#x662F;&#x6307;&#x5728;&#x7EDF;&#x4E00;&#x7684;&#x8BC4;&#x4EF7;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x7ED9;&#x51FA;&#x6BCF;&#x4E2A;&#x5B50;&#x9879;&#x7684;&#x5206;&#x6570;&#x3002;&#x5728;3&#x4E2D;&#x8BF4;&#x8FC7;&#xFF0C;&#x5BF9;&#x4E8E;&#x5E94;&#x5C4A;&#x751F;&#xFF0C;&#x4E2A;&#x4F53;&#x5DEE;&#x5F02;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x6211;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8BC4;&#x4EF7;&#x7684;&#x7EF4;&#x5EA6;&#x5E94;&#x8BE5;&#x662F;&#x7EDF;&#x4E00;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x6280;&#x672F;&#x80FD;&#x529B;&#x2014;&#x2014;&#x5BF9;&#x4E8E;&#x505A;&#x8FC7;&#x7684;&#x9879;&#x76EE;&#x80FD;&#x5426;&#x5F88;&#x6E05;&#x6670;&#x5730;&#x8BB2;&#x51FA;&#x6765;&#xFF0C;&#x5BF9;&#x6280;&#x672F;&#x96BE;&#x70B9;&#x7684;&#x56DE;&#x7B54;&#x662F;&#x5426;&#x6EE1;&#x610F;&#xFF1B;&#x534F;&#x4F5C;&#x80FD;&#x529B;&#x2014;&#x2014;&#x5BF9;&#x4E8E;&#x548C;&#x81EA;&#x5DF1;&#x63A5;&#x53E3;&#x7684;&#x90E8;&#x5206;&#x662F;&#x5426;&#x80FD;&#x6E05;&#x6670;&#x5730;&#x8BB2;&#x51FA;&#x6765;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0A;&#x6E38;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5426;&#x6E05;&#x6670;&#xFF0C;&#x5BF9;&#x4E8E;&#x5411;&#x4E0B;&#x6E38;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x5426;&#x987A;&#x7545;&#xFF1B;&#x6C9F;&#x901A;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x8BC4;&#x5206;&#x4F53;&#x7CFB;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x9762;&#x8BD5;&#x5B8C;&#x7ACB;&#x523B;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x6253;&#x5206;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x5929;&#x7684;&#x9762;&#x8BD5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x7ED3;&#x8BBA;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<h1 id="&#x5173;&#x4E8E;&#x9762;&#x8BD5;&#x98CE;&#x683C;"><a href="#&#x5173;&#x4E8E;&#x9762;&#x8BD5;&#x98CE;&#x683C;" class="headerlink" title="&#x5173;&#x4E8E;&#x9762;&#x8BD5;&#x98CE;&#x683C;"></a>&#x5173;&#x4E8E;&#x9762;&#x8BD5;&#x98CE;&#x683C;</h1><p>&#x6211;&#x559C;&#x6B22;&#x8F7B;&#x677E;&#x3001;&#x4EB2;&#x5207;&#x7684;&#x9762;&#x8BD5;&#x98CE;&#x683C;&#x3002;&#x8FD9;&#x662F;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;&#x5404;&#x79CD;&#x5C1D;&#x8BD5;&#x4EE5;&#x540E;&#xFF0C;&#x6700;&#x8BA9;&#x6211;&#x8212;&#x670D;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x524D;&#x6587;&#x8BF4;&#x8FC7;&#xFF0C;&#x5F88;&#x591A;&#x9762;&#x8BD5;&#x8005;&#xFF0C;&#x6709;&#x7684;&#x5C3D;&#x7BA1;&#x5DF2;&#x7ECF;&#x662F;&#x591A;&#x5E74;&#x804C;&#x573A;&#x8001;&#x5175;&#xFF0C;&#x53EF;&#x9762;&#x5BF9;&#x5E94;&#x8058;&#x8FD8;&#x662F;&#x5F88;&#x7D27;&#x5F20;&#xFF0C;&#x9762;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x518D;&#x589E;&#x52A0;&#x538B;&#x529B;&#x5C31;&#x591A;&#x4F59;&#x4E86;&#x3002;&#x6709;&#x4E9B;&#x4F18;&#x79C0;&#x7684;&#x5019;&#x9009;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x591A;&#x804A;&#x51E0;&#x53E5;&#xFF0C;&#x6700;&#x597D;&#x80FD;&#x8BA9;&#x5F7C;&#x6B64;&#x653E;&#x4E0B;&#x8003;&#x8BD5;&#x95EE;&#x7B54;&#x5F0F;&#x7684;&#x6212;&#x5FC3;&#xFF0C;&#x7528;&#x6700;&#x672C;&#x8272;&#x7684;&#x6C9F;&#x901A;&#x65B9;&#x5F0F;&#xFF0C;&#x591A;&#x95EE;&#x4E00;&#x4E9B;&#x6269;&#x5C55;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x6536;&#x83B7;&#x3002;&#x5982;&#x679C;&#x4F60;&#x603B;&#x662F;&#x7AEF;&#x7740;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x505A;&#x8003;&#x5B98;&#x9AD8;&#x9AD8;&#x5728;&#x4E0A;&#xFF0C;&#x4F60;&#x7684;&#x5DEE;&#x9519;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x4F60;&#x9677;&#x5165;&#x5C34;&#x5C2C;&#xFF0C;&#x5BFC;&#x81F4;&#x6700;&#x5B89;&#x5168;&#x7684;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x603B;&#x95EE;&#x81EA;&#x5DF1;&#x719F;&#x6089;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5BF9;&#x65B9;&#x719F;&#x6089;&#x7684;&#x9886;&#x57DF;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E8B;&#x513F;&#x5C31;&#x6CA1;&#x610F;&#x601D;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x7684;&#x9762;&#x4EBA;&#x76EE;&#x7684;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x9762;&#x8BD5;&#x6709;&#x70B9;&#x50CF;&#x91C7;&#x8BBF;&#xFF0C;&#x7528;&#x4E00;&#x79CD;&#x597D;&#x5947;&#x7684;&#x6001;&#x5EA6;&#x4E0D;&#x65AD;&#x5F15;&#x5BFC;&#x5BF9;&#x65B9;&#x8BF4;&#x51FA;&#x8FC7;&#x5F80;&#x7684;&#x7ECF;&#x5386;&#x3002;</p>
<p>&#x548C;&#x91C7;&#x8BBF;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x63E3;&#x6469;&#x9762;&#x8BD5;&#x8005;&#x63CF;&#x8FF0;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x5BA2;&#x89C2;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x628A;&#x522B;&#x4EBA;&#x505A;&#x7684;&#x4E8B;&#x513F;&#x90FD;&#x63FD;&#x5230;&#x81EA;&#x5DF1;&#x8EAB;&#x4E0A;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#xFF0C;&#x80FD;&#x628A;&#x522B;&#x4EBA;&#x7684;&#x7ECF;&#x5386;&#x5438;&#x7EB3;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x8BF4;&#x660E;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x5F3A;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x4F60;&#x53EA;&#x662F;&#x5634;&#x4E0A;&#x8BF4;&#x8BF4;&#x8FD8;&#x662F;&#x7528;&#x5FC3;&#x53BB;&#x6210;&#x957F;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x9762;&#x8BD5;&#x5B98;&#x5FC5;&#x987B;&#x5206;&#x8FA8;&#x7684;&#x771F;&#x76F8;&#x3002;&#x8FD9;&#x4E2A;&#x771F;&#x76F8;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x62C6;&#x7A7F;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x662F;&#x5BF9;&#x5CD9;&#xFF0C;&#x800C;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x8BA9;&#x5019;&#x9009;&#x8BF4;&#x51FA;&#x4F60;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x7ECF;&#x5386;&#x3002;&#x62C6;&#x7A7F;&#x4E86;&#x7EDD;&#x5BF9;&#x5F71;&#x54CD;&#x540E;&#x9762;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x60F3;&#x5C31;&#x6B64;&#x6253;&#x4F4F;&#xFF0C;&#x90A3;&#x4E5F;&#x662F;&#x6253;&#x4F4F;&#x5C31;&#x662F;&#x4E86;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x9762;&#x8BD5;&#x53C8;&#x6709;&#x70B9;&#x50CF;&#x5ED6;&#x51E1;&#x6F14;&#x7684;&#x300A;&#x5E08;&#x7236;&#x300B;&#x91CC;&#x7684;&#x6B66;&#x827A;&#x5207;&#x78CB;&#xFF0C;&#x53CC;&#x65B9;&#x8FD1;&#x8EAB;&#x5229;&#x5203;&#x8FC7;&#x62DB;&#xFF0C;&#x6BEB;&#x53D1;&#x65E0;&#x4F24;&#x70B9;&#x5230;&#x4E3A;&#x6B62;&#xFF0C;&#x51E0;&#x4E2A;&#x56DE;&#x5408;&#x65C1;&#x4EBA;&#x770B;&#x6765;&#x7535;&#x5149;&#x706B;&#x77F3;&#xFF0C;&#x5BF9;&#x624B;&#x7684;&#x6BB5;&#x4F4D;&#x5404;&#x81EA;&#x5DF2;&#x662F;&#x5FC3;&#x77E5;&#x809A;&#x660E;&#x3002;</p>
<p>&#x4E5F;&#x6709;&#x9047;&#x5230;&#x4E0D;&#x4E56;&#x7684;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x6CB9;&#xFF0C;&#x95EE;&#x4E0D;&#x51FA;&#x6240;&#x4EE5;&#x7136;&#x6765;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5019;&#x9009;&#x5176;&#x5B9E;&#x7279;&#x522B;&#x5730;&#x4E0D;&#x806A;&#x660E;&#xFF0C;&#x4F60;&#x6765;&#x5E72;&#x561B;&#x6765;&#x4E86;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x95EE;&#x4E0D;&#x51FA;&#x4F60;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F60;&#x5C31;&#x8D62;&#x4E86;&#x4E48;&#xFF1F;&#x9762;&#x8BD5;&#x5B98;&#x780D;&#x4EBA;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x7406;&#x7531;&#x7684;&#x3002;&#x8FC7;&#x53BB;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x7684;&#xFF0C;&#x6211;&#x4F1A;&#x6709;&#x610F;&#x5201;&#x96BE;&#x4E00;&#x4E0B;&#xFF0C;&#x7ED9;&#x70B9;&#x989C;&#x8272;&#x770B;&#x770B;~~ &#x540E;&#x6765;&#x5C31;&#x4E0D;&#x8FD9;&#x4E48;&#x5E72;&#x4E86;&#xFF0C;&#x7D27;&#x6263;&#x6211;&#x7684;&#x76EE;&#x6807;&#x2014;&#x2014;&#x6211;&#x662F;&#x6765;&#x9009;&#x4EBA;&#xFF0C;&#x4E0D;&#x662F;&#x6597;&#x6C14;&#x7684;&#x3002;&#x5982;&#x679C;&#x603B;&#x4F53;&#x90FD;&#x662F;&#x8FD9;&#x4E48;&#x4E2A;&#x98CE;&#x683C;&#xFF0C;&#x6211;&#x4F1A;&#x5C3D;&#x5FEB;&#x5BA2;&#x5BA2;&#x6C14;&#x6C14;&#x5730;&#x7ED3;&#x675F;&#x9762;&#x8BD5;&#xFF0C;&#x9001;&#x5BA2;&#x3002;&#x5982;&#x679C;&#x53EA;&#x662F;&#x90E8;&#x5206;&#x8BDD;&#x9898;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x95EE;&#x5230;&#x4E86;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x5403;&#x900F;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x51B3;&#x5B9A;&#x7ED3;&#x675F;&#x9762;&#x8BD5;&#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x7C7B;&#x8BDD;&#x9898;&#x4E00;&#x5B9A;&#x8981;&#x95EE;&#x900F;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x65E2;&#x7136;&#x4E0D;&#x60F3;&#x7ED3;&#x675F;&#x9762;&#x8BD5;&#xFF0C;&#x8BF4;&#x660E;&#x8FD9;&#x4EBA;&#x6709;&#x8BA9;&#x4F60;&#x6EE1;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x90A3;&#x4ED6;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x5728;&#x522B;&#x7684;&#x5730;&#x513F;&#x5F53;&#x5927;&#x5C3E;&#x5DF4;&#x72FC;&#x5462;&#xFF1F;&#x53EF;&#x80FD;&#x662F; &#x8BA9;&#x4F60;&#x6EE1;&#x610F;&#x7684;&#x533A;&#x57DF;&#x8FD8;&#x4E0D;&#x591F;&#x5927;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4ED6;&#x5BF9;&#x90A3;&#x7247;&#x533A;&#x57DF;&#x8FD8;&#x4E0D;&#x591F;&#x81EA;&#x4FE1;&#xFF0C;&#x90A3;&#x771F;&#x7684;&#x80FD;&#x8BA9;&#x4EBA;&#x6EE1;&#x610F;&#x5417;&#xFF1F;&#x4E5F;&#x53EF;&#x80FD;&#x4ED6;&#x4E60;&#x60EF;&#x4E0D;&#x61C2;&#x88C5;&#x61C2;&#x2026;&#x2026;&#x603B;&#x4E4B;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EF;&#x80FD;&#x6027;&#x90FD;&#x8981;&#x5C0F;&#x5FC3;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x70B9;&#xFF1A;&#x9762;&#x8BD5;&#x5B98;&#x5FC5;&#x987B;&#x4E3B;&#x5BFC;&#x9762;&#x8BD5;&#x7684;&#x6BCF;&#x4E2A;&#x70B9;&#x548C;&#x9762;&#x3002;&#x4E3B;&#x5BFC;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x8981;&#x8868;&#x73B0;&#x5F97;&#x5F3A;&#x52BF;&#xFF0C;&#x8FD9;&#x8DDF;&#x524D;&#x9762;&#x8BB2;&#x7684;&#x6211;&#x559C;&#x6B22;&#x4EB2;&#x548C;&#x3001;&#x5BBD;&#x677E;&#x7684;&#x6C1B;&#x56F4;&#x662F;&#x4E0D;&#x77DB;&#x76FE;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x6C1B;&#x56F4;&#x662F;&#x6211;&#x8425;&#x9020;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x597D;&#x6BD4;&#x5728;&#x91C7;&#x8BBF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x8BA9;&#x88AB;&#x91C7;&#x8BBF;&#x8005;&#x5929;&#x9A6C;&#x884C;&#x7A7A;&#x4E71;&#x8BF4;&#x4E00;&#x901A;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x8BA9;&#x4ED6;&#x6253;&#x5F00;&#x8BDD;&#x5323;&#x5B50;&#x6536;&#x4E0D;&#x4F4F;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5F15;&#x5BFC;&#x4ED6;&#x7D27;&#x6263;&#x4F60;&#x60F3;&#x542C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BF4;&#x7740;&#x8BF4;&#x7740;&#x8DD1;&#x5230;&#x4ED6;&#x60F3;&#x8BF4;&#x7684;&#x8BDD;&#x9898;&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x6211;&#x9047;&#x5230;&#x6BD4;&#x8F83;&#x5178;&#x578B;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF1A;&#x628A;&#x4EA7;&#x54C1;&#x7B56;&#x7565;&#x5F53;&#x505A;&#x6280;&#x672F;&#x65B9;&#x6848;&#x6765;&#x63CF;&#x8FF0;&#xFF0C;&#x201C;&#x8BF7;&#x4F60;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x6765;&#x63CF;&#x8FF0;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x201D;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x8FD9;&#x4E48;&#x6253;&#x65AD;Ta&#xFF1B;&#x6211;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x6CA1;&#x95EE;&#x5B8C;&#xFF0C;&#x5C31;&#x5F00;&#x59CB;&#x62A2;&#x7B54;&#xFF0C;&#x800C;&#x4E14;&#x7B54;&#x5F97;&#x5E76;&#x6CA1;&#x6263;&#x9898;&#xFF0C;&#x201C;&#x6211;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;blabla&#x2026;&#x2026;&#x201D;&#x6211;&#x4F1A;&#x6253;&#x65AD;Ta&#xFF0C;&#x5E76;&#x4E14;&#x539F;&#x5C01;&#x4E0D;&#x52A8;&#x5730;&#x628A;&#x95EE;&#x9898;&#x91CD;&#x590D;&#x4E00;&#x904D;&#xFF0C;&#x8FD9;&#x5DF2;&#x7ECF;&#x662F;&#x8B66;&#x544A;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x66FE;&#x7ECF;&#x9047;&#x5230;&#x8FC7;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x72C2;&#x7684;&#x5019;&#x9009;&#xFF0C;&#x90FD;&#x4E0D;&#x662F;&#x6211;&#x4E3B;&#x9762;&#xFF0C;&#x800C;&#x662F;&#x5E26;&#x7740;&#x6211;&#x4E0B;&#x9762;&#x56E2;&#x961F;&#x7684;&#x4E3B;&#x7BA1;&#xFF0C;&#x542C;&#x4ED6;&#x4EEC;&#x9762;&#x8BD5;&#xFF0C;&#x9762;&#x5B8C;&#x4E86;&#x6211;&#x4F1A;&#x7ED9;&#x51FA;&#x6211;&#x7684;&#x610F;&#x89C1;&#x3002;&#x6709;&#x4E00;&#x6B21;&#x6211;&#x5E26;&#x7684;&#x4E3B;&#x7BA1;&#x6280;&#x672F;&#x80FD;&#x529B;&#x5176;&#x5B9E;&#x5F88;&#x725B;&#xFF0C;&#x54E5;&#x4EEC;&#x662F;&#x6E05;&#x534E;&#x7684;&#x8084;&#x4E1A;&#x535A;&#x58EB;&#xFF0C;&#x6E05;&#x534E;&#x535A;&#x58EB;&#x6BD5;&#x4E1A;&#x5F88;&#x96BE;&#xFF0C;&#x71AC;&#x4E86;&#x597D;&#x591A;&#x5E74;&#x5B9E;&#x5728;&#x4E0D;&#x60F3;&#x71AC;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x5C31;&#x8084;&#x4E1A;&#x4E86;&#x3002;&#x8FD9;&#x54E5;&#x4EEC;&#x6027;&#x683C;&#x7279;&#x522B;&#x6E29;&#x548C;&#xFF0C;&#x4E3A;&#x4EBA;&#x4E5F;&#x5F88;&#x4F4E;&#x8C03;&#xFF0C;&#x8BF4;&#x8BDD;&#x7684;&#x58F0;&#x97F3;&#x5F88;&#x4F4E;&#xFF0C;&#x8BBA;&#x6C14;&#x573A;&#x7684;&#x8BDD;&#xFF0C;&#x5F88;&#x5F31;&#xFF0C;&#x4F46;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x6C42;&#x52A9;&#x6765;&#x8005;&#x4E0D;&#x62D2;&#xFF0C;&#x800C;&#x4E14;&#x90FD;&#x80FD;&#x641E;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x5F88;&#x53D7;&#x5C0A;&#x656C;&#x3002;&#x88AB;&#x9762;&#x8BD5;&#x90A3;&#x54E5;&#x4EEC;&#x80FD;&#x529B;&#x4E00;&#x822C;&#x822C;&#xFF0C;&#x4F46;&#x5F00;&#x573A;&#x4E0D;&#x5230;&#x4E94;&#x5206;&#x949F;&#x6211;&#x5C31;&#x60F3;&#x5C3D;&#x5FEB;&#x7ED3;&#x675F;&#x4E86;&#x3002;&#x90A3;&#x54E5;&#x4EEC;&#x58F0;&#x97F3;&#x5F88;&#x6D2A;&#x4EAE;&#x3001;&#x6C14;&#x573A;&#x5F88;&#x8DB3;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x88AB;&#x95EE;&#x4F4F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53CD;&#x5F39;&#x5C31;&#x5F88;&#x5927;&#xFF0C;&#x80FD;&#x629B;&#x51FA;&#x51E0;&#x4E2A;&#x53CD;&#x95EE;&#x53E5;&#x7ED9;&#x9762;&#x8BD5;&#x5B98;&#x3002;&#x800C;&#x4E14;&#x8D8A;&#x5F80;&#x540E;&#x8D8A;&#x72C2;&#xFF0C;&#x6574;&#x4E2A;&#x9762;&#x8BD5;&#x8FDB;&#x7A0B;&#x88AB;&#x4ED6;&#x4E3B;&#x5BFC;&#x4E86;&#x3002;&#x867D;&#x7136;&#x4E8B;&#x5148;&#x7EA6;&#x5B9A;&#x597D;&#x6211;&#x4E0D;&#x5E72;&#x9884;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x4E3B;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x51FA;&#x624B;&#xFF0C;&#x8FD9;&#x79CD;&#x662F;&#x6211;&#x552F;&#x4E00;&#x4F1A;&#x51FA;&#x624B;&#x6253;&#x538B;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x592A;&#x5F71;&#x54CD;&#x516C;&#x53F8;&#x7684;&#x4F53;&#x9762;&#x4E86;&#x3002;&#x4ECE;&#x90A3;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x8981;&#x6C42;&#x6211;&#x7684;&#x4E3B;&#x7BA1;&#x4EEC;&#x5728;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#x58F0;&#x97F3;&#x5FC5;&#x987B;&#x6D2A;&#x4EAE;&#xFF0C;&#x4E0D;&#x80FD;&#x6BD4;&#x5BF9;&#x65B9;&#x4F4E;&#xFF1B;&#x4E0D;&#x7BA1;&#x81EA;&#x5DF1;&#x8BF4;&#x8BDD;&#x8FD8;&#x662F;&#x5BF9;&#x65B9;&#x8BF4;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53CC;&#x76EE;&#x90FD;&#x8981;&#x76F4;&#x89C6;&#x5BF9;&#x65B9;&#xFF1B;&#x624B;&#x4E0A;&#x4E0D;&#x8981;&#x6709;&#x5C0F;&#x52A8;&#x4F5C;&#xFF0C;&#x5C24;&#x5176;&#x4E0D;&#x8981;&#x6263;&#x7B14;&#xFF1B;&#x5BF9;&#x65B9;&#x56DE;&#x7B54;&#x5B8C;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x8981;&#x957F;&#x65F6;&#x95F4;&#x5730;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x51FA;&#x73B0;&#x51B7;&#x573A;&#x2026;&#x2026;&#x8FD9;&#x4E9B;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x591A;&#x7684;&#x662F;&#x6C9F;&#x901A;&#x793C;&#x4EEA;&#xFF0C;&#x5374;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x505A;&#x5230;&#x3002;&#x51E0;&#x4E2A;&#x7F3A;&#x70B9;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5C31;&#x4F1A;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x50CF;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x8FDB;&#x800C;&#x8BA9;&#x4F60;&#x5931;&#x53BB;&#x5BF9;&#x9762;&#x8BD5;&#x573A;&#x9762;&#x7684;&#x4E3B;&#x5BFC;&#x529B;&#x3002;&#x786E;&#x5B9E;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#xFF0C;&#x4E1A;&#x52A1;&#x51FA;&#x8272;&#x4E86;&#x90FD;&#x9002;&#x5408;&#x62C9;&#x6765;&#x5E72;&#x9762;&#x8BD5;&#x8FD9;&#x6D3B;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/招聘/" rel="tag">#招聘</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/08/21/2016/0814HelloAndroid/" rel="next" title="Hello Android —— 自下而上的探索">
                <i class="fa fa-chevron-left"></i> Hello Android —— 自下而上的探索
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/09/08/2016/0908Emulator/" rel="prev" title="在模拟器上运行app">
                在模拟器上运行app <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/08/28/2016/0828又是一年校招季/"
           data-title="又是一年校招季" data-url="http://palanceli.github.io/2016/08/28/2016/0828又是一年校招季/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://avatars0.githubusercontent.com/u/13184524"
               alt="Palance Li" />
          <p class="site-author-name" itemprop="name">Palance Li</p>
          <p class="site-description motion-element" itemprop="description">学习，重生</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">131</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">18</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">50</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/palanceli" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/zchongr" target="_blank" title="我的CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的CSDN
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/palance/" target="_blank" title="我的博客园">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的博客园
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/" target="_blank" title="我的简书">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的简书
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#关于面试风格"><span class="nav-text">关于面试风格</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Palance Li</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"palanceli"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  

  

  

  

</body>
</html>
