<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="随笔," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x7231;&amp;#x5979;&amp;#xFF0C;&amp;#x8BF7;&amp;#x5E26;&amp;#x5979;&amp;#x53BB;Carmel&amp;#xFF0C;&amp;#x5728;&amp;#x90A3;&amp;#x91CC;&amp;#x5979;&amp;#x4F1A;&amp;#x7231;&amp;#x4E0A;&amp;#x4F60;&amp;#xFF1B;
&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x6068;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="Carmel">
<meta property="og:url" content="http://palanceli.github.io/2018/07/07/2018/0707Carmel/index.html">
<meta property="og:site_name" content="Palance's Blog">
<meta property="og:description" content="&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x7231;&amp;#x5979;&amp;#xFF0C;&amp;#x8BF7;&amp;#x5E26;&amp;#x5979;&amp;#x53BB;Carmel&amp;#xFF0C;&amp;#x5728;&amp;#x90A3;&amp;#x91CC;&amp;#x5979;&amp;#x4F1A;&amp;#x7231;&amp;#x4E0A;&amp;#x4F60;&amp;#xFF1B;
&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x6068;&amp;">
<meta property="og:image" content="http://palanceli.github.io/2018/07/07/2018/0707Carmel/img01.jpg">
<meta property="og:image" content="http://palanceli.github.io/2018/07/07/2018/0707Carmel/img02.png">
<meta property="og:image" content="http://palanceli.github.io/2018/07/07/2018/0707Carmel/img04.jpeg">
<meta property="og:image" content="http://palanceli.github.io/2018/07/07/2018/0707Carmel/img03.jpeg">
<meta property="og:image" content="http://palanceli.github.io/2018/07/07/2018/0707Carmel/img05.jpg">
<meta property="og:updated_time" content="2018-07-08T05:04:34.997Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Carmel">
<meta name="twitter:description" content="&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x7231;&amp;#x5979;&amp;#xFF0C;&amp;#x8BF7;&amp;#x5E26;&amp;#x5979;&amp;#x53BB;Carmel&amp;#xFF0C;&amp;#x5728;&amp;#x90A3;&amp;#x91CC;&amp;#x5979;&amp;#x4F1A;&amp;#x7231;&amp;#x4E0A;&amp;#x4F60;&amp;#xFF1B;
&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x6068;&amp;">
<meta name="twitter:image" content="http://palanceli.github.io/2018/07/07/2018/0707Carmel/img01.jpg">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://palanceli.github.io/2018/07/07/2018/0707Carmel/"/>

  <title> Carmel | Palance's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e9c9a05f15583e8039e36cfe85103e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Palance's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', '1Grug_XAD_ps3zyBywoo','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Carmel
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2018-07-07T14:00:00+08:00" content="2018-07-07">
              2018-07-07
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/旅行/" itemprop="url" rel="index">
                    <span itemprop="name">旅行</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2018/07/07/2018/0707Carmel/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2018/07/07/2018/0707Carmel/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><em>&#x5982;&#x679C;&#x4F60;&#x7231;&#x5979;&#xFF0C;&#x8BF7;&#x5E26;&#x5979;&#x53BB;Carmel&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x5979;&#x4F1A;&#x7231;&#x4E0A;&#x4F60;&#xFF1B;</em><br>
<em>&#x5982;&#x679C;&#x4F60;&#x6068;&#x5979;&#xFF0C;&#x8BF7;&#x5E26;&#x5979;&#x53BB;Carmel&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x4F60;&#x4F1A;&#x7231;&#x4E0A;&#x5979;&#x3002;</em> <img src="/2018/07/07/2018/0707Carmel/img01.jpg"></p>
<a id="more"></a>
<p>Carmel&#x662F;&#x4F4D;&#x4E8E;&#x52A0;&#x5DDE;&#x897F;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x6E2F;&#x6E7E;&#xFF0C;&#x5728;&#x65E7;&#x91D1;&#x5C71;&#x5F80;&#x5357;&#x7EA6;200&#x516C;&#x91CC;&#x3002;&#x6574;&#x4E2A;&#x5C0F;&#x9547;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x53EF;&#x80FD;&#x6BD4;&#x6E05;&#x534E;&#x7684;&#x6821;&#x56ED;&#x8FD8;&#x5C0F;&#xFF0C;&#x4ECE;&#x4E00;&#x4FA7;&#x6563;&#x6B65;&#x8D70;&#x5230;&#x53E6;&#x4E00;&#x4FA7;&#x53EA;&#x9700;&#x8981;20&#x5206;&#x949F;&#x3002;&#x867D;&#x7136;&#x662F;&#x4E2A;&#x65C5;&#x6E38;&#x5C0F;&#x9547;&#xFF0C;&#x4E3B;&#x5E72;&#x9053;&#x4E24;&#x4FA7;&#x90FD;&#x662F;&#x5C0F;&#x5546;&#x5E97;&#xFF0C;&#x4F46;&#x6574;&#x4E2A;&#x9547;&#x5B50;&#x975E;&#x5E38;&#x7684;&#x9759;&#x8C27;&#xFF0C;&#x8857;&#x9053;&#x7684;&#x4E24;&#x4FA7;&#x79CD;&#x6EE1;&#x4E86;&#x4E94;&#x989C;&#x516D;&#x8272;&#x7684;&#x9C9C;&#x82B1;&#xFF0C;&#x975E;&#x5E38;&#x6574;&#x9F50;&#xFF0C;&#x6BCF;&#x4E00;&#x5EA7;&#x5EAD;&#x9662;&#x91CC;&#x4E5F;&#x90FD;&#x7C07;&#x62E5;&#x7740;&#x7EFF;&#x690D;&#x3002;&#x611F;&#x89C9;&#x8FD9;&#x91CC;&#x66F4;&#x50CF;&#x662F;&#x6B27;&#x6D32;&#xFF0C;&#x800C;&#x4E0D;&#x50CF;&#x7F8E;&#x56FD;&#x90A3;&#x79CD;&#x7C97;&#x653E;&#x3001;&#x7D27;&#x5F20;&#x7684;&#x751F;&#x6D3B;&#x6C1B;&#x56F4;&#x3002;<br>
<img src="/2018/07/07/2018/0707Carmel/img02.png"></p>
<p>&#x6E05;&#x6668;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x8F66;&#x76F4;&#x63A5;&#x6765;&#x5230;&#x6D77;&#x8FB9;&#xFF0C;&#x8F66;&#x505C;&#x5728;&#x9A6C;&#x8DEF;&#x8FB9;&#x4E0A;&#xFF0C;&#x5149;&#x7740;&#x811A;&#x8D70;&#x8FC7;&#x4E00;&#x6BB5;&#x4E0B;&#x5761;&#x5C31;&#x662F;&#x6D77;&#x5CB8;&#x4E86;&#x3002;&#x5F53;&#x6D77;&#x6EE9;&#x7684;&#x666F;&#x8272;&#x6620;&#x5165;&#x773C;&#x5E18;&#xFF0C;&#x6211;&#x77AC;&#x95F4;&#x5C31;&#x7231;&#x4E0A;&#x4E86;&#x8FD9;&#x91CC;&#x3002;&#x867D;&#x7136;&#x66FE;&#x7ECF;&#x53BB;&#x8FC7;&#x5F88;&#x591A;&#x6D77;&#x8FB9;&#x5EA6;&#x5047;&#xFF0C;&#x4F46;&#x8FD9;&#x56DE;&#x662F;&#x6211;&#x751F;&#x547D;&#x5F53;&#x4E2D;&#x7B2C;&#x4E00;&#x6B21;&#x6765;&#x5230;&#x4E86;&#x68A6;&#x60F3;&#x91CC;&#x7684;&#x5927;&#x6D77;&#x8FB9;&#xFF01;&#x5728;&#x68A6;&#x91CC;&#xFF0C;&#x5927;&#x6D77;&#x5E94;&#x8BE5;&#x957F;&#x8FD9;&#x6837;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x6C99;&#x6EE9;&#x5F88;&#x5E72;&#x51C0;&#xFF0C;&#x88AB;&#x6D77;&#x6D6A;&#x8F7B;&#x629A;&#x5F97;&#x5F88;&#x5E73;&#x6ED1;&#xFF0C;&#x80FD;&#x591F;&#x6620;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x5012;&#x5F71;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x6D77;&#x6D6A;&#x70ED;&#x60C5;&#x5954;&#x653E;&#xFF0C;&#x4E00;&#x4EBA;&#x9AD8;&#x96EA;&#x767D;&#x7684;&#x6D6A;&#x82B1;&#x6447;&#x66F3;&#x7740;&#x7A7A;&#x6C14;&#xFF0C;&#x53CD;&#x800C;&#x66F4;&#x886C;&#x6258;&#x8FD9;&#x91CC;&#x7684;&#x5B81;&#x9759;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x4EBA;&#x4EEC;&#x5F88;&#x6563;&#x6DE1;&#xFF0C;&#x6C99;&#x6EE9;&#x4E0A;&#x770B;&#x6D77;&#x3001;&#x6563;&#x6B65;&#xFF0C;&#x5076;&#x5C14;&#x9760;&#x8FD1;&#x6D77;&#x6D6A;&#x5B09;&#x620F;&#x7247;&#x523B;&#xFF0C;&#x5B69;&#x5B50;&#x4EEC;&#x5E26;&#x7740;&#x5C0F;&#x6876;&#x73A9;&#x6C99;&#x5B50;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x7275;&#x7740;&#x72D7;&#x72D7;&#xFF0C;&#x4ED6;&#x4EEC;&#x50CF;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x5E38;&#x5BA2;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C31;&#x4F4F;&#x5728;&#x9644;&#x8FD1;&#x5427;&#xFF0C;&#x72D7;&#x72D7;&#x4E0D;&#x6015;&#x6C34;&#xFF0C;&#x5E38;&#x5E38;&#x51B2;&#x8FDB;&#x6D77;&#x6D6A;&#x91CC;&#x4E00;&#x4F1A;&#x53C8;&#x4ECE;&#x522B;&#x7684;&#x6D6A;&#x82B1;&#x4E2D;&#x94BB;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x6D77;&#x5CB8;&#x7EBF;&#x8BA9;&#x4F60;&#x8EAB;&#x4E0D;&#x7531;&#x5DF1;&#x4E0D;&#x505C;&#x5730;&#x770B;&#x4E0D;&#x505C;&#x5730;&#x60F3;&#xFF0C;&#x8FD1;&#x5904;&#x7684;&#x5C0F;&#x6728;&#x5C4B;&#x91CC;&#x9762;&#x4F4F;&#x7740;&#x4EC0;&#x4E48;&#x4EBA;&#xFF1F;&#x7A0D;&#x8FDC;&#x4E00;&#x4E9B;&#x7684;&#x5C71;&#x548C;&#x68EE;&#x6797;&#xFF0C;&#x5B83;&#x4EEC;&#x548C;&#x8FD9;&#x7247;&#x6D77;&#x966A;&#x4F34;&#x4E86;&#x591A;&#x4E45;&#xFF1F;&#x66F4;&#x8FDC;&#x5904;&#x6D69;&#x6E3A;&#x7684;&#x6D77;&#x5E73;&#x9762;&#xFF0C;&#x5F53;&#x6211;&#x5728;&#x5317;&#x4EAC;&#x6478;&#x722C;&#x6EDA;&#x6253;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x91CC;&#x7684;&#x67D0;&#x4E2A;&#x6D6A;&#x82B1;&#xFF0C;&#x67D0;&#x6761;&#x5C0F;&#x9C7C;&#xFF0C;&#x67D0;&#x4E2A;&#x8D1D;&#x58F3;&#xFF0C;&#x5B83;&#x4EEC;&#x6B63;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#x2026;&#x2026; &#x65E0;&#x8BBA;&#x600E;&#x4E48;&#x60F3;&#xFF0C;&#x6700;&#x540E;&#x603B;&#x4F1A;&#x843D;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#x6765;&#xFF0C;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x8BE5;&#x7559;&#x4E0B;&#x6765;:)</p>
<p>&#x4E0A;&#x5348;&#x5C31;&#x5750;&#x5728;&#x6D77;&#x8FB9;&#xFF0C;&#x770B;&#x6D77;&#xFF0C;&#x542C;&#x6D77;&#x3002;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x8FC7;&#x53BB;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x7684;&#x6D77;&#x6C34;&#x8FD8;&#x662F;&#x51B0;&#x51C9;&#x7684;&#xFF0C;&#x50CF;&#x590F;&#x5929;&#x7684;&#x4E95;&#x6C34;&#xFF0C;&#x6240;&#x4EE5;&#x5076;&#x5C14;&#x4E0B;&#x53BB;&#x88AB;&#x6D77;&#x6D6A;&#x6447;&#x6643;&#x51E0;&#x6B21;&#xFF0C;&#x5C31;&#x5F97;&#x8D76;&#x7D27;&#x56DE;&#x5230;&#x5CB8;&#x4E0A;&#x7F13;&#x4E00;&#x4F1A;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x60F3;&#x518D;&#x4E0B;&#x53BB;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#x611F;&#x53D7;&#x5927;&#x6D77;&#x6251;&#x9762;&#x800C;&#x6765;&#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x5C14;&#x540E;&#x6D77;&#x6D6A;&#x9000;&#x53BB;&#x5B83;&#x53D1;&#x52A8;&#x811A;&#x4E0B;&#x6BCF;&#x4E00;&#x9897;&#x6C99;&#x7C92;&#x8F7B;&#x629A;&#x4F60;&#x7684;&#x811A;&#x5FC3;&#xFF0C;&#x76F4;&#x8FBE;&#x5185;&#x5FC3;&#xFF0C;&#x8BA9;&#x4F60;&#x518D;&#x6062;&#x590D;&#x5E73;&#x9759;&#x3002;&#x90A3;&#x79CD;&#x68D2;&#x559D;&#x3001;&#x6559;&#x8BF2;&#x4E5F;&#x8BB8;&#x53EA;&#x6709;&#x5927;&#x6D77;&#x624D;&#x80FD;&#x7ED9;&#x5230;&#x6211;&#x4EEC;&#x5427;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x65F6;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x604B;&#x604B;&#x4E0D;&#x820D;&#x5730;&#x79BB;&#x5F00;&#x6D77;&#x8FB9;&#xFF0C;&#x53BB;&#x9547;&#x4E0A;&#x627E;&#x4E1C;&#x897F;&#x5403;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x4E00;&#x5BB6;&#x610F;&#x5927;&#x5229;&#x9910;&#x5385;&#xFF0C;&#x5728;yelp&#x4E0A;&#x8FD9;&#x5BB6;&#x9910;&#x5385;&#x662F;&#x9547;&#x4E0A;&#x8BC4;&#x5206;&#x6700;&#x9AD8;&#x7684;&#x3002;&#x6211;&#x5BF9;&#x5403;&#x4E00;&#x76F4;&#x4E0D;&#x662F;&#x5F88;&#x654F;&#x611F;&#xFF0C;&#x4F53;&#x9A8C;&#x4E0D;&#x51FA;&#x7F8E;&#x5473;&#x548C;&#x4E00;&#x822C;&#x98DF;&#x7269;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x5403;&#x7684;&#x4E1C;&#x897F;&#x5F88;&#x96BE;&#x7ED9;&#x6211;&#x7559;&#x4E0B;&#x7279;&#x522B;&#x6DF1;&#x523B;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x6709;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x70E4;&#x7F8A;&#x817F;&#xFF0C;&#x5927;&#x8170;&#x5B50;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x2026;&#x2026; &#x7CBE;&#x81F4;&#x7684;&#x996D;&#x83DC;&#x5F88;&#x96BE;&#x64A9;&#x52A8;&#x6211;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5C11;&#x4E86;&#x5F88;&#x591A;&#x53E3;&#x798F;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x5BB6;&#x9910;&#x5385;&#x5F88;&#x6709;&#x7279;&#x8272;&#xFF0C;&#x5348;&#x9910;&#x7ED3;&#x675F;&#xFF0C;&#x540E;&#x53A8;&#x7684;&#x5E08;&#x5085;&#x4EEC;&#x56F4;&#x88D9;&#x8FD8;&#x6CA1;&#x89E3;&#x5C31;&#x51FA;&#x6765;&#x62FF;&#x8D77;&#x9F13;&#x3001;&#x7434;&#x5F00;&#x59CB;&#x5531;&#x6B4C;&#xFF0C;&#x5F88;&#x591A;&#x5BA2;&#x4EBA;&#x52A0;&#x5165;&#x4E00;&#x8D77;&#x8DF3;&#x821E;&#xFF0C;&#x5F88;&#x5F00;&#x5FC3;&#x3002;</p>
<p>&#x5348;&#x9910;&#x540E;&#x6CBF;&#x7740;&#x5C0F;&#x9547;&#x7684;&#x4E3B;&#x5E72;&#x9053;&#x6563;&#x6B65;&#xFF0C;&#x4E3B;&#x5E72;&#x9053;&#x4E24;&#x4FA7;&#x662F;&#x4E00;&#x4E9B;&#x5546;&#x5E97;&#x548C;&#x5C0F;&#x5EAD;&#x9662;&#xFF0C;&#x5927;&#x6982;&#x4E5F;&#x5C31;&#x4E00;&#x4E24;&#x767E;&#x7C73;&#x3002;&#x8FD9;&#x91CC;&#x548C;&#x6D77;&#x6EE9;&#x4E00;&#x6837;&#x8FF7;&#x4EBA;&#xFF0C;&#x8BA9;&#x4F60;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x5730;&#x60F3;&#x4E00;&#x904D;&#x4E00;&#x904D;&#x5730;&#x6E9C;&#x8FBE;&#x3002;&#x52A0;&#x5DDE;&#x7684;&#x7D2B;&#x5916;&#x7EBF;&#x5F88;&#x5F3A;&#xFF0C;&#x6211;&#x56DB;&#x6708;&#x4EFD;&#x6765;&#x53C2;&#x52A0;Google I/O&#x5927;&#x4F1A;&#xFF0C;&#x4E0A;&#x5348;&#x5728;&#x8349;&#x576A;&#x4E0A;&#x542C;&#x4E86;1&#x5C0F;&#x65F6;&#x7684;keynote&#xFF0C;&#x5C31;&#x6652;&#x8131;&#x76AE;&#x4E86;&#x3002;&#x5728;Carmel&#x5927;&#x8DEF;&#x4E24;&#x65C1;&#x90FD;&#x6709;&#x8001;&#x6811;&#xFF0C;&#x8FDE;&#x7EF5;&#x800C;&#x6210;&#x7684;&#x6811;&#x836B;&#xFF0C;&#x4FDD;&#x7559;&#x4E86;&#x9C9C;&#x4EAE;&#x7684;&#x5149;&#x7EBF;&#xFF0C;&#x5374;&#x4E00;&#x70B9;&#x4E0D;&#x611F;&#x5230;&#x707C;&#x70ED;&#x3002;&#x5728;&#x6811;&#x4E0B;&#x5C31;&#x662F;&#x5927;&#x7247;&#x800C;&#x4E14;&#x6574;&#x9F50;&#x7684;&#x9C9C;&#x82B1;&#xFF0C;&#x6BCF;&#x5BB6;&#x5546;&#x5E97;&#x6216;&#x5EAD;&#x9662;&#x91CC;&#x4E5F;&#x90FD;&#x88AB;&#x9C9C;&#x82B1;&#x7C07;&#x62E5;&#x7740;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6F2B;&#x6B65;&#x5C31;&#x50CF;&#x5728;&#x5929;&#x5802;&#x4E00;&#x6837;&#x3002; <img src="/2018/07/07/2018/0707Carmel/img04.jpeg"></p>
<p>&#x9633;&#x5149;&#x3001;&#x8001;&#x6811;&#x3001;&#x6CE5;&#x571F;&#x3001;&#x6E05;&#x98CE;&#x53EA;&#x505C;&#x7559;&#x5728;&#x6211;&#x7AE5;&#x5E74;&#x7684;&#x5370;&#x8C61;&#x91CC;&#xFF0C;&#x957F;&#x5927;&#x540E;&#x5E38;&#x5E74;&#x7A7F;&#x68AD;&#x5728;&#x90FD;&#x5E02;&#x7684;&#x6C34;&#x6CE5;&#x4E1B;&#x6797;&#xFF0C;&#x800C;&#x4E14;&#x5373;&#x4F7F;&#x56DE;&#x5230;&#x6545;&#x4E61;&#xFF0C;&#x5F53;&#x5E74;&#x7684;&#x7530;&#x56ED;&#x65E9;&#x5DF2;&#x4E0D;&#x5728;&#x3002;&#x5728;&#x8DEF;&#x8FB9;&#x6211;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x5730;&#x60F3;&#x5728;&#x4E00;&#x68F5;&#x5927;&#x6811;&#x4E0B;&#x591A;&#x505C;&#x7559;&#x4E00;&#x4F1A;&#xFF0C;&#x53BB;&#x4F53;&#x4F1A;&#x90A3;&#x79CD;&#x4E45;&#x8FDD;&#x7684;&#x6000;&#x5FF5;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x53EA;&#x611F;&#x89C9;&#x65F6;&#x95F4;&#x8D70;&#x5F97;&#x592A;&#x5FEB;&#xFF0C;&#x592A;&#x9633;&#x897F;&#x6C89;&#xFF0C;&#x771F;&#x5730;&#x60F3;&#x8BA9;&#x5B83;&#x518D;&#x6162;&#x4E00;&#x70B9;&#x843D;&#x5165;&#x6D77;&#x5E73;&#x9762;&#x3002;&#x6700;&#x540E;&#x4E00;&#x70B9;&#x65F6;&#x5149;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x5728;&#x6D77;&#x8FB9;&#x5EA6;&#x8FC7;&#xFF0C;&#x4E00;&#x8FB9;&#x770B;&#x5915;&#x9633;&#xFF0C;&#x4E00;&#x8FB9;&#x52AA;&#x529B;&#x5730;&#x8BB0;&#x4F4F;&#x8FD9;&#x91CC;&#x6BCF;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x3001;&#x58F0;&#x97F3;&#x548C;&#x7A7A;&#x6C14;&#x4E2D;&#x7684;&#x5473;&#x9053;&#x3002;&#x91D1;&#x8272;&#x7684;&#x5915;&#x9633;&#x6D12;&#x4E0B;&#x6765;&#xFF0C;&#x770B;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#x50CF;&#x4E0D;&#x50CF;&#x7AE5;&#x8BDD;&#x4E2D;&#x7684;&#x4ED9;&#x5883;&#xFF1F;&#x6211;&#x6709;&#x4E00;&#x79CD;&#x611F;&#x89C9;&#xFF1A;&#x52A0;&#x5DDE;&#x7684;&#x5915;&#x9633;&#x6BD4;&#x5317;&#x4EAC;&#x7F8E;&#x4E00;&#x4E2A;&#x91CF;&#x7EA7;&#x3002;&#x6709;&#x4E00;&#x5929;&#x6211;&#x4EEC;&#x5728;&#x65E7;&#x91D1;&#x5C71;&#x5403;&#x665A;&#x9910;&#xFF0C;&#x521A;&#x597D;&#x4E5F;&#x662F;&#x5915;&#x9633;&#x897F;&#x4E0B;&#xFF0C;&#x6574;&#x4E2A;&#x9910;&#x5385;&#x90FD;&#x662F;&#x4E00;&#x7247;&#x91D1;&#x707F;&#x707F;&#x7684;&#x3002; <img src="/2018/07/07/2018/0707Carmel/img03.jpeg"></p>
<p>&#x592A;&#x9633;&#x843D;&#x5C71;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x65C1;&#x8FB9;&#x7684;&#x5C0F;&#x9547;&#xFF0C;&#x53EB;Carmel Beach&#xFF0C;&#x672C;&#x6765;&#x60F3;&#x53BB;&#x770B;&#x6D77;&#x8C5A;&#xFF0C;&#x90A3;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x6D77;&#x6D0B;&#x516C;&#x56ED;&#x3002;&#x5F00;&#x8F66;&#x5230;&#x8FBE;&#x540E;&#xFF0C;&#x5929;&#x5DF2;&#x7ECF;&#x9ED1;&#x900F;&#xFF0C;&#x6D77;&#x6D0B;&#x516C;&#x56ED;&#x4E5F;&#x5173;&#x95E8;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x6BD4;Carmel&#x5546;&#x4E1A;&#x5316;&#x6C14;&#x6C1B;&#x66F4;&#x6D53;&#x91CD;&#xFF0C;&#x65C5;&#x6E38;&#x89C2;&#x5149;&#x7684;&#x4EBA;&#x660E;&#x663E;&#x591A;&#x4E86;&#xFF0C;&#x8D70;&#x5728;&#x9A6C;&#x8DEF;&#x4E0A;&#x611F;&#x53D7;&#x8FD9;&#x91CC;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x5EA7;&#x57CE;&#x5E02;&#xFF0C;&#x4E24;&#x8FB9;&#x7684;&#x5546;&#x5E97;&#x4E5F;&#x66F4;&#x7E41;&#x534E;&#x3002;Happy&#x7684;&#x662F;&#x6D77;&#x9C9C;&#x9910;&#x5385;&#x4E5F;&#x591A;&#x4E86;&#xFF0C;&#x5C3D;&#x7BA1;&#x5929;&#x8272;&#x5DF2;&#x665A;&#xFF0C;&#x56DE;&#x7A0B;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x51B3;&#x5B9A;&#x5728;&#x8FD9;&#x91CC;&#x5403;&#x4E86;&#x665A;&#x9910;&#x518D;&#x56DE;&#x53BB;&#x3002;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#x5C31;&#x662F;&#x5728;&#x9910;&#x5385;&#x8FB9;&#x4E0A;&#x62CD;&#x7684;&#xFF1A; <img src="/2018/07/07/2018/0707Carmel/img05.jpg"> &#x9910;&#x5385;&#x4E0D;&#x8D1F;&#x6240;&#x671B;&#xFF0C;&#x867D;&#x7136;&#x5403;&#x7684;&#x4EC0;&#x4E48;&#x6211;&#x5DF2;&#x7ECF;&#x4E0D;&#x8BB0;&#x5F97;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x7F8E;&#x597D;&#x7684;&#x611F;&#x89C9;&#x5374;&#x662F;&#x6DF1;&#x6DF1;&#x6C89;&#x6DC0;&#x7ED9;Carmel&#xFF01;</p>
<p>&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#x624D;&#x611F;&#x89C9;&#x5230;&#x6211;&#x662F;&#x591A;&#x4E48;&#x4E0D;&#x7231;&#x4E5F;&#x4E0D;&#x64C5;&#x957F;&#x6444;&#x5F71;&#xFF0C;&#x81EA;&#x5DF1;&#x62CD;&#x7684;&#x7167;&#x7247;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x5C11;&#xFF0C;&#x4EC5;&#x6709;&#x7684;&#x51E0;&#x5F20;&#x6311;&#x6765;&#x6311;&#x53BB;&#x90FD;&#x6CA1;&#x6CD5;&#x770B;&#xFF0C;&#x8FD9;&#x91CC;&#x5949;&#x4E0A;&#x7684;&#x7167;&#x7247;&#x5927;&#x591A;&#x662F;&#x540C;&#x4F34;&#x7167;&#x7684;&#x3002;&#x611F;&#x8C22;&#x5979;&#xFF01;</p>
<p>&#x6587;&#x7AE0;&#x5F00;&#x5934;&#x90A3;&#x53E5;&#x8BDD;&#x6E90;&#x81EA;&#x300A;&#x5317;&#x4EAC;&#x4EBA;&#x5728;&#x7EBD;&#x7EA6;&#x300B;&#x7684;&#x7247;&#x5934;&#x2014;&#x2014;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x4F60;&#x7231;&#x5979;&#xFF0C;&#x8BF7;&#x5E26;&#x5979;&#x53BB;&#x7EBD;&#x7EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x91CC;&#x662F;&#x5929;&#x5802;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x6068;&#x5979;&#xFF0C;&#x8BF7;&#x5E26;&#x5979;&#x53BB;&#x7EBD;&#x7EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x91CC;&#x662F;&#x5730;&#x72F1;&#x3002;</p>
</blockquote>
<p>&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x8FD9;&#x53E5;&#x8BDD;&#x6211;&#x8FD8;&#x4E0A;&#x521D;&#x4E2D;&#xFF0C;&#x7ED9;&#x6211;&#x5370;&#x8C61;&#x975E;&#x5E38;&#x6DF1;&#x523B;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x5BF9;&#x8FD9;&#x53E5;&#x8BDD;&#x5E76;&#x4E0D;&#x8BA4;&#x540C;&#xFF0C;&#x5E78;&#x798F;&#x6765;&#x81EA;&#x7231;&#x4E0E;&#x88AB;&#x7231;&#xFF0C;&#x4E0E;&#x6068;&#x65E0;&#x5173;&#x3002;Carmel&#x662F;&#x4E00;&#x4E2A;&#x4EE4;&#x4F60;&#x60F3;&#x8981;&#x7231;&#x7684;&#x5730;&#x65B9;&#xFF01;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/随笔/" rel="tag">#随笔</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/06/22/2018/0622Finance/" rel="next" title="使用现金流贴现法算算几家美国公司的绝对估值">
                <i class="fa fa-chevron-left"></i> 使用现金流贴现法算算几家美国公司的绝对估值
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/07/08/2018/0708HS300IDX/" rel="prev" title="关于估值定投的一点研究">
                关于估值定投的一点研究 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2018/07/07/2018/0707Carmel/"
           data-title="Carmel" data-url="http://palanceli.github.io/2018/07/07/2018/0707Carmel/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://avatars0.githubusercontent.com/u/13184524"
               alt="Palance Li" />
          <p class="site-author-name" itemprop="name">Palance Li</p>
          <p class="site-description motion-element" itemprop="description">学习，重生</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">191</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">27</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">59</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/palanceli" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/zchongr" target="_blank" title="我的CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的CSDN
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/palance/" target="_blank" title="我的博客园">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的博客园
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/" target="_blank" title="我的简书">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的简书
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Palance Li</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"palanceli"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
