<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="未来简史," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x6625;&amp;#x8282;&amp;#x671F;&amp;#x95F4;&amp;#x5982;&amp;#x9884;&amp;#x671F;&amp;#x5B8C;&amp;#x6210;&amp;#x4E86;&amp;#x4E24;&amp;#x4E2A;&amp;#x8BA1;&amp;#x5212;&amp;#xFF1A;1&amp;#x3001;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;&amp;#x300A;Android&amp;#x7CFB;&amp;#x7EDF;&amp;#x6E90;&amp;#x4EE3;">
<meta property="og:type" content="article">
<meta property="og:title" content="《未来简史》读书笔记">
<meta property="og:url" content="http://palanceli.github.io/2017/02/01/2017/0201HomoDeus1/index.html">
<meta property="og:site_name" content="Palance's Blog">
<meta property="og:description" content="&amp;#x6625;&amp;#x8282;&amp;#x671F;&amp;#x95F4;&amp;#x5982;&amp;#x9884;&amp;#x671F;&amp;#x5B8C;&amp;#x6210;&amp;#x4E86;&amp;#x4E24;&amp;#x4E2A;&amp;#x8BA1;&amp;#x5212;&amp;#xFF1A;1&amp;#x3001;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;&amp;#x300A;Android&amp;#x7CFB;&amp;#x7EDF;&amp;#x6E90;&amp;#x4EE3;">
<meta property="og:image" content="http://palanceli.github.io/2017/02/01/2017/0201HomoDeus1/img1.png">
<meta property="og:updated_time" content="2017-02-01T16:33:08.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《未来简史》读书笔记">
<meta name="twitter:description" content="&amp;#x6625;&amp;#x8282;&amp;#x671F;&amp;#x95F4;&amp;#x5982;&amp;#x9884;&amp;#x671F;&amp;#x5B8C;&amp;#x6210;&amp;#x4E86;&amp;#x4E24;&amp;#x4E2A;&amp;#x8BA1;&amp;#x5212;&amp;#xFF1A;1&amp;#x3001;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;&amp;#x300A;Android&amp;#x7CFB;&amp;#x7EDF;&amp;#x6E90;&amp;#x4EE3;">
<meta name="twitter:image" content="http://palanceli.github.io/2017/02/01/2017/0201HomoDeus1/img1.png">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://palanceli.github.io/2017/02/01/2017/0201HomoDeus1/"/>

  <title> 《未来简史》读书笔记 | Palance's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e9c9a05f15583e8039e36cfe85103e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Palance's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', '1Grug_XAD_ps3zyBywoo','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                《未来简史》读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2017-02-01T22:49:00+08:00" content="2017-02-01">
              2017-02-01
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/读书笔记/" itemprop="url" rel="index">
                    <span itemprop="name">读书笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2017/02/01/2017/0201HomoDeus1/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/02/01/2017/0201HomoDeus1/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6625;&#x8282;&#x671F;&#x95F4;&#x5982;&#x9884;&#x671F;&#x5B8C;&#x6210;&#x4E86;&#x4E24;&#x4E2A;&#x8BA1;&#x5212;&#xFF1A;1&#x3001;&#x8BFB;&#x5B8C;&#x4E86;&#x300A;Android&#x7CFB;&#x7EDF;&#x6E90;&#x4EE3;&#x7801;&#x60C5;&#x666F;&#x5206;&#x6790;&#x300B;&#x5E76;&#x7ED9;&#x5927;&#x90E8;&#x5206;&#x7AE0;&#x8282;&#x5199;&#x4E86;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x5927;&#x90E8;&#x5206;&#x662F;&#x5229;&#x7528;&#x4E86;2016&#x5E74;&#x7684;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x6625;&#x8282;&#x53EA;&#x662F;&#x7ED9;&#x4ED6;&#x753B;&#x4E86;&#x4E2A;&#x53E5;&#x53F7;&#x3002;2&#x3001;&#x8BFB;&#x5B8C;&#x4E86;&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#xFF0C;&#x8FD9;&#x662F;&#x7528;&#x4E94;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x8BFB;&#x5B8C;&#x7684;&#x3002;<a id="more"></a> <img src="/2017/02/01/2017/0201HomoDeus1/img1.png" alt="&#x672A;&#x6765;&#x7B80;&#x53F2;"> &#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x5F88;&#x597D;&#x8BFB;&#xFF0C;&#x601D;&#x8DEF;&#x6E05;&#x6670;&#x3002;&#x4ED6;&#x9996;&#x5148;&#x5206;&#x6790;&#x4E86;&#x73B0;&#x4EE3;&#x4EBA;&#x7C7B;&#x8D4B;&#x4E88;&#x81EA;&#x8EAB;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x9010;&#x4E2A;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x610F;&#x4E49;&#x5B58;&#x5728;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x8FDB;&#x800C;&#x63A8;&#x5BFC;&#x51FA;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x4E00;&#x79CD;&#x731C;&#x60F3;&#x2014;&#x2014;&#x6240;&#x6709;&#x7684;&#x610F;&#x4E49;&#x7EC8;&#x5C06;&#x70DF;&#x6D88;&#x4E91;&#x6563;&#xFF0C;&#x6570;&#x636E;&#x5C06;&#x6210;&#x4E16;&#x754C;&#x7684;&#x4E3B;&#x5BB0;&#x3002;&#x6709;&#x4E9B;&#x63A8;&#x5BFC;&#x7684;&#x5FC5;&#x7136;&#x6027;&#x503C;&#x5F97;&#x53CD;&#x590D;&#x54C1;&#x5473;&#xFF0C;&#x53CD;&#x6B63;&#x4EC5;&#x51ED;&#x4E00;&#x6B21;&#x9605;&#x8BFB;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x60F3;&#x660E;&#x767D;&#x3002;&#x5176;&#x4E2D;&#x5F88;&#x591A;&#x601D;&#x8003;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x662F;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x968F;&#x4FBF;&#x4E3E;&#x51E0;&#x4E2A;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x8BF4;&#x7814;&#x7A76;&#x5386;&#x53F2;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x6323;&#x8131;&#x8FC7;&#x53BB;&#x7684;&#x684E;&#x688F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x80FD;&#x770B;&#x5411;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x6CE8;&#x610F;&#x5230;&#x524D;&#x4EBA;&#x65E0;&#x6CD5;&#x60F3;&#x8C61;&#x6216;&#x8FC7;&#x53BB;&#x4E0D;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x60F3;&#x8C61;&#x5230;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x8FD9;&#x4E0E;&#x53F8;&#x9A6C;&#x5149;&#x7684;&#x201C;&#x4EE5;&#x53F2;&#x4E3A;&#x9274;&#x201D;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#x3002;&#x201C;&#x4EE5;&#x53F2;&#x4E3A;&#x9274;&#x201D;&#x662F;&#x628A;&#x5386;&#x53F2;&#x5F53;&#x4F5C;&#x4E00;&#x79CD;&#x6307;&#x5BFC;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x514D;&#x4E8E;&#x8E29;&#x5751;&#x6216;&#x8005;&#x770B;&#x5230;&#x673A;&#x4F1A;&#x3002;&#x6BD4;&#x5982;&#x77E5;&#x9053;&#x201C;&#x53CC;&#x5341;&#x4E00;&#x201D;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x521D;&#x671F;&#x5546;&#x5BB6;&#x4E3A;&#x4E86;&#x8BB2;&#x6545;&#x4E8B;&#x3001;&#x9020;&#x8282;&#x65E5;&#xFF0C;&#x786E;&#x5B9E;&#x4E0B;&#x4E86;&#x672C;&#xFF0C;&#x5F53;&#x5168;&#x6C11;&#x57F9;&#x517B;&#x8D77;&#x201C;&#x53CC;&#x5341;&#x4E00;&#x8840;&#x62FC;&#x201D;&#x7684;&#x4E60;&#x60EF;&#x4EE5;&#x540E;&#xFF0C;&#x964D;&#x4EF7;&#x3001;&#x6253;&#x6298;&#x5C31;&#x6210;&#x4E86;&#x4F20;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x597D;&#x4E8B;&#x662F;&#x5F88;&#x96BE;&#x62A2;&#x5230;&#x7684;&#xFF0C;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x6307;&#x5BFC;&#x4F60;&#x4EE5;&#x540E;&#x53CC;&#x5341;&#x4E00;&#x524D;&#x5929;&#x665A;&#x4E0A;&#x4E0D;&#x5FC5;&#x518D;&#x75F4;&#x75F4;&#x5B88;&#x591C;&#x3002;&#x800C;&#x300A;&#x7B80;&#x53F2;&#x300B;&#x7684;&#x89C2;&#x5FF5;&#x5219;&#x662F;&#x901A;&#x8FC7;&#x957F;&#x7126;&#x955C;&#x5934;&#x770B;&#x5F85;&#x8FD9;&#x6BB5;&#x5386;&#x53F2;&#xFF0C;&#x8BA9;&#x4F60;&#x77E5;&#x9053;&#x201C;&#x53CC;&#x5341;&#x4E00;&#x201D;&#x3001;&#x201C;&#x60C5;&#x4EBA;&#x8282;&#x201D;&#x3001;&#x201C;&#x94BB;&#x77F3;&#x201D;&#x3001;&#x201C;&#x540D;&#x724C;&#x201D;&#x2026;&#x2026;&#x8FD9;&#x4E9B;&#x90FD;&#x53EA;&#x662F;&#x4EBA;&#x9020;&#x6545;&#x4E8B;&#x800C;&#x5DF2;&#xFF0C;&#x5F53;&#x4F60;&#x5BF9;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x75F4;&#x8FF7;&#x800C;&#x65E0;&#x6CD5;&#x81EA;&#x62D4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#x662F;&#x4E0D;&#x662F;&#x53C8;&#x6DF1;&#x9677;&#x5230;&#x4E86;&#x67D0;&#x4E2A;&#x4EBA;&#x9020;&#x6545;&#x4E8B;&#x91CC;&#x3002;&#x8FD9;&#x7C7B;&#x6545;&#x4E8B;&#x5982;&#x201C;&#x6587;&#x9769;&#x201D;&#x3001;&#x5982;&#x201C;&#x7EB3;&#x7CB9;&#x201D;&#x4E00;&#x6837;&#xFF0C;&#x7ECF;&#x5386;&#x4E5F;&#x8BB8;&#x4E0D;&#x7528;&#x592A;&#x4E45;&#x7684;&#x65F6;&#x95F4;&#x6D17;&#x793C;&#xFF0C;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x53EF;&#x7B11;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#xFF0C;&#x8FD8;&#x5BF9;&#x5BF9;&#x5B83;&#x90A3;&#x4E48;&#x75F4;&#x8FF7;&#x5417;&#xFF1F;</p>
<p>&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x8BF4;&#x667A;&#x4EBA;&#x7EDF;&#x6CBB;&#x4E16;&#x754C;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x667A;&#x4EBA;&#x80FD;&#x7F16;&#x7EC7;&#x51FA;&#x4E92;&#x4E3A;&#x4E3B;&#x4F53;&#x7684;&#x610F;&#x4E49;&#x4E4B;&#x7F51;&#x3002;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#xFF0C;&#x6BCF;&#x5206;&#x6BCF;&#x79D2;&#x90FD;&#x6D3B;&#x5728;&#x8FD9;&#x5F20;&#x7F51;&#x91CC;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x5F20;&#x7F51;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x7262;&#x7B3C;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53C8;&#x8981;&#x4F9D;&#x9760;&#x8FD9;&#x5F20;&#x7F51;&#x7ED9;&#x4F60;&#x8D4B;&#x80FD;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x3001;&#x4F60;&#x7684;&#x804C;&#x4F4D;&#x3001;&#x4F60;&#x7684;&#x5BB6;&#x5EAD;&#x3001;&#x4F60;&#x7684;&#x94F6;&#x884C;&#x8D26;&#x6237;&#x7B49;&#x7B49;&#x3002;&#x8282;&#x524D;&#x8DDF;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x804A;&#x5929;&#xFF0C;&#x804A;&#x5230;&#x4E86;&#x5047;&#x79BB;&#x5A5A;&#x5356;&#x623F;&#x8FD9;&#x4E8B;&#x513F;&#xFF0C;&#x6211;&#x8FD8;&#x5632;&#x7B11;&#x4ED6;&#x592A;&#x6B7B;&#x8111;&#x7B4B;&#x3002;&#x6211;&#x548C;&#x6211;&#x8001;&#x5A46;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x53EA;&#x6709;&#x6211;&#x4FE9;&#x6700;&#x6E05;&#x695A;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x6709;&#x8D44;&#x683C;&#x88C1;&#x51B3;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5229;&#x7528;&#x201C;&#x6709;&#x5173;&#x90E8;&#x95E8;&#x201D;&#x5F00;&#x5177;&#x4E00;&#x5F20;&#x7EB8;&#xFF0C;&#x7528;&#x6765;&#x5411;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x201C;&#x6709;&#x5173;&#x90E8;&#x95E8;&#x201D;&#x529E;&#x4E8B;&#x7684;&#x65F6;&#x5019;&#x65B9;&#x4FBF;&#xFF0C;&#x624D;&#x529E;&#x4E86;&#x7ED3;&#x5A5A;&#x8BC1;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x5A5A;&#x59FB;&#x8106;&#x5F31;&#x5230;&#x9700;&#x8981;&#x7528;&#x90A3;&#x5F20;&#x7EB8;&#x6765;&#x4FDD;&#x62A4;&#x548C;&#x8BC1;&#x660E;&#x3002;&#x6709;&#x6CA1;&#x6709;&#x90A3;&#x5F20;&#x7EB8;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x592B;&#x59BB;&#xFF0C;&#x8FD9;&#x5C31;&#x8DDF;&#x6709;&#x6CA1;&#x6709;&#x51FA;&#x751F;&#x8BC1;&#x660E;&#xFF0C;&#x6211;&#x5BB6;&#x95FA;&#x5973;&#x90FD;&#x6765;&#x5230;&#x4E16;&#x4E0A;&#x4E00;&#x6837;&#x3002;&#x9700;&#x8981;&#x6BDB;&#x7684;&#x8BC1;&#x660E;&#xFF01;&#x65E2;&#x7136;&#x8FD9;&#x5F20;&#x7EB8;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8BA9;&#x529E;&#x4E8B;&#x65B9;&#x4FBF;&#xFF0C;&#x90A3;&#x73B0;&#x5728;&#x6211;&#x8981;&#x4E70;&#x623F;&#xFF0C;&#x8FD9;&#x4E48;&#x6B63;&#x7ECF;&#x7684;&#x4E8B;&#x513F;&#xFF0C;&#x90A3;&#x5F20;&#x7EB8;&#x5F53;&#x7136;&#x8981;&#x4E3A;&#x8FD9;&#x4E8B;&#x513F;&#x5927;&#x5F00;&#x7EFF;&#x706F;&#xFF0C;&#x96BE;&#x5F97;&#x6709;&#x51E0;&#x6B21;&#x7528;&#x5B83;&#x7684;&#x65F6;&#x5019;&#xFF01;&#x5373;&#x4F7F;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x5728;&#x201C;&#x5A5A;&#x59FB;&#x201D;&#x8FD9;&#x5F20;&#x7F51;&#x4E4B;&#x5185;&#xFF0C;&#x201C;&#x5A5A;&#x59FB;&#x201D;&#x4E5F;&#x662F;&#x667A;&#x4EBA;&#x7F16;&#x5236;&#x51FA;&#x7684;&#x610F;&#x4E49;&#x4E4B;&#x7F51;&#xFF0C;&#x4E0D;&#x662F;&#x561B;&#x3002;</p>
<p>&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x8BF4;&#x4EBA;&#x53EA;&#x662F;&#x8089;&#x505A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x800C;&#x5DF2;&#xFF0C;&#x5176;&#x5185;&#x90E8;&#x8FD0;&#x884C;&#x7684;&#x662F;&#x751F;&#x5316;&#x7B97;&#x6CD5;&#x3002;&#x4F60;&#x611F;&#x89C9;&#x5230;&#x75BC;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x8111;&#x56DE;&#x8DEF;&#x7684;&#x5F00;&#x5408;&#xFF0C;&#x4F60;&#x611F;&#x89C9;&#x5230;&#x5F00;&#x5FC3;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x8111;&#x56DE;&#x8DEF;&#x7684;&#x5F00;&#x5408;&#xFF0C;&#x4F60;&#x60F3;&#x5403;&#x996D;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x8111;&#x56DE;&#x8DEF;&#x7684;&#x5F00;&#x5408;&#xFF0C;&#x4F60;&#x9009;&#x62E9;&#x7279;&#x6717;&#x666E;&#x5F53;&#x603B;&#x7EDF;&#x4F9D;&#x7136;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x8111;&#x56DE;&#x8DEF;&#x7684;&#x5F00;&#x5408;&#x3002;&#x6240;&#x8C13;&#x7684;&#x201C;&#x4E3B;&#x89C2;&#x610F;&#x8BC6;&#x201D;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x201C;&#x4F60;&#x4EE5;&#x4E3A;&#x201D;&#x4E0D;&#x8FC7;&#x662F;&#x5F53;&#x4E0B;&#x79D1;&#x6280;&#x8FD8;&#x672A;&#x89E6;&#x8FBE;&#x7684;&#x67D0;&#x4E2A;&#x5927;&#x8111;&#x56DE;&#x8DEF;&#x7684;&#x5F00;&#x5408;&#x3002;&#x8FD9;&#x4E0E;&#x9A6C;&#x514B;&#x601D;&#x8BF4;&#x201C;&#x4EBA;&#x7684;&#x672C;&#x8D28;&#x662F;&#x5176;&#x4E00;&#x5207;&#x793E;&#x4F1A;&#x5173;&#x7CFB;&#x7684;&#x603B;&#x548C;&#x201D;&#x76F8;&#x53BB;&#x751A;&#x8FDC;&#xFF0C;&#x201C;&#x4E00;&#x5207;&#x793E;&#x4F1A;&#x5173;&#x7CFB;&#x201D;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x6570;&#x636E;&#x3002;&#x628A;&#x4EBA;&#x7684;&#x672C;&#x8D28;&#x8BF4;&#x6210;&#x201C;&#x5728;&#x5176;&#x8089;&#x4F53;&#x4E4B;&#x4E0A;&#x4E00;&#x5207;&#x7B97;&#x6CD5;&#x7684;&#x603B;&#x548C;&#x201D;&#x5012;&#x66F4;&#x8D34;&#x5207;&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x89C2;&#x70B9;&#x6210;&#x7ACB;&#xFF0C;&#x90A3;&#x771F;&#x5730;&#x7EC6;&#x601D;&#x6781;&#x6050;&#x4E86;&#x3002;&#x5E78;&#x798F;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4EBA;&#x6D3B;&#x7740;&#x7684;&#x610F;&#x4E49;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4EBA;&#x7C7B;&#x793E;&#x4F1A;&#x53D1;&#x5C55;&#x7684;&#x8109;&#x7EDC;&#x5982;&#x679C;&#x662F;&#x671D;&#x7740;&#x7B97;&#x6CD5;&#x8D8A;&#x6765;&#x8D8A;&#x6709;&#x6548;&#x7387;&#x6F14;&#x8FDB;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x673A;&#x5668;&#x6BD4;&#x8089;&#x4F53;&#x8FD0;&#x7B97;&#x66F4;&#x5FEB;&#x66F4;&#x6709;&#x6548;&#x7387;&#xFF0C;&#x90A3;&#x5757;&#x8089;&#x8FD8;&#x6709;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#x4E48;&#xFF1F;</p>
<p>&#x8FD9;&#x4E2A;&#x6625;&#x8282;&#x6CA1;&#x6709;&#x56DE;&#x5BB6;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x8FDE;&#x7740;&#x4E24;&#x4E2A;&#x5E74;&#x90FD;&#x662F;&#x5F85;&#x5728;&#x5BB6;&#x91CC;&#x4E00;&#x5468;&#x770B;&#x4E66;&#x5B66;&#x4E60;&#xFF0C;&#x6D88;&#x9664;&#x5185;&#x5FC3;&#x5BF9;&#x532E;&#x4E4F;&#x7684;&#x7126;&#x8651;&#x3002;&#x8BFB;&#x4E86;&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x4E4B;&#x540E;&#xFF0C;&#x611F;&#x89C9;&#x5185;&#x5FC3;&#x66F4;&#x52A0;&#x8352;&#x51C9;&#x4E86;&#x3002;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#x6B63;&#x6708;&#x5341;&#x4E94;&#x4E4B;&#x524D;&#x96C6;&#x5E02;&#x3001;&#x5546;&#x5E97;&#x90FD;&#x4E0D;&#x5F00;&#x5F20;&#xFF0C;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x4F1A;&#x201C;&#x614C;&#x5E74;&#x201D;&#xFF0C;&#x8D76;&#x5728;&#x8FC7;&#x5E74;&#x4E4B;&#x524D;&#x50A8;&#x5907;&#x8DB3;&#x591F;&#x591A;&#x5403;&#x7684;&#xFF0C;&#x5988;&#x5988;&#x4F1A;&#x5728;&#x5934;&#x4E00;&#x5929;&#x665A;&#x4E0A;&#x7ED9;&#x6211;&#x8D76;&#x505A;&#x597D;&#x65B0;&#x8863;&#x670D;&#xFF0C;&#x5168;&#x5BB6;&#x56F4;&#x5728;&#x4E00;&#x8D77;&#x770B;&#x6625;&#x665A;&#x3002;&#x76F4;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x5BB6;&#x5B9D;&#x5B9D;&#x8FC7;&#x5E74;&#x90A3;&#x5929;&#x7ED9;&#x5728;&#x8001;&#x5BB6;&#x7684;&#x5988;&#x5988;&#x5FAE;&#x4FE1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5988;&#x8FD8;&#x95EE;&#x201C;&#x6709;&#x6CA1;&#x6709;&#x65B0;&#x8863;&#x670D;&#x201D;&#x3002;&#x5230;&#x4E86;&#x516C;&#x5143;2017&#x5E74;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x8FC7;&#x5E74;&#x8D85;&#x5E02;&#x3001;&#x996D;&#x5E97;&#x4E0D;&#x6253;&#x70CA;&#xFF0C;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x968F;&#x65F6;&#x53BB;&#xFF1B;&#x4E00;&#x5E74;&#x56DB;&#x5B63;&#x9700;&#x8981;&#x6DFB;&#x8863;&#x670D;&#x4E86;&#x90FD;&#x61D2;&#x5F97;&#x51FA;&#x95E8;&#xFF0C;&#x70B9;&#x70B9;&#x624B;&#x673A;&#x5C31;&#x7ED9;&#x4F60;&#x9001;&#x5230;&#x5BB6;&#xFF1B;&#x7F8E;&#x5267;&#x3001;&#x5927;&#x7247;&#x3001;&#x8D5B;&#x4E8B;&#x6BCF;&#x5929;&#x4E0D;&#x65AD;&#xFF0C;&#x201C;&#x665A;&#x4F1A;&#x201D;&#x5DF2;&#x7ECF;&#x6210;&#x4E86;&#x4E0A;&#x4E00;&#x4E2A;&#x4E16;&#x7EAA;&#x7684;&#x8BCD;&#x6C47;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x8D8A;&#x6765;&#x8D8A;&#x6709;&#x6548;&#x7387;&#xFF0C;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x5E73;&#x6DE1;&#x2014;&#x2014;&#x4EBA;&#x7C7B;&#x6B63;&#x653E;&#x5F03;&#x610F;&#x4E49;&#x800C;&#x6362;&#x53D6;&#x529B;&#x91CF;&#x2014;&#x2014;&#x8FD9;&#x4E5F;&#x662F;&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x201C;&#x73B0;&#x4EE3;&#x6027;&#x201D;&#x5951;&#x7EA6;&#x3002;</p>
<p>&#x597D;&#x4E0D;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x9884;&#x8A00;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x8C8C;&#x4F3C;&#x5C31;&#x5728;&#x4E00;&#x70B9;&#x4E00;&#x70B9;&#x5730;&#x53D1;&#x751F;&#x3002;&#x6211;&#x548C;&#x7236;&#x6BCD;&#x4E00;&#x8D77;&#x7ECF;&#x5386;&#x8FC7;&#x90A3;&#x4E9B;&#x610F;&#x4E49;&#xFF0C;&#x597D;&#x6B79;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x3001;&#x884C;&#x4E3A;&#x8FD8;&#x80FD;&#x5FC3;&#x9886;&#x795E;&#x4F1A;&#x3002;&#x7B49;&#x5230;&#x6211;&#x7684;&#x5973;&#x513F;&#x957F;&#x5927;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FC7;&#x5E74;&#x8FDB;&#x4E00;&#x6B65;&#x8715;&#x53D8;&#x6210;&#x4F4D;&#x4E8E;&#x5730;&#x7403;&#x4E24;&#x7AEF;&#x7684;&#x4E24;&#x4E2A;app&#x4E4B;&#x95F4;&#x51E0;&#x79D2;&#x949F;&#x7684;&#x7535;&#x4FE1;&#x53F7;&#x800C;&#x5DF2;&#x2026;&#x2026;&#x54CE;&#xFF0C;&#x4E00;&#x58F0;&#x53F9;&#x606F;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x4E5F;&#x6709;&#x597D;&#x6D88;&#x606F;&#x2014;&#x2014;&#x7814;&#x7A76;&#x5386;&#x53F2;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x6323;&#x8131;&#x8FC7;&#x53BB;&#x7684;&#x684E;&#x688F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x80FD;&#x770B;&#x5411;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x6CE8;&#x610F;&#x5230;&#x524D;&#x4EBA;&#x65E0;&#x6CD5;&#x60F3;&#x8C61;&#x6216;&#x8FC7;&#x53BB;&#x4E0D;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x60F3;&#x8C61;&#x5230;&#x7684;&#x53EF;&#x80FD;&#x6027;:) &#x672A;&#x6765;&#x6211;&#x8981;&#x52AA;&#x529B;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x8425;&#x9020;&#x51FA;&#x610F;&#x4E49;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x4E5F;&#x7ED9;&#x6211;&#x7684;&#x5BB6;&#x4EBA;&#x3002;&#x56E0;&#x4E3A;&#x8FC7;&#x5F80;&#x7684;&#x5E78;&#x798F;&#x611F;&#x6765;&#x81EA;&#x610F;&#x4E49;&#xFF0C;&#x6765;&#x81EA;&#x6545;&#x4E8B;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x8FDC;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x6323;&#x8131;&#x684E;&#x688F;&#x7684;&#x5883;&#x754C;&#xFF0C;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x80FD;&#x591F;&#x770B;&#x5230;&#x5386;&#x53F2;&#xFF0C;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x672A;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x8109;&#x7EDC;&#xFF0C;&#x81F3;&#x5C11;&#x5C31;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x68A6;&#x4E2D;&#x4EBA;&#xFF0C;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x601D;&#x8003;&#x5982;&#x4F55;&#x6253;&#x7834;&#x684E;&#x688F;&#xFF0C;&#x8FD9;&#x662F;&#x8BFB;&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x7684;&#x6536;&#x83B7;&#x3002;</p>
<p>2017&#x6211;&#x8FD8;&#x4F1A;&#x53CD;&#x590D;&#x8BFB;&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x5E76;&#x628A;&#x7EC6;&#x54C1;&#x51FA;&#x7684;&#x5473;&#x9053;&#x5199;&#x6210;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#x3002;&#x684C;&#x4E0A;&#x8FD8;&#x6709;&#x4E24;&#x672C;&#x521A;&#x5230;&#x7684;&#x300A;&#x738B;&#x9633;&#x660E;&#x2014;&#x2014;&#x4E00;&#x5207;&#x5FC3;&#x6CD5;&#x300B;&#x6211;&#x9690;&#x7EA6;&#x611F;&#x53D7;&#x5B83;&#x548C;&#x300A;&#x672A;&#x6765;&#x7B80;&#x53F2;&#x300B;&#x4E4B;&#x95F4;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x5173;&#x8054;&#x7684;&#x3002;2017&#x60DF;&#x613F;&#x81EA;&#x5DF1;&#x81EA;&#x7531;&#xFF01;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/未来简史/" rel="tag">#未来简史</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/01/31/2017/0131MessageQueue5/" rel="next" title="消息循环几个常用类">
                <i class="fa fa-chevron-left"></i> 消息循环几个常用类
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/02/07/2017/0207CreatingAnInputMethod/" rel="prev" title="在Android下创建输入法（译）">
                在Android下创建输入法（译） <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/02/01/2017/0201HomoDeus1/"
           data-title="《未来简史》读书笔记" data-url="http://palanceli.github.io/2017/02/01/2017/0201HomoDeus1/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://avatars0.githubusercontent.com/u/13184524"
               alt="Palance Li" />
          <p class="site-author-name" itemprop="name">Palance Li</p>
          <p class="site-description motion-element" itemprop="description">学习，重生</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">171</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">22</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">56</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/palanceli" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/zchongr" target="_blank" title="我的CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的CSDN
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/palance/" target="_blank" title="我的博客园">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的博客园
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/" target="_blank" title="我的简书">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的简书
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Palance Li</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"palanceli"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
