<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Day Day Up," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="25&amp;#x65E5; &amp;#x661F;&amp;#x671F;&amp;#x4E8C; Android&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x6700;&amp;#x8FD1;&amp;#x5B66;&amp;#x4E60;&amp;#x4E86;Android&amp;#x201C;&amp;#x952E;&amp;#x76D8;&amp;#x6D88;&amp;#x606F;&amp;#x5904;&amp;#x7406;&amp;#x673A;&amp;#x5236;&amp;#x201">
<meta property="og:type" content="article">
<meta property="og:title" content="2016年10月DayDayUp">
<meta property="og:url" content="http://palanceli.github.io/2016/10/21/2016/10DayDayUp/index.html">
<meta property="og:site_name" content="Palance's Blog">
<meta property="og:description" content="25&amp;#x65E5; &amp;#x661F;&amp;#x671F;&amp;#x4E8C; Android&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x6700;&amp;#x8FD1;&amp;#x5B66;&amp;#x4E60;&amp;#x4E86;Android&amp;#x201C;&amp;#x952E;&amp;#x76D8;&amp;#x6D88;&amp;#x606F;&amp;#x5904;&amp;#x7406;&amp;#x673A;&amp;#x5236;&amp;#x201">
<meta property="og:updated_time" content="2016-10-31T15:23:37.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2016年10月DayDayUp">
<meta name="twitter:description" content="25&amp;#x65E5; &amp;#x661F;&amp;#x671F;&amp;#x4E8C; Android&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x6700;&amp;#x8FD1;&amp;#x5B66;&amp;#x4E60;&amp;#x4E86;Android&amp;#x201C;&amp;#x952E;&amp;#x76D8;&amp;#x6D88;&amp;#x606F;&amp;#x5904;&amp;#x7406;&amp;#x673A;&amp;#x5236;&amp;#x201">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://palanceli.github.io/2016/10/21/2016/10DayDayUp/"/>

  <title> 2016年10月DayDayUp | Palance's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e9c9a05f15583e8039e36cfe85103e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Palance's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', '1Grug_XAD_ps3zyBywoo','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                2016年10月DayDayUp
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-10-21T16:38:54+08:00" content="2016-10-21">
              2016-10-21
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/随笔笔记/" itemprop="url" rel="index">
                    <span itemprop="name">随笔笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/10/21/2016/10DayDayUp/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/10/21/2016/10DayDayUp/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="25&#x65E5;-&#x661F;&#x671F;&#x4E8C;-Android&#x5B66;&#x4E60;&#x7B14;&#x8BB0;"><a href="#25&#x65E5;-&#x661F;&#x671F;&#x4E8C;-Android&#x5B66;&#x4E60;&#x7B14;&#x8BB0;" class="headerlink" title="25&#x65E5; &#x661F;&#x671F;&#x4E8C; Android&#x5B66;&#x4E60;&#x7B14;&#x8BB0;"></a>25&#x65E5; &#x661F;&#x671F;&#x4E8C; Android&#x5B66;&#x4E60;&#x7B14;&#x8BB0;</h1><p>&#x6700;&#x8FD1;&#x5B66;&#x4E60;&#x4E86;Android&#x201C;&#x952E;&#x76D8;&#x6D88;&#x606F;&#x5904;&#x7406;&#x673A;&#x5236;&#x201D;&#x3001;&#x201C;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x201D;&#xFF0C;&#x8FD9;&#x51E0;&#x5929;&#x6B63;&#x5728;&#x770B;&#x201C;Activity&#x201D;&#x7684;&#x542F;&#x52A8;&#x3002;&#x548C;&#x4E0A;&#x534A;&#x5E74;&#x76F8;&#x6BD4;&#xFF0C;&#x8FD1;&#x671F;&#x7684;&#x5B66;&#x4E60;&#x901F;&#x5EA6;&#x52A0;&#x5FEB;&#x4E86;&#xFF0C;&#x65B9;&#x6CD5;&#x4E0A;&#x4E5F;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x6539;&#x8FDB;&#x3002;&#x73B0;&#x5728;&#x62FF;&#x4E0B;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5206;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;<br><a id="more"></a><br>&#x4E00;&#x3001;&#x628A;&#x300A;Android&#x7CFB;&#x7EDF;&#x6E90;&#x4EE3;&#x7801;&#x60C5;&#x666F;&#x5206;&#x6790;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x76F8;&#x5173;&#x7AE0;&#x8282;&#x5FEB;&#x901F;&#x8BFB;&#x4E00;&#x904D;&#x3002;&#x8BFB;&#x8FD9;&#x4E00;&#x904D;&#x7684;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x8BA9;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x7559;&#x4E0B;&#x5370;&#x8C61;&#xFF0C;&#x4E00;&#x904D;&#x5C31;&#x60F3;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x662F;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x7559;&#x4E0B;&#x7684;&#x5370;&#x8FF9;&#x80FD;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x5E2E;&#x52A9;&#x540E;&#x9762;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x3002;<br>&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x505A;&#x597D;&#x6807;&#x8BB0;&#x548C;&#x7B14;&#x8BB0;&#xFF0C;&#x8001;&#x7F57;&#x8FD9;&#x672C;&#x4E66;&#x975E;&#x5E38;&#x68D2;&#xFF0C;&#x4F46;&#x662F;&#x6587;&#x7B14;&#x4E0A;&#x6709;&#x70B9;&#x5570;&#x55E6;&#xFF0C;&#x6807;&#x8BB0;&#x662F;&#x8981;&#x628A;&#x91CD;&#x70B9;&#x7B5B;&#x51FA;&#x6765;&#xFF0C;&#x628A;&#x6587;&#x5B57;&#x76F4;&#x63A5;&#x5BF9;&#x5E94;&#x5230;&#x5B83;&#x6240;&#x8BB2;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x8BFB;&#x4E00;&#x904D;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x770B;&#x7740;&#x6587;&#x5B57;&#x518D;&#x53BB;&#x627E;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x9057;&#x61BE;&#x5C31;&#x662F;Android&#x7248;&#x672C;&#x8FC7;&#x4F4E;&#xFF0C;&#x6709;&#x4E9B;&#x4EE3;&#x7801;&#x6CA7;&#x6D77;&#x6851;&#x7530;&#xFF0C;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#x5C31;&#x50CF;&#x8DDF;&#x65F6;&#x95F4;&#x8D5B;&#x8DD1;&#x2014;&#x2014;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6D41;&#x5931;&#x5C06;&#x8D8A;&#x6765;&#x8D8A;&#x843D;&#x540E;&#x4E8E;Android&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x9605;&#x8BFB;&#x7684;&#x56F0;&#x96BE;&#x4E5F;&#x5C31;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x6DF1;&#x5165;&#x5230;&#x6700;&#x65B0;&#x7684;Android&#x4EE3;&#x7801;&#x4E2D;&#x53BB;&#x3002;&#x505A;&#x8FD9;&#x4E00;&#x6B65;&#x4E5F;&#x79BB;&#x4E0D;&#x5F00;&#x300A;&#x60C5;&#x666F;&#x5206;&#x6790;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x628A;&#x4E66;&#x5F53;&#x505A;&#x5411;&#x5BFC;&#xFF0C;&#x6309;&#x7167;&#x4F5C;&#x8005;&#x7684;&#x601D;&#x8DEF;&#x53BB;&#x627E;&#x4EE3;&#x7801;&#x3002;&#x64B8;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F88;&#x53EF;&#x80FD;&#x906D;&#x9047;&#x201C;&#x6B64;&#x8DEF;&#x4E0D;&#x901A;&#x201D;&#x7684;&#x60C5;&#x51B5;&#x2014;&#x2014;&#x4E66;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x5728;&#x5B9E;&#x9645;&#x4EE3;&#x7801;&#x4E2D;&#x88AB;&#x91CD;&#x6784;&#x4E86;&#x3002;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x9605;&#x8BFB;&#x6E90;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x627E;&#x4E3B;&#x5E72;&#x3001;&#x53BB;&#x672B;&#x68A2;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E26;&#x7740;&#x5728;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#x6536;&#x83B7;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E66;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x6E90;&#x7801;&#x4E2D;&#x65F6;&#x9690;&#x65F6;&#x73B0;&#xFF0C;&#x8FD9;&#x4E9B;&#x8E2A;&#x8FF9;&#x8DB3;&#x591F;&#x81EA;&#x5DF1;&#x5728;&#x6E90;&#x7801;&#x4E2D;&#x5BFB;&#x627E;&#x4E3B;&#x5E72;&#x4E86;&#x3002;<br>&#x5728;&#x8FD9;&#x4E00;&#x6B65;&#x8981;&#x505A;&#x597D;&#x8BB0;&#x5F55;&#xFF0C;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x73AF;&#x8282;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x6211;&#x628A;&#x6E90;&#x7801;&#x62F7;&#x8D1D;&#x5230;&#x7B14;&#x8BB0;&#x4E2D;&#xFF0C;&#x780D;&#x6389;&#x7EC6;&#x8282;&#x53EA;&#x7559;&#x4E3B;&#x5E72;&#x2014;&#x2014;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x5C31;&#x662F;&#x9605;&#x8BFB;&#x6E90;&#x7801;&#x7684;&#x672C;&#x8D28;&#x2014;&#x2014;&#x7EC6;&#x8282;&#x6682;&#x65F6;&#x6254;&#x6389;&#xFF0C;&#x628A;&#x4E3B;&#x5E72;&#x4E2D;&#x4E3B;&#x8981;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x68B3;&#x7406;&#x6E05;&#x695A;&#x3002;&#x5C3D;&#x91CF;&#x628A;&#x7B14;&#x8BB0;&#x63D2;&#x5230;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x65B9;&#x4FBF;&#x4EE5;&#x540E;&#x9605;&#x8BFB;&#x3002;</p>
<p>&#x4E09;&#x3001;&#x518D;&#x5FEB;&#x901F;&#x5730;&#x628A;&#x7B14;&#x8BB0;&#x8BFB;&#x4E00;&#x904D;&#xFF0C;&#x8FD9;&#x4E00;&#x904D;&#x5C31;&#x4E0D;&#x5FC5;&#x505C;&#x7559;&#x5728;&#x7EC6;&#x8282;&#xFF0C;&#x800C;&#x662F;&#x5F04;&#x6E05;&#x695A;&#x4E3B;&#x5E72;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8BFB;&#x5B8C;&#x8FD9;&#x4E00;&#x904D;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x7BC7;&#x7B14;&#x8BB0;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x770B;&#x8D77;&#x6765;&#x6D69;&#x6D69;&#x8361;&#x8361;&#x4E8C;&#x4E09;&#x5341;&#x6B65;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5176;&#x5B9E;&#x76EE;&#x7684;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x6BD4;&#x5982;Android&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x8BB0;&#x5F55;&#x548C;&#x5B9E;&#x9645;&#x78C1;&#x76D8;&#x6570;&#x636E;&#x64B8;&#x4E00;&#x904D;&#xFF0C;&#x4FDD;&#x6301;&#x4E8C;&#x8005;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x8BA9;&#x8FD9;&#x4EFD;&#x6570;&#x636E;&#x59CB;&#x7EC8;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x8DDF;&#x4E0A;&#x534A;&#x5E74;&#x8BFB;&#x6E90;&#x7801;&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;&#xFF1A;&#x4E4B;&#x524D;&#x5728;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#x82B1;&#x7684;&#x7CBE;&#x529B;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6211;&#x4F1A;&#x5728;&#x8BFB;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x540C;&#x65F6;&#x8BFB;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x82B1;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x529F;&#x592B;&#x5728;&#x4EE3;&#x7801;&#x91CC;&#x505A;&#x8D85;&#x7EA7;&#x94FE;&#x63A5;&#xFF0C;&#x6807;&#x8BB0;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x3001;&#x8DF3;&#x8F6C;&#x4EE5;&#x53CA;&#x8FD4;&#x56DE;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x518D;&#x6B21;&#x9605;&#x8BFB;&#x3002;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x8981;&#x80FD;&#x628A;&#x9AA8;&#x67B6;&#x780D;&#x51FA;&#x6765;&#xFF0C;&#x518D;&#x6B21;&#x9605;&#x8BFB;&#x4E00;&#x4E24;&#x904D;&#x5C31;&#x80FD;&#x628A;&#x4EE3;&#x7801;&#x5403;&#x900F;&#x4E86;&#x3002;&#x64B8;&#x4E00;&#x6B21;&#x7801;&#x8981;&#x5FEB;&#xFF0C;&#x5426;&#x5219;&#x8BF4;&#x660E;&#x4F60;&#x53EF;&#x80FD;&#x9677;&#x5165;&#x592A;&#x591A;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x53EF;&#x80FD;&#x5E76;&#x6CA1;&#x6709;&#x6293;&#x4F4F;&#x672C;&#x8D28;&#xFF0C;&#x6CA1;&#x6709;&#x6293;&#x4F4F;&#x4E3B;&#x5E72;&#x3002;&#x9677;&#x5F97;&#x8D8A;&#x6DF1;&#xFF0C;&#x628A;&#x63E1;&#x4E3B;&#x5E72;&#x5C31;&#x8D8A;&#x56F0;&#x96BE;&#x3002;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x5E94;&#x8BE5;&#x662F;&#x628A;&#x63E1;&#x4F4F;&#x4E3B;&#x5E72;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x67D0;&#x4E2A;&#x5C40;&#x90E8;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x518D;&#x628A;&#x8FD9;&#x4E2A;&#x5C40;&#x90E8;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x8FED;&#x4EE3;&#x4F7F;&#x7528;&#x4EE5;&#x4E0A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x518D;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x3002;</p>
<h1 id="27&#x65E5;-&#x661F;&#x671F;&#x56DB;"><a href="#27&#x65E5;-&#x661F;&#x671F;&#x56DB;" class="headerlink" title="27&#x65E5; &#x661F;&#x671F;&#x56DB;"></a>27&#x65E5; &#x661F;&#x671F;&#x56DB;</h1><p>&#x5728;&#x63A5;&#x624B;&#x4E00;&#x9879;&#x65B0;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x8981;&#x8C03;&#x52A8;200%&#x7684;&#x6CE8;&#x610F;&#x529B;&#x548C;&#x654F;&#x611F;&#x5EA6;&#xFF0C;&#x4E0D;&#x653E;&#x8FC7;&#x6BCF;&#x4E2A;&#x4EBA;&#x8DDF;&#x4F60;&#x8BF4;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x3002;&#x5982;&#x679C;&#x5F53;&#x65F6;&#x6CA1;&#x542C;&#x660E;&#x767D;&#xFF0C;&#x7ACB;&#x523B;&#x63D0;&#x51FA;&#x7591;&#x95EE;&#xFF0C;&#x89E3;&#x91CA;&#x6E05;&#x695A;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x63A5;&#x624B;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x542C;&#x4E0B;&#x5C5E;&#x8DDF;&#x4F60;&#x8BB2;&#x5230;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x867D;&#x7136;&#x4E0D;&#x662F;&#x8BB0;&#x4F4F;&#x6BCF;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6BD4;&#x8BB0;&#x4F4F;&#x8981;&#x6C42;&#x66F4;&#x9AD8;&#x2014;&#x2014;&#x662F;&#x8981;&#x628A;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x4E32;&#x8D77;&#x6765;&#xFF0C;&#x4E86;&#x89E3;&#x7EC6;&#x8282;&#x4E4B;&#x4E0A;&#x7684;&#x5B8F;&#x89C2;&#x903B;&#x8F91;&#xFF0C;&#x4EE5;&#x53CA;&#x63A5;&#x4E0B;&#x6765;&#x6BCF;&#x4E00;&#x4E2A;&#x51B3;&#x7B56;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x7684;&#x884D;&#x751F;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x6211;&#x7684;&#x8BB0;&#x5FC6;&#x529B;&#x5F88;&#x5DEE;&#xFF0C;&#x4ECB;&#x5165;&#x4E00;&#x9879;&#x590D;&#x6742;&#x7684;&#x5DE5;&#x4F5C;&#x5E38;&#x5E38;&#x50CF;&#x8BFB;&#x4E66;&#x90A3;&#x6837;&#xFF0C;&#x7B2C;&#x4E00;&#x904D;&#x6C9F;&#x901A;&#x4E86;&#x89E3;&#x6897;&#x6982;&#xFF0C;&#x5728;&#x6DF1;&#x5165;&#x5DE5;&#x4F5C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x624D;&#x53C8;&#x53D1;&#x73B0;&#x4E8B;&#x60C5;A&#x548C;&#x4E8B;&#x60C5;B&#x4E4B;&#x95F4;&#x662F;&#x6709;&#x5173;&#x8054;&#x7684;&#xFF0C;&#x6709;&#x9700;&#x8981;&#x627E;&#x4E0B;&#x5C5E;&#x628A;&#x4E4B;&#x524D;&#x8BB2;&#x8FC7;&#x7684;&#x4E8B;&#x60C5;&#x518D;&#x8BB2;&#x4E00;&#x904D;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x5BF9;&#x8FD9;&#x4EF6;&#x4E8B;&#x513F;&#x7684;&#x7406;&#x89E3;&#x8DDF;&#x4E4B;&#x524D;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x751A;&#x81F3;&#x8981;&#x518D;&#x6B21;&#x53CD;&#x590D;&#x6C9F;&#x901A;&#x624D;&#x628A;&#x4E8B;&#x60C5;&#x5403;&#x900F;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x505A;&#x4E8B;&#x65B9;&#x6CD5;&#x4E9F;&#x5F85;&#x6539;&#x8FDB;&#x3002;</p>
<h1 id="30&#x65E5;-&#x661F;&#x671F;&#x65E5;-&#x88AB;&#x626D;&#x66F2;&#x7684;KPI"><a href="#30&#x65E5;-&#x661F;&#x671F;&#x65E5;-&#x88AB;&#x626D;&#x66F2;&#x7684;KPI" class="headerlink" title="30&#x65E5; &#x661F;&#x671F;&#x65E5; &#x88AB;&#x626D;&#x66F2;&#x7684;KPI"></a>30&#x65E5; &#x661F;&#x671F;&#x65E5; &#x88AB;&#x626D;&#x66F2;&#x7684;KPI</h1><p>&#x8001;&#x677F;&#x5728;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x53D1;&#x4E86;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x5927;&#x6982;&#x610F;&#x601D;&#x662F;&#x8BF4;&#x516C;&#x53F8;&#x7684;&#x7A7A;&#x6C14;&#x8D28;&#x91CF;&#x592A;&#x5DEE;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x4F1A;&#x5F71;&#x54CD;&#x521B;&#x9020;&#x529B;&#x7684;&#x53D1;&#x6325;&#x3002;&#x5F88;&#x5FEB;&#x5C31;&#x53D1;&#x73B0;&#x884C;&#x653F;&#x90E8;&#x95E8;&#x884C;&#x52A8;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x9694;&#x51E0;&#x7C73;&#x5C31;&#x6709;&#x4E00;&#x53F0;&#x7A7A;&#x6C14;&#x51C0;&#x5316;&#x5668;&#x3002;&#x673A;&#x5668;&#x6709;&#x4E00;&#x7C73;&#x4E03;&#x516B;&#x90A3;&#x4E48;&#x9AD8;&#xFF0C;&#x81F3;&#x4E8E;&#x91CC;&#x9762;&#x662F;&#x51C0;&#x5316;&#x5668;&#x8FD8;&#x662F;&#x98CE;&#x6247;&#xFF0C;&#x5C31;&#x4E0D;&#x5F97;&#x800C;&#x77E5;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5DE5;&#x4EBA;&#x62C6;&#x5F00;&#x7684;&#x65F6;&#x5019;&#x6211;&#x770B;&#x5230;&#x4E86;&#x633A;&#x5927;&#x7684;&#x6247;&#x53F6;&#xFF0C;&#x5374;&#x6CA1;&#x770B;&#x5230;&#x6EE4;&#x7F51;&#x3002;&#x800C;&#x4E14;&#x673A;&#x5668;&#x4E00;&#x65E6;&#x542F;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x98CE;&#x529B;&#x5341;&#x8DB3;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x5929;&#x7A81;&#x7136;&#x89C9;&#x5F97;&#x51B7;&#x98CE;&#x55D6;&#x55D6;&#x7684;&#xFF0C;&#x8E05;&#x6478;&#x4E86;&#x4E00;&#x5708;&#x6CA1;&#x627E;&#x5230;&#x54EA;&#x5728;&#x5439;&#x3002;&#x4E0B;&#x73ED;&#x540E;&#x5FAA;&#x7740;&#x98CE;&#x6E90;&#x624D;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x662F;&#x79BB;&#x6211;&#x56DB;&#x4E94;&#x7C73;&#x5F00;&#x5916;&#x7684;&#x4E00;&#x53F0;&#x51C0;&#x5316;&#x5668;&#x672C;&#x6765;&#x662F;&#x5BF9;&#x7740;&#x5899;&#x5439;&#x7684;&#xFF0C;&#x98CE;&#x88AB;&#x53CD;&#x5C04;&#x6539;&#x9053;&#x540E;&#x521A;&#x597D;&#x5BF9;&#x7740;&#x6211;&#xFF01;&#x5439;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x89C9;&#x5F97;&#x8138;&#x548C;&#x989D;&#x5934;&#x90FD;&#x662F;&#x70ED;&#x7684;&#xFF0C;&#x672C;&#x6765;&#x60F3;&#x7ED9;&#x5B83;&#x8F6C;&#x4E2A;&#x5411;&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x73A9;&#x610F;&#x513F;&#x8FD8;&#x633A;&#x6C89;&#xFF0C;&#x5E72;&#x8106;&#x628A;&#x7535;&#x6E90;&#x5173;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x6BCF;&#x5230;&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x673A;&#x5668;&#x53C8;&#x8DD1;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x51E0;&#x5929;&#x540E;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x90FD;&#x88C5;&#x4E86;&#x4E2A;&#x5C0F;&#x5929;&#x7EBF;&#xFF0C;&#x53EA;&#x8981;&#x4EFB;&#x4F55;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x505C;&#x8FD0;&#xFF0C;&#x4E09;&#x5206;&#x949F;&#x5185;&#x4E00;&#x5B9A;&#x6709;&#x4EBA;&#x8FC7;&#x6765;&#x68C0;&#x67E5;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x5B83;&#x518D;&#x6B21;&#x542F;&#x52A8;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x5929;&#x6211;&#x8DDF;&#x68C0;&#x4FEE;&#x7684;&#x540C;&#x5B66;&#x8BF4;&#xFF1A;&#x201C;&#x8FD9;&#x73A9;&#x610F;&#x513F;&#x662F;&#x6211;&#x5173;&#x7684;&#xFF0C;&#x5BF9;&#x7740;&#x5439;&#x662F;&#x5728;&#x592A;&#x51B7;&#x4E86;&#x3002;&#x201D;&#x54E5;&#x4EEC;&#x4E5F;&#x6CA1;&#x8BF4;&#x5565;&#xFF0C;&#x9ED8;&#x9ED8;&#x5730;&#x8D70;&#x5F00;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x6CA1;&#x8FC7;&#x4E00;&#x4F1A;&#xFF0C;&#x6211;&#x5934;&#x9876;&#x4E0A;&#x8F70;&#x9686;&#x9686;&#x5730;&#x542F;&#x52A8;&#x4E86;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x90A3;&#x58F0;&#x97F3;&#x8DDF;&#x4E00;&#x8F86;&#x5927;&#x516C;&#x5171;&#x542F;&#x52A8;&#x8D77;&#x6765;&#x4E5F;&#x5DEE;&#x4E0D;&#x591A;&#x3002;&#x5BF9;&#x7740;&#x8F70;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x88AB;&#x5B83;&#x6253;&#x8D25;&#x4E86;&#xFF0C;&#x6211;&#x53EA;&#x597D;&#x81EA;&#x89C9;&#x5730;&#x628A;&#x51C0;&#x5316;&#x5668;&#x6253;&#x5F00;&#xFF0C;&#x4EE5;&#x540E;&#x4E0A;&#x73ED;&#x8981;&#x7A7F;&#x4E0A;&#x5C0F;&#x68C9;&#x8884;&#x624D;&#x884C;&#x3002;&#x7B2C;&#x4E8C;&#x5929;&#x201C;&#x5927;&#x516C;&#x5171;&#x201D;&#x6CA1;&#x518D;&#x5F00;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x884C;&#x653F;&#x7684;&#x540C;&#x5B66;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x8001;&#x677F;&#x4E00;&#x5B9A;&#x7ED9;&#x4E86;&#x4E0D;&#x5C0F;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x8D23;&#x4EE4;&#x516C;&#x53F8;&#x7A7A;&#x6C14;&#x8D28;&#x91CF;&#x5FC5;&#x987B;&#x8FBE;&#x6807;&#xFF0C;&#x53EF;&#x662F;&#x4EBA;&#x90FD;&#x5439;&#x51FA;&#x6BDB;&#x75C5;&#x4E86;&#xFF0C;&#x7A7A;&#x6C14;&#x518D;&#x597D;&#x6709;&#x6BDB;&#x7528;&#x554A;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x6709;&#x51E0;&#x5929;&#x6211;&#x8BD5;&#x7740;&#x628A;&#x51C0;&#x5316;&#x5668;&#x7684;&#x65B9;&#x5411;&#x8F6C;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x53EF;&#x662F;&#x516C;&#x53F8;&#x5DE5;&#x4F4D;&#x5B89;&#x6392;&#x5F97;&#x5F88;&#x7D27;&#x5F20;&#xFF0C;&#x4E0D;&#x7BA1;&#x671D;&#x54EA;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x603B;&#x6709;&#x53D7;&#x5BB3;&#x8005;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x53D1;&#x73B0;&#x603B;&#x6709;&#x4EBA;&#x628A;&#x5B83;&#x518D;&#x63B0;&#x8FC7;&#x6765;&#x3002;</p>
<p>&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#xFF0C;&#x8FD9;&#x4E0D;&#x5C31;&#x662F;KPI&#x5BFC;&#x5411;&#x7684;&#x526F;&#x4F5C;&#x7528;&#x561B;&#x3002;&#x8001;&#x677F;&#x662F;&#x4E2A;&#x5F88;&#x5F3A;&#x52BF;&#x7684;&#x4EBA;&#xFF0C;&#x4E0B;&#x8FBE;&#x6307;&#x4EE4;&#x786E;&#x5B9E;&#x80FD;&#x591F;&#x5F88;&#x5FEB;&#x843D;&#x5B9E;&#x3002;&#x4F46;&#x4EBA;&#x7EC8;&#x7A76;&#x4E0D;&#x662F;&#x673A;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E8B;&#x4E1A;&#x4E5F;&#x4E0D;&#x80FD;&#x5F53;&#x505A;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x6765;&#x6267;&#x884C;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x670D;&#x52A1;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x4EBA;&#xFF0C;&#x4E0D;&#x7BA1;&#x505A;&#x4EA7;&#x54C1;&#x8FD8;&#x662F;&#x7BA1;&#x7406;&#x516C;&#x53F8;&#x3002;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8BA9;&#x540C;&#x5B66;&#x4EEC;&#x601D;&#x8DEF;&#x6E05;&#x6670;&#xFF0C;&#x63D0;&#x5347;&#x6548;&#x7387;&#xFF0C;&#x8BA9;&#x7A7A;&#x6C14;&#x6E05;&#x65B0;&#x662F;&#x8FBE;&#x6210;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x8BE5;&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x672C;&#x8EAB;&#x3002;&#x53EF;&#x5982;&#x679C;&#x4F60;&#x8DDF;&#x4E0B;&#x5C5E;&#x8BF4;&#xFF1A;&#x201C;&#x518D;&#x8BA9;&#x6211;&#x6D4B;&#x5230;&#x516C;&#x53F8;&#x7684;PM2.5&#x9AD8;&#x4E8E;xxx&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x7528;&#x6765;&#x4E86;&#x201D;&#x3002;&#x90A3;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4ED6;&#x4E0D;&#x5173;&#x5FC3;&#x4F1A;&#x4E0D;&#x4F1A;&#x628A;&#x4EBA;&#x5439;&#x574F;&#x4E86;&#xFF0C;&#x80FD;&#x8FBE;&#x5230;KPI&#x5C31;&#x662F;&#x80DC;&#x5229;&#xFF01;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x7EDD;&#x5BF9;&#x6709;&#x6548;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF0C;&#x6211;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x8DDF;&#x4E0B;&#x5C5E;&#x63A8;&#x884C;&#x6211;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#xFF0C;&#x5E76;&#x4E14;&#x8EAB;&#x4F53;&#x529B;&#x884C;&#x5730;&#x53BB;&#x8DF5;&#x884C;&#xFF0C;&#x53BB;&#x7ED9;&#x4E0B;&#x5C5E;&#x505A;&#x8868;&#x7387;&#x3002;&#x5E94;&#x8BE5;&#x8BA9;&#x4E0B;&#x5C5E;&#x7406;&#x89E3;&#x4F60;&#x5E0C;&#x671B;&#x7ED9;&#x5927;&#x5BB6;&#x8425;&#x9020;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x3002;&#x505A;&#x4E86;&#x591A;&#x5E74;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x4EBA;&#x7684;&#x8BB0;&#x5FC6;&#x529B;&#x5176;&#x5B9E;&#x5F88;&#x5DEE;&#xFF0C;&#x6709;&#x4E9B;&#x8BDD;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x8BB2;&#xFF0C;&#x6709;&#x673A;&#x4F1A;&#x5C31;&#x8BB2;&#x3002;&#x8BA9;&#x4E0B;&#x5C5E;&#x77E5;&#x9053;&#x4F60;&#x8D5E;&#x540C;&#x4EC0;&#x4E48;&#xFF0C;&#x53CD;&#x5BF9;&#x4EC0;&#x4E48;&#x3002;&#x9047;&#x5230;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8981;&#x4E0D;&#x5931;&#x65F6;&#x673A;&#x5730;&#x7ED3;&#x5408;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x91CD;&#x7533;&#x4F60;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x89C1;&#x6548;&#x3002;&#x6307;&#x671B;&#x5F00;&#x4E00;&#x4E2A;&#x4F1A;&#xFF0C;&#x53D1;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#xFF0C;&#x8BF4;&#x201C;&#x6211;&#x4EEC;&#x8981;&#x4EE5;&#x4EBA;&#x4E3A;&#x672C;&#xFF0C;&#x4EE5;&#x7528;&#x6237;&#x4E3A;&#x4E2D;&#x5FC3;blabla&#x2026;&#x201D;&#xFF0C;&#x90A3;&#x5FC5;&#x7136;&#x4E0D;&#x4F1A;&#x6709;&#x6548;&#x679C;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x521A;&#x597D;&#x770B;&#x4E86;&#x5F20;&#x5C0F;&#x9F99;&#x5728;&#x817E;&#x8BAF;&#x9886;&#x5BFC;&#x529B;&#x5927;&#x4F1A;&#x4E0A;&#x7684;&#x53D1;&#x8A00;&#xFF0C;&#x9898;&#x76EE;&#x5C31;&#x662F;&#x300A;&#x8B66;&#x60D5;KPI&#x548C;&#x6D41;&#x7A0B;&#x300B;&#x3002;&#x5F20;&#x5C0F;&#x9F99;&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x9610;&#x8FF0;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#xFF0C;&#x8BA9;&#x56E2;&#x961F;&#x7406;&#x89E3;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x800C;&#x4E0D;&#x662F;&#x5982;&#x4F55;&#x6D4B;&#x91CF;&#x76EE;&#x6807;&#xFF0C;&#x6765;&#x7EA0;&#x6B63;KPI&#x5BFC;&#x5411;&#x5BFC;&#x81F4;&#x7684;&#x504F;&#x5DEE;&#x3002;&#x5728;&#x7406;&#x89E3;&#x4EF7;&#x503C;&#x89C2;&#x8FD9;&#x4EF6;&#x4E8B;&#x513F;&#x4E0A;&#xFF0C;KPI&#x6216;&#x8005;OKR&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x90FD;&#x662F;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x7406;&#x89E3;&#x548C;&#x8BA4;&#x540C;&#x4E86;&#x4EF7;&#x503C;&#x89C2;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x56E2;&#x961F;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x4E8B;&#x4E1A;&#x60F3;&#x8C61;&#x4F53;&#xFF0C;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x8BA9;&#x6BCF;&#x4E2A;&#x4EBA;&#x671D;&#x7740;&#x8FD9;&#x4E2A;&#x4E8B;&#x4E1A;&#x76EE;&#x6807;&#x524D;&#x884C;&#x3002;</p>
<h1 id="31&#x65E5;-&#x661F;&#x671F;&#x4E00;-&#x5173;&#x4E8E;&#x804C;&#x573A;&#x4E2D;&#x7684;&#x51B2;&#x7A81;"><a href="#31&#x65E5;-&#x661F;&#x671F;&#x4E00;-&#x5173;&#x4E8E;&#x804C;&#x573A;&#x4E2D;&#x7684;&#x51B2;&#x7A81;" class="headerlink" title="31&#x65E5; &#x661F;&#x671F;&#x4E00; &#x5173;&#x4E8E;&#x804C;&#x573A;&#x4E2D;&#x7684;&#x51B2;&#x7A81;"></a>31&#x65E5; &#x661F;&#x671F;&#x4E00; &#x5173;&#x4E8E;&#x804C;&#x573A;&#x4E2D;&#x7684;&#x51B2;&#x7A81;</h1><p>&#x804C;&#x573A;&#x4E2D;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x51B2;&#x7A81;&#x3002;&#x90A3;&#x5929;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x4E0B;&#x5C5E;&#x56E0;&#x4E3A;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x5C0F;&#x4E8B;&#x513F;&#x5C31;&#x6760;&#x4E0A;&#x4E86;&#x3002;&#x4FE9;&#x4EBA;&#x662F;&#x5728;&#x6280;&#x672F;&#x63A5;&#x53E3;&#x7684;&#x4E0A;&#x4E0B;&#x6E38;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E2A;bug&#x3002;<br>&#x4E00;&#x4E2A;&#x95EE;&#xFF1A;&#x201C;&#x4F60;&#x7684;XXX&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;<br>&#x7B54;&#xFF1A;&#x201C;&#x8FD9;&#x662F;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x7CFB;&#x7EDF;&#x7ED9;&#x6211;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x8FD4;&#x56DE;&#x5C31;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x201D;<br>&#x95EE;&#xFF1A;&#x201C;&#x7CFB;&#x7EDF;&#x8FD4;&#x56DE;&#x7ED9;&#x4F60;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8FD9;&#x4EE3;&#x7801;&#x4E0D;&#x662F;&#x4F60;&#x5199;&#x7684;&#x4E48;&#xFF1F;&#x201D;<br>&#x7B54;&#xFF1A;&#x201C;&#x4F60;&#x4E0D;&#x662F;&#x4E5F;&#x6709;&#x4EE3;&#x7801;&#x4E48;&#xFF1F;&#x4F60;&#x4E0D;&#x4F1A;&#x81EA;&#x5DF1;&#x770B;&#x4E48;&#xFF1F;&#x201D;<br>&#x2026;&#x2026;<br>&#x95EE;&#x7684;&#x4EBA;&#x77E5;&#x9053;&#x6211;&#x5728;&#x65C1;&#x8FB9;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x5F88;&#x514B;&#x5236;&#x5730;&#x7529;&#x4E86;&#x53E5;&#x201C;&#x771F;&#x670D;&#x4E86;&#x4F60;&#x4E86;&#x201D;&#x3002;&#x5F53;&#x65F6;&#x7684;&#x6C14;&#x6C1B;&#x5982;&#x679C;&#x6211;&#x4E0D;&#x5728;&#xFF0C;&#x611F;&#x89C9;&#x771F;&#x662F;&#x4E00;&#x70B9;&#x5C31;&#x7740;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x540C;&#x5B66;&#x540E;&#x6765;&#x4E5F;&#x770B;&#x5230;&#x6211;&#xFF0C;&#x4FE9;&#x4EBA;&#x624D;&#x53C8;&#x6B63;&#x5E38;&#x5BF9;&#x8BDD;&#x3002;</p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#x8FD9;&#x79CD;&#x65E0;&#x8C13;&#x7684;&#x8BED;&#x8A00;&#x51B2;&#x7A81;&#x592A;&#x4F4E;&#x7EA7;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x523A;&#x522B;&#x4EBA;&#xFF0C;&#x8FD8;&#x662F;&#x88AB;&#x4EBA;&#x523A;&#x540E;&#x7684;&#x6012;&#x53D1;&#x51B2;&#x51A0;&#x3001;&#x56DE;&#x51FB;&#xFF0C;&#x90FD;&#x662F;&#x804C;&#x573A;&#x4E0A;&#x7684;&#x4F4E;&#x7EA7;&#x884C;&#x4E3A;&#x3002;&#x770B;&#x8D77;&#x6765;&#x725B;&#x903C;&#x4E00;&#x628A;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x4EBA;&#x4EBA;&#x4E0D;&#x6562;&#x60F9;&#xFF0C;&#x53EF;&#x662F;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x804C;&#x573A;&#x4E0A;&#x884C;&#x8D70;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x4E48;&#x505A;&#x662F;&#x8DDF;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x4E00;&#x81F4;&#x7684;&#x4E48;&#xFF1F;</p>
<p>&#x53CD;&#x6B63;&#x6211;&#x5728;&#x804C;&#x573A;&#x4E0A;&#x884C;&#x8D70;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4E00;&#x5207;&#x4E0E;&#x6B64;&#x76EE;&#x6807;&#x76F8;&#x5DE6;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x90FD;&#x5E94;&#x8BE5;&#x675C;&#x7EDD;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5728;&#x804C;&#x573A;&#x4E0A;&#x9700;&#x8981;&#x4FEE;&#x70BC;&#x7684;&#x5883;&#x754C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8868;&#x73B0;&#x51FA;&#x6124;&#x6012;&#x3001;&#x8868;&#x73B0;&#x51FA;&#x5174;&#x594B;&#xFF0C;&#x90A3;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x800C;&#x505A;&#x51FA;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x53EA;&#x6709;&#x5341;&#x5E74;&#x5982;&#x4E00;&#x65E5;&#x5730;&#x671D;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x524D;&#x884C;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x548C;&#x7ADE;&#x4E89;&#x8005;&#x62C9;&#x5F00;&#x5DEE;&#x8DDD;&#xFF0C;&#x6210;&#x4E3A;&#x8FD9;&#x4E2A;&#x8D5B;&#x9053;&#x7684;&#x80DC;&#x8005;&#x3002;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x662F;&#x524D;&#x65B9;&#xFF0C;&#x5374;&#x65F6;&#x800C;&#x4E0D;&#x65F6;&#x800C;&#x5730;&#x6320;&#x4E00;&#x628A;&#x65C1;&#x8FB9;&#x7684;&#x4EBA;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x5C0F;&#x5FC3;&#x9632;&#x5FA1;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4EE5;&#x540E;&#x51B7;&#x4E0D;&#x4E01;&#x4F1A;&#x518D;&#x7ECA;&#x4F60;&#x4E00;&#x811A;&#x3002;&#x4F60;&#x8BF4;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x4E0D;&#x662F;&#x4F4E;&#x7EA7;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x804C;&#x573A;&#x4E0D;&#x662F;&#x6C5F;&#x6E56;&#xFF0C;&#x66F4;&#x4E0D;&#x662F;&#x5E99;&#x5802;&#x3002;&#x56E0;&#x4E3A;&#x6C5F;&#x6E56;&#x548C;&#x5E99;&#x5802;&#x7684;&#x4EF7;&#x503C;&#x7EF4;&#x5EA6;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x8981;&#x62FC;&#x4E2A;&#x4F60;&#x6B7B;&#x6211;&#x6D3B;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x5750;&#x6807;&#x7CFB;&#x4E0B;&#x5F53;&#x76DF;&#x4E3B;&#x3001;&#x5F53;&#x4E0A;&#x537F;&#x3001;&#x5F53;&#x4E1E;&#x76F8;&#x3001;&#x5F53;&#x5185;&#x9601;&#x9996;&#x8F85;&#x3001;&#x5F53;&#x603B;&#x7406;&#x2026;&#x2026;&#x5176;&#x5B9E;&#x8D8A;&#x725B;&#x903C;&#x8D8A;&#x5BB9;&#x6613;&#x6210;&#x4E3A;&#x4F17;&#x77E2;&#x4E4B;&#x7684;&#xFF0C;&#x4E5F;&#x8D8A;&#x5BB9;&#x6613;&#x88AB;&#x5750;&#x6807;&#x7CFB;&#x7684;&#x8BBE;&#x7F6E;&#x8005;&#x62FF;&#x6389;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x725B;&#x903C;&#x7684;&#x5462;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x679A;&#x68CB;&#x5B50;&#x800C;&#x5DF2;&#xFF01;</p>
<p>&#x800C;&#x804C;&#x573A;&#x7684;&#x5750;&#x6807;&#x7CFB;&#x5E94;&#x8BE5;&#x7531;&#x81EA;&#x5DF1;&#x8BBE;&#x5B9A;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x540A;&#x6B7B;&#x5728;&#x4E00;&#x5BB6;&#x5355;&#x4F4D;&#x5F85;&#x4E00;&#x8F88;&#x5B50;&#xFF0C;&#x5373;&#x4F7F;&#x7ED9;&#x4F60;&#x53D1;&#x5DE5;&#x8D44;&#x7684;&#x8001;&#x677F;&#x5BF9;&#x4F60;&#x505A;&#x51FA;&#x7684;&#x8BC4;&#x4EF7;&#x4E5F;&#x4E0D;&#x8FC7;&#x662F;&#x6682;&#x65F6;&#x7ED9;&#x4F60;&#x5B89;&#x4E86;&#x4E00;&#x4E2A;&#x4EF7;&#x7B7E;&#xFF0C;&#x6807;&#x5B9A;&#x4E86;&#x4F60;&#x5728;&#x6B64;&#x65F6;&#x6B64;&#x5730;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x771F;&#x6B63;&#x5E94;&#x8BE5;&#x5728;&#x4E4E;&#x7684;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x652F;&#x6491;&#x8FD9;&#x4E2A;&#x4EF7;&#x503C;&#x7684;&#x662F;&#x81EA;&#x8EAB;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6240;&#x8C13;&#x201C;&#x4E07;&#x822C;&#x5E26;&#x4E0D;&#x8D70;&#xFF0C;&#x552F;&#x6709;&#x4E1A;&#x968F;&#x8EAB;&#x201D;&#xFF0C;&#x4F60;&#x5728;&#x8FD9;&#x91CC;&#x662F;&#x603B;&#x76D1;&#x3001;&#x662F;CXO&#xFF0C;&#x6362;&#x4E2A;&#x5730;&#x513F;&#x662F;&#x4EC0;&#x4E48;&#x8D27;&#x8272;&#xFF0C;&#x9760;&#x7684;&#x662F;&#x80FD;&#x529B;&#x548C;&#x4FEE;&#x4E3A;&#xFF0C;&#x4E0D;&#x662F;&#x522B;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E48;&#x60F3;&#x6765;&#xFF0C;&#x88AB;&#x4EBA;&#x8BEF;&#x89E3;&#x3001;&#x88AB;&#x4EBA;&#x6392;&#x6324;&#x3001;&#x751A;&#x81F3;&#x88AB;&#x4EBA;&#x9677;&#x5BB3;&#xFF0C;&#x5728;&#x804C;&#x573A;&#x4E0A;&#x7684;&#x542B;&#x4E49;&#x548C;&#x5728;&#x6C5F;&#x6E56;&#x3001;&#x5728;&#x5E99;&#x5802;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#x8FBE;&#x6210;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x88AB;&#x522B;&#x4EBA;&#x8D5E;&#x53F9;&#x6216;&#x8005;&#x8BC4;&#x4EF7;&#xFF0C;&#x90A3;&#x4E9B;&#x53EA;&#x662F;&#x526F;&#x4EA7;&#x54C1;&#x3002;&#x4F60;&#x505C;&#x4E0B;&#x6765;&#x8DDF;&#x4EBA;&#x7406;&#x8BBA;&#xFF0C;&#x6216;&#x8005;&#x81EA;&#x8BC1;&#xFF0C;&#x54EA;&#x6015;&#x5206;&#x5FC3;&#x542C;&#x522B;&#x4EBA;&#x8BF4;&#x4F60;&#x5982;&#x4F55;&#x5982;&#x4F55;&#xFF0C;&#x90FD;&#x662F;&#x4E0D;&#x503C;&#x5F53;&#x7684;&#x3002;&#x9664;&#x975E;&#x4F60;&#x8BA4;&#x4E3A;&#x90A3;&#x4E9B;&#x4EBA;&#xFF0C;&#x90A3;&#x4E9B;&#x8BDD;&#x53EF;&#x4EE5;&#x4E0E;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x76F8;&#x63D0;&#x5E76;&#x8BBA;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Day-Day-Up/" rel="tag">#Day Day Up</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/10/09/2016/1008Unicode/" rel="next" title="Unicode字符集和字形">
                <i class="fa fa-chevron-left"></i> Unicode字符集和字形
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/10/23/2016/1015Installer1/" rel="prev" title="Android App安装过程学习笔记（一）">
                Android App安装过程学习笔记（一） <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/10/21/2016/10DayDayUp/"
           data-title="2016年10月DayDayUp" data-url="http://palanceli.github.io/2016/10/21/2016/10DayDayUp/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://avatars0.githubusercontent.com/u/13184524"
               alt="Palance Li" />
          <p class="site-author-name" itemprop="name">Palance Li</p>
          <p class="site-description motion-element" itemprop="description">学习，重生</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">157</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">20</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">52</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/palanceli" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/zchongr" target="_blank" title="我的CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的CSDN
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/palance/" target="_blank" title="我的博客园">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的博客园
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/" target="_blank" title="我的简书">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的简书
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#25日-星期二-Android学习笔记"><span class="nav-text">25日 星期二 Android学习笔记</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#27日-星期四"><span class="nav-text">27日 星期四</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#30日-星期日-被扭曲的KPI"><span class="nav-text">30日 星期日 被扭曲的KPI</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#31日-星期一-关于职场中的冲突"><span class="nav-text">31日 星期一 关于职场中的冲突</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Palance Li</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"palanceli"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  

</body>
</html>
