<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="随笔," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x300A;&amp;#x7ED3;&amp;#x6784;&amp;#x5316;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x9879;&amp;#x76EE;&amp;#x300B;&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x300A;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#xFF08;ML)&amp;#x7B56;&amp;#x7565;&amp;#xFF08;2&amp;#xFF09;&amp;#x3">
<meta property="og:type" content="article">
<meta property="og:title" content="DeepLearning.ai笔记（八）">
<meta property="og:url" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/index.html">
<meta property="og:site_name" content="Palance's Blog">
<meta property="og:description" content="&amp;#x300A;&amp;#x7ED3;&amp;#x6784;&amp;#x5316;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x9879;&amp;#x76EE;&amp;#x300B;&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x300A;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#xFF08;ML)&amp;#x7B56;&amp;#x7565;&amp;#xFF08;2&amp;#xFF09;&amp;#x3">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img01.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img02.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img03.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img04.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img05.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img06.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img07.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img08.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img09.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img10.png">
<meta property="og:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img11.png">
<meta property="og:updated_time" content="2018-04-08T15:19:38.648Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="DeepLearning.ai笔记（八）">
<meta name="twitter:description" content="&amp;#x300A;&amp;#x7ED3;&amp;#x6784;&amp;#x5316;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x9879;&amp;#x76EE;&amp;#x300B;&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x300A;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#xFF08;ML)&amp;#x7B56;&amp;#x7565;&amp;#xFF08;2&amp;#xFF09;&amp;#x3">
<meta name="twitter:image" content="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img01.png">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/"/>

  <title> DeepLearning.ai笔记（八） | Palance's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e9c9a05f15583e8039e36cfe85103e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Palance's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', '1Grug_XAD_ps3zyBywoo','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                DeepLearning.ai笔记（八）
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2018-04-02T10:00:00+08:00" content="2018-04-02">
              2018-04-02
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2018/04/02/2018/0403DeepLearningAI10/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2018/04/02/2018/0403DeepLearningAI10/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x300A;&#x7ED3;&#x6784;&#x5316;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x300B;&#x7B2C;&#x4E8C;&#x5468;&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;ML)&#x7B56;&#x7565;&#xFF08;2&#xFF09;&#x300B;&#x3002; &#x672C;&#x8BFE;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x6570;&#x636E;&#xFF0C;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#x3001;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#xFF0C;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x8BE5;&#x600E;&#x4E48;&#x5E94;&#x5BF9;&#x3002;&#x540E;&#x534A;&#x90E8;&#x5206;&#x8FDB;&#x4E00;&#x6B65;&#x6269;&#x5C55;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5F15;&#x5165;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x3001;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x3001;&#x7AEF;&#x5230;&#x7AEF;&#x5B66;&#x4E60;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<a id="more"></a>
<h1 id="&#x8FDB;&#x884C;&#x8BEF;&#x5DEE;&#x5206;&#x6790;">2.1 &#x8FDB;&#x884C;&#x8BEF;&#x5DEE;&#x5206;&#x6790;</h1>
<p>&#x672C;&#x8282;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#xFF1A;&#x5728;&#x8BEF;&#x5DEE;&#x5206;&#x6790;&#x65F6;&#x5E94;&#x5206;&#x6E05;&#x4E3B;&#x8981;&#x77DB;&#x76FE;&#x548C;&#x6B21;&#x8981;&#x77DB;&#x76FE;&#xFF0C;&#x4ECE;&#x800C;&#x96C6;&#x4E2D;&#x529B;&#x91CF;&#x89E3;&#x51B3;&#x4E3B;&#x8981;&#x77DB;&#x76FE;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x4E00;&#x4E9B;&#x4EBA;&#x5DE5;&#x6210;&#x672C;&#xFF0C;&#x4F46;&#x5BF9;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5411;&#x8D77;&#x7740;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x4EBA;&#x5DE5;&#x6295;&#x5165;&#x662F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x7684;&#x3002;</p>
<p>&#x672C;&#x8282;&#x4F9D;&#x7136;&#x4EE5;&#x8BC6;&#x732B;&#x4E3A;&#x4F8B;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x8BC6;&#x522B;&#x9519;&#x8BEF;&#x7684;&#x56FE;&#x4EBA;&#x5DE5;&#x626B;&#x4E00;&#x904D;&#xFF0C;&#x8BB0;&#x5F55;&#x9519;&#x8BEF;&#x7684;&#x539F;&#x56E0;&#x5E76;&#x5F52;&#x7EB3;&#x7EDF;&#x8BA1;&#xFF0C;&#x7136;&#x540E;&#x4F18;&#x5148;&#x89E3;&#x51B3;&#x5360;&#x6BD4;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img01.png"> &#x5728;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x663E;&#x7136;&#x6700;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x589E;&#x52A0;&#x4F4E;&#x5206;&#x8FA8;&#x7387;&#x56FE;&#x7247;&#x7684;&#x5360;&#x6BD4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x589E;&#x52A0;&#x72D7;&#x56FE;&#x7684;&#x5360;&#x6BD4;&#x3002;</p>
<h1 id="&#x6E05;&#x9664;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;">2.2 &#x6E05;&#x9664;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;</h1>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6709;&#x8F83;&#x597D;&#x7684;&#x9C81;&#x68D2;&#x6027;&#x6765;&#x62B5;&#x5FA1;&#x968F;&#x673A;&#x7684;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x6027;&#x9519;&#x8BEF;&#x5374;&#x6CA1;&#x6709;&#x514D;&#x75AB;&#x529B;&#x3002;&#x6BD4;&#x5982;&#x628A;&#x6240;&#x6709;&#x7684;&#x767D;&#x72D7;&#x90FD;&#x6807;&#x6CE8;&#x4E3A;&#x732B;&#xFF0C;&#x90A3;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x6A21;&#x578B;&#x5C31;&#x4F1A;&#x628A;&#x767D;&#x72D7;&#x8BA4;&#x5B9A;&#x6210;&#x732B;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x5C11;&#x91CF;&#x968F;&#x673A;&#x6027;&#x9519;&#x8BEF;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x82B1;&#x65F6;&#x95F4;&#x4FEE;&#x6539;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#xFF0C;&#x5219;&#x5E94;&#x5224;&#x65AD;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x662F;&#x5426;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x4E86;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x8BC4;&#x4F30;&#x7B97;&#x6CD5;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6B64;&#x65F6;&#x4E0A;&#x4E00;&#x8282;&#x7684;&#x4EBA;&#x5DE5;&#x5206;&#x6790;&#x5C31;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#x5360;&#x6BD4;&#x5728;&#x603B;&#x8BEF;&#x5DEE;&#x4E2D;&#x8F83;&#x4F4E;&#x5219;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x5E94;&#x8BE5;&#x4FEE;&#x6B63;&#x3002;&#x4F8B;&#x5982;&#xFF0C; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img02.png"> &#x7B2C;&#x4E00;&#x7EC4;&#x6807;&#x6CE8;&#x8BEF;&#x5DEE;&#x4EC5;&#x5360;&#x603B;&#x8BEF;&#x5DEE;&#x7684;0.6/10=6%&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x5F00;&#x53D1;&#x96C6;&#x7684;&#x8BC4;&#x4F30;&#x80FD;&#x529B;&#x9020;&#x6210;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#xFF1B;&#x800C;&#x7B2C;&#x4E8C;&#x7EC4;&#x6807;&#x6CE8;&#x8BEF;&#x5DEE;&#x5360;&#x603B;&#x8BEF;&#x5DEE;0.6/2=30%&#xFF0C;&#x8FD9;&#x5C31;&#x6BD4;&#x8F83;&#x4E25;&#x91CD;&#x4E86;&#x3002;&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x8BEF;&#x5DEE;&#x5206;&#x522B;&#x4E3A;2.1%&#x548C;1.9%&#xFF0C;&#x4F60;&#x5C31;&#x65E0;&#x6CD5;&#x533A;&#x5206;&#x5F00;&#x7A76;&#x7ADF;&#x56E0;&#x4E3A;&#x6807;&#x6CE8;&#x8BEF;&#x5DEE;&#x5E26;&#x6765;&#x7684;&#x6027;&#x80FD;&#x5DEE;&#x5F02;&#x8FD8;&#x662F;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x771F;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x5DEE;&#x8DDD;&#x3002;</p>
<p>&#x786E;&#x5B9A;&#x4E86;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x6E05;&#x9664;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#x540E;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x8981;&#x786E;&#x5B9A;&#x5177;&#x4F53;&#x5728;&#x6E05;&#x9664;&#x65F6;&#x5E94;&#x9075;&#x5FAA;&#x7684;&#x539F;&#x5219;&#x3002;<br>
1. &#x6E05;&#x9664;&#x5DE5;&#x4F5C;&#x8981;&#x5BF9;&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#x505A;&#x540C;&#x6837;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4E24;&#x4E2A;&#x96C6;&#x5408;&#x5FC5;&#x987B;&#x670D;&#x4ECE;&#x540C;&#x5206;&#x5E03;&#x3002; 2. &#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x540C;&#x65F6;&#x68C0;&#x9A8C;&#x7B97;&#x6CD5;&#x5224;&#x65AD;&#x6B63;&#x786E;&#x548C;&#x5224;&#x65AD;&#x9519;&#x8BEF;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x56E0;&#x4E3A;&#x6709;<code>&#x6807;&#x6CE8;&#x9519;&#x8BEF;&amp;&amp;&#x5224;&#x65AD;&#x4E0D;&#x7B26;&#x5408;&#x6807;&#x6CE8;</code>&#x7684;&#x5047;&#x9633;&#x6027;&#xFF0C;&#x5C31;&#x6709;<code>&#x6807;&#x6CE8;&#x9519;&#x8BEF;&amp;&amp;&#x5224;&#x65AD;&#x7B26;&#x5408;&#x6807;&#x6CE8;</code>&#x7684;&#x5047;&#x9634;&#x6027;&#xFF0C;&#x53EA;&#x4FEE;&#x6B63;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x6027;&#x504F;&#x5DEE;&#xFF0C;&#x5BF9;&#x7B97;&#x6CD5;&#x8BC4;&#x4F30;&#x4E0D;&#x516C;&#x5E73;&#x3002;&#x4F46;&#x68C0;&#x9A8C;&#x7B97;&#x6CD5;&#x5224;&#x65AD;&#x6B63;&#x786E;&#x7684;&#x6240;&#x6709;&#x4F8B;&#x5B50;&#x786E;&#x5B9E;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#x3002; 3. &#x4FEE;&#x6B63;&#x8BAD;&#x7EC3;&#x96C6;&#x901A;&#x5E38;&#x662F;&#x4E2A;&#x8D85;&#x9AD8;&#x4EE3;&#x4EF7;&#x7684;&#x4E8B;&#xFF0C;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4E0D;&#x4FEE;&#x6B63;&#x95EE;&#x9898;&#x4E5F;&#x4E0D;&#x5927;&#x3002;&#x4F46;&#x8981;&#x4E86;&#x89E3;&#x8FD9;&#x4F1A;&#x4EE4;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0E;&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x5206;&#x5E03;&#x504F;&#x5DEE;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x540E;&#x9762;&#x4F1A;&#x4E13;&#x95E8;&#x8BB2;&#x89E3;&#x3002;</p>
<p>&#x6700;&#x540E;&#x8001;&#x5E08;&#x518D;&#x6B21;&#x91CD;&#x7533;&#x82B1;&#x4E00;&#x4E9B;&#x4EBA;&#x5DE5;&#x7CBE;&#x529B;&#x53BB;&#x505A;&#x8BEF;&#x5DEE;&#x5206;&#x6790;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x4EB2;&#x81EA;&#x770B;&#x9519;&#x8BEF;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x975E;&#x5E38;&#x5FC5;&#x8981;&#x4E14;&#x503C;&#x5F97;&#x7684;&#x3002;</p>
<h1 id="&#x5FEB;&#x901F;&#x642D;&#x5EFA;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5E76;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;">2.3 &#x5FEB;&#x901F;&#x642D;&#x5EFA;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;</h1>
<p>&#x672C;&#x8282;&#x7684;&#x5EFA;&#x8BAE;&#x5E76;&#x4E0D;&#x662F;&#x8BA9;&#x5C3D;&#x5FEB;&#x627E;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x8BA9;&#x4EE3;&#x7801;&#x8DD1;&#x8D77;&#x6765;&#xFF0C;&#x800C;&#x662F;&#xFF1A; - &#x5C3D;&#x5FEB;&#x786E;&#x5B9A;&#x76EE;&#x6807;&#x548C;&#x65B9;&#x5411;&#xFF0C;&#x5212;&#x51FA;&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x524D;&#x8005;&#x662F;&#x5355;&#x4E00;&#x6570;&#x5B57;&#x8BC4;&#x4F30;&#x6307;&#x6807; - &#x642D;&#x5EFA;&#x521D;&#x59CB;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BA9;&#x8BAD;&#x7EC3;&#x8DD1;&#x8D77;&#x6765;&#xFF0C;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x7CFB;&#x7EDF;&#x9010;&#x6B65;&#x4F18;&#x5316; - &#x4F7F;&#x7528;&#x504F;&#x5DEE;/&#x65B9;&#x5DEE;&#x5206;&#x6790;&#x548C;&#x8BEF;&#x5DEE;&#x5206;&#x6790;&#xFF0C;&#x786E;&#x8BA4;&#x6BCF;&#x8F6E;&#x8FED;&#x4EE3;&#x540E;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x54EA;&#xFF0C;&#x9488;&#x5BF9;&#x6027;&#x8C03;&#x6574;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x8F6E;&#x8FED;&#x4EE3;</p>
<p>&#x5728;&#x6709;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x884C;&#x4E1A;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x5F88;&#x591A;&#x6210;&#x719F;&#x7684;&#x8BBA;&#x6587;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x5B83;&#x4EEC;&#x642D;&#x5EFA;&#x66F4;&#x590D;&#x6742;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x6211;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x8001;&#x5E08;&#x7684;&#x6838;&#x5FC3;&#x7CBE;&#x795E;&#x662F;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x4F60;&#x80FD;&#x638C;&#x63A7;&#x7684;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#xFF0C;&#x800C;&#x4E14;&#x5C3D;&#x91CF;&#x7B80;&#x5355;&#xFF0C;&#x8BA9;&#x5B83;&#x5728;&#x8FED;&#x4EE3;&#x4E2D;&#x9488;&#x5BF9;&#x4E3B;&#x8981;&#x77DB;&#x76FE;&#x518D;&#x6539;&#x8FDB;&#xFF0C;&#x9632;&#x6B62;&#x8FC7;&#x5EA6;&#x8BBE;&#x8BA1;&#xFF0C;&#x9632;&#x6B62;&#x8BA9;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x63A7;&#x3002;&#x5C24;&#x5176;&#x5E94;&#x5F53;&#x907F;&#x514D;&#x7684;&#x662F;&#x628A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x641E;&#x6210;&#x4E00;&#x4E2A;&#x7384;&#x5B66;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0D;&#x77E5;&#x4ECE;&#x54EA;&#x91CC;&#x62F7;&#x4E00;&#x5768;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x4E86;&#x89E3;&#x80CC;&#x540E;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x5BF9;&#x4E2D;&#x95F4;&#x73AF;&#x8282;&#x505A;&#x51FA;&#x8C03;&#x8282;&#xFF0C;&#x8FD9;&#x6BD4;&#x5DE5;&#x7A0B;&#x65F6;&#x4EE3;&#x7684;&#x62F7;&#x8D1D;&#x7C98;&#x8D34;&#x5BFC;&#x81F4;&#x7684;&#x540E;&#x679C;&#x4F1A;&#x66F4;&#x4EE4;&#x4EBA;&#x5D29;&#x6E83;&#x3002;</p>
<h1 id="&#x5728;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x7684;&#x6570;&#x636E;&#x4E0A;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x5E76;&#x6D4B;&#x8BD5;">2.4 &#x5728;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x7684;&#x6570;&#x636E;&#x4E0A;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x5E76;&#x6D4B;&#x8BD5;</h1>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#x662F;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x8BC6;&#x732B;&#x7684;&#x6848;&#x4F8B;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;10,000&#x5F20;&#x56FE;&#x6765;&#x81EA;&#x5B9E;&#x9645;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x8FD9;&#x4E9B;&#x56FE;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x3001;&#x4EAE;&#x5EA6;&#x3001;&#x89D2;&#x5EA6;&#x53EF;&#x80FD;&#x90FD;&#x4E0D;&#x597D;&#xFF0C;&#x4F46;&#x8FD9;&#x6765;&#x81EA;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF1B;&#x53C8;&#x6709;200,000&#x5F20;&#x56FE;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x722C;&#x866B;&#xFF0C;&#x5B83;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x83B7;&#x53D6;&#xFF0C;&#x800C;&#x4E14;&#x6570;&#x636E;&#x91CF;&#x5DE8;&#x5927;&#xFF0C;&#x4F46;&#x548C;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#x5374;&#x6709;&#x5F88;&#x5927;&#x5DEE;&#x5F02;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8BE5;&#x5982;&#x4F55;&#x5206;&#x914D;&#x8BAD;&#x7EC3;&#x96C6;&#x3001;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x5462;&#xFF1F;</p>
<p>&#x8001;&#x5E08;&#x4E0D;&#x5EFA;&#x8BAE;&#x5C06;200,000+10,000&#x6DF7;&#x5408;&#x540E;&#x968F;&#x673A;&#x62BD;&#x53D6;&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x8FD9;&#x867D;&#x7136;&#x80FD;&#x4EE4;&#x6240;&#x6709;&#x6570;&#x636E;&#x540C;&#x5206;&#x5E03;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5374;&#x8BBE;&#x5B9A;&#x4E86;&#x9519;&#x8BEF;&#x7684;&#x201C;&#x9776;&#x5FC3;&#x201D;&#x3002;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x6700;&#x7EC8;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x662F;&#x8BC6;&#x522B;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x3002;<br>
&#x5EFA;&#x8BAE;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF1A;&#x5C06;10,000&#x5F20;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x5206;&#x4E24;&#x534A;&#xFF0C;&#x4E00;&#x534A;&#x7ED9;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5373;200,000+10,000/2=205,000&#xFF0C;&#x5C06;&#x5269;&#x4F59;5,000&#x518D;&#x968F;&#x673A;&#x5206;&#x4E24;&#x534A;&#xFF0C;&#x7ED9;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;</p>
<h1 id="&#x4E0D;&#x5339;&#x914D;&#x6570;&#x636E;&#x5212;&#x5206;&#x7684;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;">2.5 &#x4E0D;&#x5339;&#x914D;&#x6570;&#x636E;&#x5212;&#x5206;&#x7684;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;</h1>
<p>&#x672C;&#x8282;&#x8BA8;&#x8BBA;&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x5206;&#x5E03;&#x4E0D;&#x4E00;&#x81F4;&#x65F6;&#x5206;&#x6790;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br>
&#x5F53;&#x770B;&#x5230;&#x4E0B;&#x9762;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x6A21;&#x578B;&#x7684;&#x65B9;&#x5DEE;&#x8FC7;&#x5927;&#x3002; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img03.png"> &#x4F46;&#x5982;&#x679C;&#x4E8C;&#x8005;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#xFF0C;&#x5C31;&#x4E0D;&#x80FD;&#x786E;&#x8BA4;&#x8FD9;9%&#x7684;&#x5DEE;&#x8DDD;&#x662F;&#x7531;&#x4E8E;&#x6A21;&#x578B;&#x65B9;&#x5DEE;&#x8FC7;&#x5927;&#x5BFC;&#x81F4;&#x7684;&#x8FD8;&#x662F;&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E0D;&#x540C;&#x5BFC;&#x81F4;&#x7684;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5E94;&#x8BE5;&#x628A;&#x4E8C;&#x8005;&#x533A;&#x5206;&#x5F00;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x518D;&#x9009;&#x53D6;&#x4E0E;&#x8BAD;&#x7EC3;&#x96C6;&#x540C;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;-&#x5F00;&#x53D1;&#x96C6;&#xFF1A; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img04.png"> &#x8BAD;&#x7EC3;-&#x5F00;&#x53D1;&#x96C6;&#x4E0D;&#x53C2;&#x4E0E;&#x8BAD;&#x7EC3;&#xFF0C;&#x800C;&#x662F;&#x5F53;&#x5F00;&#x53D1;&#x96C6;&#x4F7F;&#x7528;&#xFF0C;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x5F00;&#x53D1;&#x96C6;&#x68C0;&#x9A8C;&#x6A21;&#x578B;&#x540C;&#x65F6;&#x4E5F;&#x7528;&#x8BAD;&#x7EC3;-&#x5F00;&#x53D1;&#x96C6;&#x9A8C;&#x8BC1;&#x4E00;&#x4E0B;&#x3002;&#x4EE5;&#x4E0B;&#x9762;&#x7684;&#x6570;&#x636E;&#x4E3A;&#x4F8B;&#xFF0C;&#x7B2C;&#x4E00;&#x7EC4;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x800C;&#x5728;&#x540C;&#x5206;&#x5E03;&#x7684;&#x8BAD;&#x7EC3;-&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x7684;&#x8BEF;&#x5DEE;&#x8F83;&#x5927;&#xFF0C;&#x8BF4;&#x660E;&#x6A21;&#x578B;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x8FC7;&#x62DF;&#x5408;&#x4E86;&#xFF1B;&#x7B2C;&#x4E8C;&#x7EC4;&#x6A21;&#x578B;&#x5728;&#x540C;&#x5206;&#x5E03;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x8BAD;&#x7EC3;-&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x7684;&#x8BEF;&#x5DEE;&#x5F88;&#x63A5;&#x8FD1;&#xFF0C;&#x800C;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x7684;&#x8BEF;&#x5DEE;&#x8F83;&#x5927;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x5BFC;&#x81F4;&#x7684;&#x3002; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img05.png"> &#x56E0;&#x6B64;&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x7684;&#x5206;&#x6790;&#x6B65;&#x9AA4;&#x662F;&#x5217;&#x51FA;&#x4E94;&#x4E2A;&#x8BEF;&#x5DEE;&#xFF0C;&#x5E76;&#x8BA1;&#x7B97;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x627E;&#x5230;&#x5DEE;&#x8DDD;&#x6700;&#x5927;&#x7684;&#x4F18;&#x5148;&#x89E3;&#x51B3;&#xFF1A; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img06.png"> &#x8BFE;&#x4EF6;&#x7684;&#x7ED3;&#x5C3E;&#x7ED9;&#x51FA;&#x5206;&#x6790;&#x7684;&#x4E00;&#x822C;&#x6027;&#x539F;&#x5219;&#xFF1A; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img07.png"> &#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x89E3;&#x51B3;&#x201C;&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E0D;&#x540C;&#x201D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0B;&#x4E00;&#x8282;&#x4F1A;&#x7ED9;&#x51FA;&#x4E00;&#x4E9B;&#x5C1D;&#x8BD5;&#x7684;&#x529E;&#x6CD5;&#x3002;</p>
<h1 id="&#x5B9A;&#x4F4D;&#x6570;&#x636E;&#x4E0D;&#x5339;&#x914D;">2.6 &#x5B9A;&#x4F4D;&#x6570;&#x636E;&#x4E0D;&#x5339;&#x914D;</h1>
<p>&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0E;&#x5F00;&#x53D1;&#x96C6;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x5373;&#x6570;&#x636E;&#x4E0D;&#x5339;&#x914D;&#x65F6;&#xFF0C;&#x8001;&#x5E08;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#x4EBA;&#x5DE5;&#x89C2;&#x5BDF;&#x6570;&#x636E;&#xFF0C;&#x611F;&#x53D7;&#x6570;&#x636E;&#x7684;&#x5DEE;&#x5F02;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x60F3;&#x4E00;&#x4E9B;&#x4EBA;&#x5DE5;&#x5408;&#x6210;&#x6570;&#x636E;&#x7684;&#x529E;&#x6CD5;&#x3002;<br>
&#x4F8B;&#x5982;&#x8F66;&#x8F7D;&#x7CFB;&#x7EDF;&#x7684;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x96C6;&#x662F;&#x6B63;&#x5E38;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x8BED;&#x97F3;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x662F;&#x6709;&#x8F66;&#x566A;&#x80CC;&#x666F;&#x7684;&#xFF0C;&#x4E8C;&#x8005;&#x7684;&#x5DEE;&#x5F02;&#x4F1A;&#x5BFC;&#x81F4;&#x6A21;&#x578B;&#x5728;&#x540E;&#x8005;&#x73AF;&#x5883;&#x4E0B;&#x8BEF;&#x5DEE;&#x8F83;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x91C7;&#x96C6;&#x5C11;&#x91CF;&#x8F66;&#x566A;&#xFF0C;&#x518D;&#x4E0E;&#x8BAD;&#x7EC3;&#x96C6;&#x5408;&#x6210;&#x5E26;&#x8F66;&#x566A;&#x7684;&#x8BED;&#x97F3;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5408;&#x6210;&#x4E0D;&#x4E00;&#x5B9A;&#x5B8C;&#x5168;&#x6709;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x5408;&#x6210;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4EBA;&#x5DE5;&#x65E0;&#x6CD5;&#x5BDF;&#x89C9;&#x7684;&#x504F;&#x5411;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x5C06;1&#x5C0F;&#x65F6;&#x7684;&#x8F66;&#x566A;&#x4E0E;10,000&#x5C0F;&#x65F6;&#x8BED;&#x97F3;&#x5408;&#x6210;&#xFF0C;&#x800C;&#x8FD9;1&#x5C0F;&#x65F6;&#x8F66;&#x566A;&#x53EF;&#x80FD;&#x5728;&#x6240;&#x6709;&#x8F66;&#x566A;&#x7279;&#x5F81;&#x4E2D;&#x5B58;&#x5728;&#x7CFB;&#x7EDF;&#x6027;&#x504F;&#x5DEE;&#xFF0C;&#x4EBA;&#x8033;&#x662F;&#x65E0;&#x6CD5;&#x5206;&#x8FA8;&#x7684;&#xFF0C;&#x4F46;&#x8BAD;&#x7EC3;&#x51FA;&#x7684;&#x6A21;&#x578B;&#x5C31;&#x4F1A;&#x5BF9;&#x8FD9;1&#x4E2A;&#x5C0F;&#x65F6;&#x8F66;&#x566A;&#x4EA7;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x800C;&#x4E14;&#x8F66;&#x53A2;&#x5185;&#x8BF4;&#x8BDD;&#x7684;&#x56DE;&#x58F0;&#x7279;&#x5F81;&#x4E0E;&#x5408;&#x6210;&#x7684;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#x7684;&#x8F66;&#xFF0C;&#x8F66;&#x566A;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x9EA6;&#x514B;&#x98CE;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x6536;&#x96C6;&#x5230;&#x7684;&#x8F66;&#x566A;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5408;&#x6210;&#x7684;&#x6570;&#x636E;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4E14;&#x4EBA;&#x5DE5;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x5206;&#x8FA8;&#x3002;&#x56FE;&#x7247;&#x6570;&#x636E;&#x7684;&#x5408;&#x6210;&#x4E5F;&#x6709;&#x4E00;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x603B;&#x7684;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x201C;&#x9A97;&#x201D;&#x8FC7;&#x4E86;&#x4EBA;&#xFF0C;&#x5374;&#x201C;&#x9A97;&#x201D;&#x4E0D;&#x8FC7;&#x673A;&#x5668;&#x3002;&#x56E0;&#x6B64;&#x8001;&#x5E08;&#x8BF4;&#x6CA1;&#x6709;&#x7CFB;&#x7EDF;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x53EA;&#x80FD;&#x8BD5;&#x8BD5;&#x770B;&#x4E86;&#x3002;</p>
<h1 id="&#x8FC1;&#x79FB;&#x5B66;&#x4E60;">2.7 &#x8FC1;&#x79FB;&#x5B66;&#x4E60;</h1>
<p>&#x5F53;&#x4EFB;&#x52A1;A&#x548C;&#x4EFB;&#x52A1;B&#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;<br>
<span class="math inline">\(\begin{cases}&#x4EFB;&#x52A1;A:&#x8BC6;&#x732B;\\&#x4EFB;&#x52A1;B:&#x8BC6;&#x522B;X&#x5149;&#x7247;&#x4E2D;&#x7684;&#x75C5;&#x7406;&#x7279;&#x5F81;\end{cases}\)</span>&#x6216;<span class="math inline">\(\begin{cases}&#x4EFB;&#x52A1;A&#xFF1A;&#x8BED;&#x97F3;&#x8BC6;&#x522B;\\&#x4EFB;&#x52A1;B:&#x8BC6;&#x522B;&#x667A;&#x80FD;&#x97F3;&#x7BB1;&#x5524;&#x9192;&#x97F3;\end{cases}\)</span><br>
&#x4EFB;&#x52A1;A&#x6BD4;&#x4EFB;&#x52A1;B&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x591A;&#x51FA;&#x5F88;&#x591A;&#xFF0C;&#x6B64;&#x65F6;A&#x7684;&#x4F4E;&#x7EA7;&#x7279;&#x5F81;&#x6216;&#x8BB8;&#x5BF9;B&#x7684;&#x5B66;&#x4E60;&#x6709;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;A&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5AC1;&#x63A5;&#x7ED9;B&#x6765;&#x4F7F;&#x7528;&#x3002;&#x5177;&#x4F53;&#x505A;&#x6CD5;&#x662F;&#x5220;&#x6389;A&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x4E3A;&#x8F93;&#x51FA;&#x5C42;&#x91CD;&#x65B0;&#x8D4B;&#x4E88;&#x968F;&#x673A;&#x6743;&#x91CD;&#xFF0C;&#x5C06;&#x6807;&#x6CE8;&#x6837;&#x672C;&#x66FF;&#x6362;&#x4E3A;B&#xFF0C;&#x91CD;&#x65B0;&#x8BAD;&#x7EC3;&#x8BE5;&#x7F51;&#x7EDC;&#x3002; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img08.png"> &#x5982;&#x679C;B&#x7684;&#x6837;&#x672C;&#x91CF;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x65B0;&#x7684;&#x8BAD;&#x7EC3;&#x4E2D;&#x53EA;&#x66FF;&#x6362;&#x6700;&#x540E;&#x4E00;&#x5C42;<span class="math inline">\(W^{[L]}&#x3001;b^{[L]}\)</span>&#xFF1B;&#x5982;&#x679C;B&#x7684;&#x6837;&#x672C;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x591A;&#x8FED;&#x4EE3;&#x51E0;&#x5C42;&#xFF1B;&#x5982;&#x679C;B&#x7684;&#x6837;&#x672C;&#x91CF;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6240;&#x6709;&#x5C42;&#xFF0C;&#x4F46;&#x8FD9;&#x5C31;&#x6CA1;&#x5FC5;&#x8981;&#x4F7F;&#x7528;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x4E86;&#x3002;</p>
<p>&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x6709;&#x6548;&#x6027;&#x7684;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8D8A;&#x9760;&#x524D;&#x9762;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x5B66;&#x5230;&#x7684;&#x662F;&#x9886;&#x57DF;&#x5185;&#x8D8A;&#x4F4E;&#x5C42;&#x6B21;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5982;&#x4ECE;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x2192;&#x4E94;&#x5B98;&#x2192;&#x5F62;&#x6001;&#x3002;&#x4F4E;&#x5C42;&#x7279;&#x5F81;&#x5728;&#x76F8;&#x5173;&#x9886;&#x57DF;&#x5185;&#x662F;&#x53EF;&#x4EE5;&#x590D;&#x7528;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x3001;&#x58F0;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x8D8A;&#x9760;&#x540E;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x8D8A;&#x4E0E;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#x76F8;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6570;&#x636E;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#x66FF;&#x6362;&#x6389;&#x3002;</p>
<h1 id="&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;">2.8 &#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;</h1>
<p>&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x662F;&#x6307;&#x5728;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x540C;&#x65F6;&#x5224;&#x65AD;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#x3002;&#x6BD4;&#x5982;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5728;&#x89C6;&#x89C9;&#x5904;&#x7406;&#x4E2D;&#x540C;&#x65F6;&#x5224;&#x65AD;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x5426;&#x5B58;&#x5728;&#x8F66;&#x8F86;&#x3001;&#x8DEF;&#x6807;&#x3001;&#x4FE1;&#x53F7;&#x706F;&#x7B49;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x5B58;&#x5728;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#x6837;&#x672C;&#xFF0C;&#x4E14;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x4F4E;&#x5C42;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x590D;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;&#x5B83;&#x7684;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x548C;Softmax&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#xFF0C;&#x6240;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x5B83;&#x4E0D;&#x8981;&#x6C42;&#x8F93;&#x51FA;&#x5C42;&#x4E2A;&#x8282;&#x70B9;&#x548C;&#x4E3A;1&#xFF1A; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img09.png"> &#x5176;&#x4E2D;&#x177;&#x662F;4&#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x5B9A;&#x4E49;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF1A;<br>
<span class="math inline">\(L(&#x177;, y) = \frac{1}{m}\sum_{i=1}^{m}\sum_{j=1}^{n^{[L]}}L(&#x177;_j^{(i)}, y_j^{(i)})\\ =\frac{1}{m}\sum_{i=1}^{m}\sum_{j=1}^{n^{[L]}}[-y_j^{(i)}\log{&#x177;_j^{(i)}} - (1-y_j^{(i)})\log{(1-&#x177;_j^{(i)})}]\)</span><br>
&#x6709;&#x65F6;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x6709;&#x7684;&#x6837;&#x672C;&#x53EA;&#x6807;&#x6CE8;&#x4E86;&#x90E8;&#x5206;&#x7279;&#x5F81;&#xFF0C;&#x672A;&#x6807;&#x6CE8;&#x7684;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x662F;&#x6216;&#x5426;&#xFF0C;&#x6B64;&#x65F6;&#x6210;&#x672C;&#x51FD;&#x6570;&#x5219;&#x53EA;&#x5BF9;&#x6807;&#x6CE8;&#x7684;&#x6570;&#x636E;&#x6C42;&#x548C;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF1A;</p>
<ul>
<li>&#x8BAD;&#x7EC3;&#x7684;&#x4E00;&#x7EC4;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x5171;&#x7528;&#x5E95;&#x5C42;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x662F;&#x4E00;&#x7C7B;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x63A5;&#x8FD1;&#xFF0C;&#x8001;&#x5E08;&#x8BF4;&#x8FD9;&#x4E00;&#x70B9;&#x5E76;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x540C;&#x65F6;&#x505A;&#x597D;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<h1 id="&#x4EC0;&#x4E48;&#x662F;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;">2.9 &#x4EC0;&#x4E48;&#x662F;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;</h1>
<p>&#x4EE5;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4E3A;&#x4F8B;&#xFF0C;&#x4F20;&#x7EDF;&#x505A;&#x6CD5;&#x4ECE;&#x97F3;&#x9891;&#x5230;&#x6587;&#x672C;&#x8981;&#x7ECF;&#x5386;&#x82E5;&#x5E72;&#x9636;&#x6BB5;&#xFF1A; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img10.png"> &#x800C;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5B66;&#x4E60;&#x5219;&#x662F;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8F93;&#x5165;&#x4E00;&#x6BB5;&#x97F3;&#x9891;&#xFF0C;&#x76F4;&#x63A5;&#x8F93;&#x51FA;&#x6587;&#x672C;&#xFF1A; <img src="/2018/04/02/2018/0403DeepLearningAI10/0402DeepLearningAI09/img11.png"> &#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5B66;&#x4E60;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x624D;&#x80FD;&#x8BA9;&#x7CFB;&#x7EDF;&#x8868;&#x73B0;&#x826F;&#x597D;&#x3002;&#x4EE5;&#x95E8;&#x7981;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x4E3A;&#x4F8B;&#xFF0C;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x5206;&#x4E24;&#x6B65;&#xFF1A;</p>
<ol style="list-style-type: decimal">
<li>&#x8BC6;&#x522B;&#x51FA;&#x56FE;&#x7247;&#x4E2D;&#x4EBA;&#x8138;&#x7684;&#x4F4D;&#x7F6E;</li>
<li>&#x8BC6;&#x522B;&#x8BE5;&#x4EBA;&#x8138;&#x7684;ID</li>
</ol>
<p>&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x7684;&#x597D;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5206;&#x89E3;&#x540E;&#x7684;&#x6BCF;&#x4E2A;&#x5B50;&#x4EFB;&#x52A1;&#x90FD;&#x66F4;&#x7EAF;&#x7CB9;&#x548C;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x6837;&#x672C;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x90FD;&#x66F4;&#x591A;&#x3002;&#x800C;&#x7EC4;&#x5408;&#x540E;&#x76F8;&#x5F53;&#x4E8E;&#x53E0;&#x52A0;&#x4E86;&#x66F4;&#x591A;&#x6761;&#x4EF6;&#xFF0C;&#x6837;&#x672C;&#x91CF;&#x53EF;&#x80FD;&#x5C31;&#x6CA1;&#x90A3;&#x4E48;&#x5927;&#x4E86;&#x3002;<br>
&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x597D;&#x5904;&#x4E5F;&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x5B83;&#x7701;&#x7565;&#x4E86;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F88;&#x591A;&#x7E41;&#x7410;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8BA9;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x4EA4;&#x7ED9;&#x673A;&#x5668;&#xFF0C;&#x8BA9;&#x4EBA;&#x4ECE;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x7EC6;&#x8282;&#x4E2D;&#x89E3;&#x8131;&#x51FA;&#x6765;&#x3002;</p>
<h1 id="&#x662F;&#x5426;&#x8981;&#x4F7F;&#x7528;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;">2.10 &#x662F;&#x5426;&#x8981;&#x4F7F;&#x7528;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;</h1>
<p>&#x672C;&#x8282;&#x5206;&#x6790;&#x4E86;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x3002;<br>
&#x4F18;&#x70B9;&#xFF1A;<br>
&#x2460; &#x53EA;&#x8BA9;&#x6570;&#x636E;&#x8BF4;&#x8BDD;&#x3002;&#x53EA;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5C31;&#x80FD;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x81EA;&#x5DF1;&#x641E;&#x6E05;&#x695A;&#x4ECE;X&#x5230;Y&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x4EBA;&#x4E3A;&#x5730;&#x5F15;&#x5165;&#x4EBA;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6BD4;&#x5982;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4E2D;&#x97F3;&#x4F4D;&#x7684;&#x6982;&#x5FF5;&#x3002;<br>
&#x2461; &#x624B;&#x5DE5;&#x8BBE;&#x8BA1;&#x7684;&#x7EC4;&#x4EF6;&#x66F4;&#x5C11;&#x3002;<br>
&#x7F3A;&#x70B9;&#xFF1A;<br>
&#x2460; &#x9700;&#x8981;&#x66F4;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x3002;<br>
&#x2461; &#x5B83;&#x6392;&#x9664;&#x4E86;&#x53EF;&#x80FD;&#x6709;&#x7528;&#x7684;&#x624B;&#x5DE5;&#x8BBE;&#x8BA1;&#x7EC4;&#x4EF6;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x628A;&#x53CC;&#x5203;&#x5251;&#xFF0C;&#x4ECD;&#x4EE5;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4E2D;&#x97F3;&#x4F4D;&#x7684;&#x6982;&#x5FF5;&#x4E3A;&#x4F8B;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x662F;&#x4EBA;&#x4E3A;&#x521B;&#x9020;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x5728;&#x76EE;&#x524D;&#x5B83;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x65B9;&#x6CD5;&#x4F7F;&#x5F97;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#x4E0D;&#x80FD;&#x518D;&#x63A5;&#x53D7;&#x4EBA;&#x5DE5;&#x5E72;&#x9884;&#x3002;&#x4F46;&#x662F;&#x4EBA;&#x7C7B;&#x65E0;&#x6CD5;&#x65AD;&#x5B9A;&#x73B0;&#x5728;&#x6709;&#x6548;&#x7684;&#x624B;&#x5DE5;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x5C31;&#x662F;&#x7EC8;&#x6781;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x8BB8;&#x968F;&#x7740;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x6269;&#x5927;&#x548C;&#x8FD0;&#x7B97;&#x80FD;&#x529B;&#x63D0;&#x5347;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7F51;&#x7EDC;&#x4F1A;&#x66F4;&#x8D34;&#x8FD1;&#x5BA2;&#x89C2;&#x7684;X&#x2192;Y&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x8BA4;&#x4E3A;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x957F;&#x671F;&#x503C;&#x5F97;&#x63A2;&#x7D22;&#x7684;&#x65B9;&#x5411;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/随笔/" rel="tag">#随笔</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/03/30/2018/0331DeepLearningAI08/" rel="next" title="DeepLearning.ai笔记（七）">
                <i class="fa fa-chevron-left"></i> DeepLearning.ai笔记（七）
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/04/02/2018/0402DeepLearningAI09/" rel="prev" title="DeepLearning.ai笔记（八）">
                DeepLearning.ai笔记（八） <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2018/04/02/2018/0403DeepLearningAI10/"
           data-title="DeepLearning.ai笔记（八）" data-url="http://palanceli.github.io/2018/04/02/2018/0403DeepLearningAI10/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://avatars0.githubusercontent.com/u/13184524"
               alt="Palance Li" />
          <p class="site-author-name" itemprop="name">Palance Li</p>
          <p class="site-description motion-element" itemprop="description">学习，重生</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">185</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">58</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/palanceli" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.csdn.net/zchongr" target="_blank" title="我的CSDN">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的CSDN
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/palance/" target="_blank" title="我的博客园">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的博客园
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/" target="_blank" title="我的简书">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  我的简书
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#进行误差分析"><span class="nav-text">2.1 进行误差分析</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#清除标注错误的数据"><span class="nav-text">2.2 清除标注错误的数据</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#快速搭建你的第一个系统并进行迭代"><span class="nav-text">2.3 快速搭建你的第一个系统，并进行迭代</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#在不同分布的数据上进行训练并测试"><span class="nav-text">2.4 在不同分布的数据上进行训练并测试</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#不匹配数据划分的偏差和方差"><span class="nav-text">2.5 不匹配数据划分的偏差和方差</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#定位数据不匹配"><span class="nav-text">2.6 定位数据不匹配</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#迁移学习"><span class="nav-text">2.7 迁移学习</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#多任务学习"><span class="nav-text">2.8 多任务学习</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#什么是端到端的深度学习"><span class="nav-text">2.9 什么是端到端的深度学习</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#是否要使用端到端的深度学习"><span class="nav-text">2.10 是否要使用端到端的深度学习</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Palance Li</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"palanceli"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
